{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              19,
              19,
              4
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_1",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_2"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_1",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_3",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_4"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_2",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_2"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_5",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_5"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_6"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_3",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_3"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_7",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_7"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_8",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_8"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_4",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_4"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_4"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 256,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_5"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "tanh",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 1,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        }
      ],
      "name": "value",
      "output_layers": [
        [
          "dense_2",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.2"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      19,
      19,
      4
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            19,
            19,
            4
          ],
          "values": [
            "3+kUvyAOFD/64jnA2yEfP3NuDL4LBSQ/UEARP/pCs7/Y84O+k+J1vofv+j6C8la+YnWxv5i4Hr+n1iM/0Ihov5ufpD4hN4C/7TBnP7IdB79xzxI/c5c5P6ZSdr87kOM+QWYpwP+laj952sw/wAAGP8Vesj6b5tu+2/3XP+dLzD593xI/Cpa5PfCWOL/P5Ck/TviaP9cY9L7I4+M/VPqNP/1haz/op0W+78unvsqzqD8T8oM+aI9fv/+zBT9s2lS/N/hfvoQFjr1fFW8+W52XvB0Qmb7f6P8+YnqhPRlz9r/U3+m+fGdUv07XCD/W5F6+dHlJv9FnBsBE5CG+DbMiPhbMb7/0coS/jZrHPtZrIsCorD+/SuvJvkrEdz/Fp2A/XK+ov6Antj6UUle/YEOIPgDL1r7xWZK/W20vP/X7xD9gf4Q/n4Uuv+IlOT/3+c6/YjcVvtCbxb9DZom9HECxv+bvij/bNxA/e+yIPtuvjD5Zf4k+fHM+Pu/FCD3Jjzg/V5KQvpeur77b1Fo/MdV9v89RSr6HJMm/k8IWvvwpAL4Y+gY/f+r9v7Y+dL4VCUg/oDEvP4kQDz9WQ9C81DniPwuu37+7s4i/k/1VPYtxv76C8+O+GpXnPvX4BUCgtF8/sGwYPunqqr8QlNq/ynY4P8dPmD9HG7w/lFq/vjtc/D+882y/kXdhPyqnE0D3loE/aZkcwEyeZ7+PRqI+y/T8PYeYrb5gxY0/AP9cvXOap79ReZQ/L33dP7LSbr3BbIe+LkZwPqLOI78afIm/a5j4Px0GnD/RBsA+ipXqPvzqED94+M2+ISPePqWSC77cMHM/SpmFP2vwrD0H2j0/BFTNP7jgOL9j48G/dRrBv27Skj4aWwfAV8i9veE3mb/rA7K+UfBvPVPJjz8rit4+R6Yev7XFWj/bHRU/5z/IvsbEHb9ILb6+ovgAQC22Ar5b34A/luspPz1Mjb9kwNu/BD9gvSYOZ76Fv6g+2LkEPwXMqb+Rczm//+Syv5CZDr/wu2c9",
            "7IoZP4oPfL9W+AY/LeKxv8k31b82lnw+sAiJv/ua/j5Ai289/mwMP41CE79A280+hGJlvlrrBj5GV5i+fq3OPlMXqj5G31k/uAWsvrZ8bL7Ln6w/LJf+PzbNs764rY+/HpuzPxZdxT9cWsi/YbIYPzopjL9tI1W/UCAmP6X3vj+mJEA+Dim1PplQKL8IXjO/SPulvwCW1L7my4c/Ao1QP/jRwb7yy0E/K+C+vrNHRT/VPm8/JbIFPzoT+r5UJBw+/T9VP1lhij/4Vro/D7cBv16lnL88A+4+gDFkPm5B/L5L+TY+wjgMvT1fHz5rJCC/utcvPv4Dub9PHsc+Pghcv2tWDT8KRJc/FKeDvvzyhL96kzS/ZICNPyCdOb3unR6/xgopP3tcIL/ehOu+dHTKvmq0sr5v+QW+Ck/rvmfNJr9B+vq9rWUgPxPPlL05T5O/fhDgPsSlDL/DlYo+iNm2v7F/gj+oZUm+gufpP13LsD6SYQZAK5+lvmKPHz+CvKA99SFav4WHkb3wFgy/QU8Cv38sPD/oXNq+fitfPrVxlT9Y8Sy/IMx6vx2V679zO5w/Dv83P6QQyz4/loW/83tTPt/Itz8dH5O+Ug2oPCOWLr7Gtp2+xgiWvxqnU7+GxQs/vzlkP8Aj7L5AhOc9Tdcbvj6FU78eGoM+MkXdvglgBb+z2q8+zHpzPtqTRz95FC2/y8o/P9mPPj6u7hi95WcJPF8MQL8itDw/Ls4TP/2taj/LPw5APOhHvVGIMD8Af94/gcuiv2woEz8LQfo8+2oDvkylAEAcdDW/AaY1v7sSwr7ot5Q/EA7vPud7Uz4OfUy/TOXDP2XBRD/GsI0/f02uPV+tnz+0Uta/IEo2v+Vtm7525XQ/ecqWvv9BlT/ohuU/ZvgyP6wp0r3fmV4+8Tg2QIrc2r6KXjE+68MrvtoZ2r83C5Y/Uz5UvoxHfb7V5sY+P2JuP25P5D5l6/m/TMifP0mx1L722JW/wOUJv+l24j6qvdc9M5YgvwHT/b90G74+",
            "tw9mPsEsR76YDHs/hjbNviYqJb6odlu+P7ImPzureL9JPFW/c4IevwJcw715zwc/xCk1PzvMkT9CO1k/sOkuviatcD+0PvM/Rfo2Pk9cgj88ZlE+nzgXQOODJj7PaGy/R2ldv96rwr+MCaA/pl5xv2SkXb/0Vra/PY21vhc7aT0jlQrA4zREv18Qzj6pSSW/9F2GPv3qTT+KJJq/VQqPP8hAlb9RreQ+Opp+vjtOvj+AWzxAgLDZPn1IIEAW8PG/og8VQPFxEb5aqk7AryWhv1aQ+75nzEA+KLAqP44xLEDb9aM/5fscvxiYET6V+1e/k/3XPwHwij8zK+o+SKUSwG03sT8S6jc/sJVcv+NztT6+U5s/G7t2v9Jrjr/I7NY9rNd5vmOOZT+XyxM+jbngv1dEjb4tRAJAEde3Pvt1yD8IKEW+mikfP1QkEb8yLmY/SBr/PrI23j9Yk/+/ruraP8fVGT8tbWG+lACcP9QAkT0TsyW/suNkP5JELr1wMIm/WGLCvswKazxr1Lw9HQ64vzdxgL50a5G/ELdkv7bewj89Sr2/kXYUvqWkcb61Goq+BtEov6B6yb+H0ce9hLOJP9o6wD3CwFK/6fv1vjEPwD7tpyg/hiIvv81Olr/UQX2+p+iGP5yWXrvs2cM+xUTUPaHO4zq9sHC/igNcvaiit71vd+Y+0sGxv952/73R2rc/UqjWvUsQn7+XtYg/zhDcvr52lz5ViPC++5QFv5JyJD8fuDq+aCNgvw/qv749Suy/rpqev9cYhL8sz2W+2MdAv7wF7T/etvy8oxmivRRl/77Ldh8/oN8Pv9ji/z3nOF29doweP4dQjL/Fsrc6ANOjPve/UT8t0IQ9dy9+PQlcZL9rAdi/5h7Avj3eHT6pjKO/DYYJP8KGNL7atxk/cTOSP7azIz8rXJC/hnYyvmsTl77GVSw/JtNgv+b+Ab5uNuQ/WlFov75r4j5rXtc+Dse6PrL3Ob9YQie+SzLhvb/GXT9pjwK/PtWbvh68ob86LXw7",
            "ku+4PhTe17+7Clo/aeJ0v0rdh79U9os/XH5JP6qsAz7HkH+/ojoKv4xy0z/zZxQ/J8kLwNAaRj9OJPo/ygYCwLgfur6PoEPA+6MyP1keoT65PZy+mXpLvtfkHkD3t5G+e4Hmv0NiBj+2F6e/doJiP/ls1z05IXO/j7KVvrcY1r9kaBG/xV6Xv6RGcr97KBm/KRsmPbfH4zwh9vi9ThDwvvQM4L9Ro1Q+X4IWvjAYFD/LI4M/hfn1vmgWlr4DBy2/Z+hDvs55Cb/CK8m9gsXbP9IjL7uhJ5Y/q0HhviWp+T84q6k9MxwaP1EvQ794E6a/58owv+sucD/36cw/0+IlPvEuxr5L46w+zWG6vTNweT/NMZ09ranKPSReMb8FNzW/gjgePnQglT4p+YM9YQOqvmRrmD7EaA3A8eDGPLbet7+gFy4+C2Yvv8CtJb5VtP++x6CIP4s30TyGHjM/S3GjPWVgWz7/G6w/1cZMv2qDtLyH22u+1OAqwBlXWr+cEBNAxDUUPsI8aj95lTM/d9v/vwBOwj+t2og/oZSAPQTS0z9osAxAqTGBvz/ziT/6xCg/eW+Pv4yXGb+aM1o/1dGUP1rkeLxRIYm/l08FwGw7SL9xt2S/1//aP0VTUr1HJZK8N7acPlmnij9ygTw/tMYLQBWKaL7qkwS+YhR9PWZckb8dPJw+7QXmPxjn/j63+Yk/gy+WPz44dL6i2do7p9I5vn038j5Emgm+N8oNwOxiDb8x+em/3Vu2vTI2Yb1uiZ0/6q/eP3PKpD/BYQ5AWup1P7kbAr95ORI+RttLv6/N3z8DLvE+8uZAvq28Yr+sxP46cPFjPiH6kz9YLXe+KrWwux+NrL6kRKa/FA36vp+Xxb93Tc6+IG7jP/mP0r71/hS/svTpPzT+IECfxOC+wsTbvq3ywb+DWis+4wZev8myTT8D2jK/NEv2Px2oC79lmw4/nEy3PmsEqL+cftM/EKKsvaKPOr/c+/I/hfjFPvXnArxdWcE/diNwPwe9Ib78W2C+",
            "xxfnPpKRgL/xDj+/taGWPtPtkL5IhyS/5XgVvosJrr597Rk/6LB4PwhVhT7Qlpo/L1EPPtZ4Rj+gupw99GRHPxnwOb85oZC/1b/PPp4+qr7wdWW80rsCP9q6qL51hdc/H39JvvvIAT87Blk/qeFCPwsMjT4ONIo/HHc0vz88kj50fQc/KIQpv1N7db/Ya52+aee1vij41z766/E/DW7nvzyoHkAD71E/73hTv/e96D+Dp6o/ZItGv0iVNb8ly8g/1cTtPQ6KtD5oIta+dhM1PRuyu76805a/JIVyP4AttL+ksjW90KvuvqgB+b7XPBY/PHEaP5bO3T+lP5E+dPG9PWfNQr6pIkVAPFWkPipB9L4kzIc/qEofv7wOGj964ou/eMkCv5y5tb7kdTy/mnoUP9zpoL+DnV08KWmDv4dfGL86iKi/3NAcvkxGOcDcM5w+BqjCPiw9uL/yMfw+czexv0VixT+fiXq/EsUXv38Z0T2LJUu+uLF7P2bp576kIIS/LNz+vqkgq7+9Vcc/CDvKvkWzSr8qUEg/XYPqP7+LVr6Ty8A655KTvppgJj8rRnO/DLA5vcLJsb4XT/Q+DCYRPzVDZz/1faC/aLHFvtIKMUBNqYc/512ovwSODMAvoaq+aZLnPg9adT91upc9WMwzv6bOJz9/DJ69E9zjv/1R4j+kuQ4//SuxP2/xiT/Zl3G+4FyNv39spz9npPW/IY4gPhp81T9rOsy9rh82v7G1iL9feda/ZzCCPuCP8D58dqC9mnMBQLanQr848Uc/yvc8vSw0iT6FA2O/ijkLQKYihb/UiMg/KzGtv+HuIb92HKI/zQ21PvE/9L1tZGA/sgcDP9irl7/2qr29XEMiPwt8JD/Qe+Y+GwMZQBRdlj/2ExdAQbmhv1+AD78Pdrw/Ra0oPWrHgb8CQ38/SpzOv5XSlj13iAM/zHqFP5Dia0BLjN8+qlY/v4U1DL4XkIS/66KSPzQ7qr5qLMY/GoODv8Xv/z5VEhi/RelhP99CM7/gmW4/",
            "PgbSv8n8+j7xhqU/8B1svzZAkr9+e90+kv9iPzRugz8Gdfs+xwrsv0DVLj9ezVo/EOyKvio0ibueOBY/70q9v3NAVj9z1i0/V3RrP8SHar7xIWW/d1tDv7uCyr+++t2/yjagPmJBp76rPco/s1orPF8ygT6kiU+9uf7Svws5ur/yo9c+PetZPz58mb/NNu+/wGSfvRu2S724LFe+RmSavwLRKcB9BGI/jXiDP7CzhT0K3ye/C+hlPzgRPL+KJY8+HnpMPwZKvj4RdbA/v16Jv5UsdD9jmJ6/f7cbvqqyXL8yiZq9twK7PbJ/iT/o3Q4+gj4QPu/chj8wnE6+Jjh+v9R1F7+Xn7Q/WGjDPzCLwT/Rnpk/5FLqvTtLJb8DiOm9ZZvKvdE7u7+HK1Y/rdpZP2zwjL9QgGi/W6kuvu2afT5ExB+/pRfSPv38/D9Phw0/suuyvuDJzTzlFsK/r/5pP/DmiL1BohY9k4cPv7WeOz988tU+qeCLv92MT78/kTw/IIWlvyCfZb/AWY89RKJqPQJsjz5Zc02/rUbQPU1XWr9TBDy/HO4OQDVDqD7C2V2/txO2PlbQlb+ziha/COPnPzykYT86okK/fcLuv+VHhT1dSBG+mczivsJtUr/PZKy/VV/Nvjv0iz/BaxLAzD+7P0sGJz6eV4q/DPObPu30xj9FakW+mt31vuSRoj/6LB0/ZPNXPr2+Kr1dpWG+aEU2P8vEk75BNfi/c8JBv1MbCj9FS2o+TrZHPhKT9z/izTy//KyLv33AKz0KTJe9zhbnPs/ldj/zk409t0X0vdNp4z5Q8q6+PQ4vP9wAcT9y9Y8+zAZPv8uN7b0m1Ke/qgsaQPbw9L6swgA/gPoKQIuHoj8hoJC/DCLEvxe6irwZqLy9uZrXvwPi5T6+By6/jvGsP/bQpj+SOMQ+ZelVPzvE079ewG4+//Xcv+qxJj8puYw/qYTyPgMWML9ImkG+TeXMvpabSr9abQFAwJUfvsVI6j+SpqY+WoX+v7oIPL85O94+",
            "iq4VP/IOeD7dFx28IqNaP3WS0T7ho+O/Xr+3Pc2mMj7mcaO/1ZG7vx8lML8fq4Y/qRMyP1tqT8DTioe/7HIev5iu378t/eq94a6HP4d4rz8RfOk9YkZTP9VaCj+Z+Ou+jq4Dv3Qlrb+VPbe9aM4hPxpGmD+MKri99kicvt/+Tb+gh6a+M5OUvjXtkb5bmxo/SKHtP6SDXz7YKUc/9zKrP/gIiz2q1lC/2CCnv6Lo4r43RUW/Qke+vZHzt7+InhRAfrJFv8AMPj8gUl+/+vnBPlqVuT8oF9q/XbBhv3FBhz4Fsio/a/7Qv48UTD8NAwFA6d/Jv9ocRj+O8hg+MyWVP747676im/q+WQY2v+slpL9u4lA/f3C2PIvZnD8QFVO/pOdmP+FyAD9bMH+/muaQvrDxkz8Ua/k8NnC+vviSyz7GOUc+bjX4vaBHvr9zdlw/dw6YPkmPmz4y4bs6w4Kdv/5++D3PB8+/tNKRPtWuXL6n9au/IzsUv0l/lr8EEAg+W5ZGP/cfG7+z27G+Xp3ev9w/VT9l9DPA+br4vkIDVz/SZX6/AJj5P3QKvL5DP5A/DoOEv5JCOr96l3+/v3+uP6ozGT/Iy/K+JmEOvSYmfL3zWYs/YKd2PwfgPD9Thpa+4OAXv1m2QL/GvwHAkD2FPqLQv7/noG8/P73FvmOEYb++JiA+R61HvxxZvL+zpaY/q+ehPwAjlj+zRK2+3Gyjv/7w3j4Aco2/xTTcvlXRA79pk7I/QLS2PqUEBz+m9mi/oku8vjWhk75e0EK+v62mv3vaKb7NDRo/PRBWv36GWT59SCfAEdx6vxj3uT8Fy2u/NsZ1PgtHlj/l3QU/HmcCv/fxvj+FtKC/PuFCv4zrez59Am+/nVN8vqXyNL9uMEW/Zz2Vv2zwuj+iYdW/9hcSP/LzFEA8kOg+ujiqvmIPUj/stvY9RpUfPj7MMb+b8aq/z46hPfLgNj59yhlAYJhoPxPSvb/6uuO/hrcywA3TnD7y76++YRrOPE+aDr8Elew/",
            "j9/lvW8XGr8EKNu/PrOmv/LHB8D1ZAQ+6ZmAPu0nkD+wsEy/lX+svu1kdT+KAgu+WJK8vr/jWb7ffx+/rv1aP4djQb8Xjl+/rxmJv4OFDT+2SXk+QCCXv89lBz6CgRe+z3sbvwrfAECOTBrAk/UkwAE0z78j1+g+xyuMP9injb9QI+C+LDX+vnxEFD70HkW+LEyBP6ZH8D7VgDO/YmQTP2Vu0T+pFXy+Ub36vfjNdz/GiFS+QSKfPgvy470aUKW/j/1gv9RgXT/Lu3u81V3dvlyIPL+X9w1A/ZUbvmfEnb7y/So/QrWHv0QLGT8RI92/9eUYvsuDmT7c7qW+69YAwPAL078I2IC/03LqvuriTMCiiHq//1ATQM8vEb+qlI2/ojcev2+gvT3Cb1+/74Jov6XZB7/cAeq9nN0aP/+qXD8s9Kg/5hVOvgqglz/R9Di+StSIvbLE9r6wlI2+oeOvPwp2h7/f7O+/lILhP6ZpKT/AgyI/UZ2yvriQE7/GCHO+polSPxTBdz9LpAHAT0TGPg=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            1
          ],
          "values": [
            "AACAPw=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "batch_normalization_1": {
      "beta": [
        "7p2tvSQGnL3FM4G9hSRdvSylDTyPIpe9reoOvXz07r2cbOA8EUslvPwutLxSNgG9E2/Zu8HaL72KlVO8HeN0PQ=="
      ],
      "gamma": [
        "5DpqP3Ybfz8fw3M/NgKFP20xgT+F1Ws/VtSCP7a5hj+1BG4/1KWCPxEZgj/XOoo/xOGCP4AwgD9Jg4A/u6x9Pw=="
      ],
      "moving_mean": [
        "zaEfPkEZaD0IkNY99S/ZPYR5kz2H6Gg7cRAsviMqPD0yEf29IRuCvZCnB771XLW96+wbvXaJxj3hCka9eqG1vQ=="
      ],
      "moving_variance": [
        "KN40PSFNDT0GckM9e4MtPbG0Oj11Vsk8N6tIPQSTSz0gTCY9pisYPXriYD1XFVQ9VcgKPXxeEz0tBhM9xRvtPA=="
      ]
    },
    "batch_normalization_2": {
      "beta": [
        "17gCvul4N75Tyk+91De/vXzDJL5m4AO+9YGavUK6Lr5fUO29Rv8dvgys970QbgC+IRXYvWJXKb5P+Fy9Y+H2vcHb/707GpO9tt+8vel2tr01m9+9ju7avbgQ6b15Jre97RDYvWCznr2UA+m9orh4vTHpj71pLA6+yhGzvUYw8r0="
      ],
      "gamma": [
        "QKB+P/E/gT+eHIE/JhqAP636gD9/In4/FER6P7aBfz/bk34/4vh7PzY6ej+hD4M/+HiBP0bYgD8gpoI/bmp4Pxldfj++wnY/EUF/P11Agj9XGH8/RlR+P/C/dj93hYU/IieAP1CTfj+824E/qQeCP9+jdz9V6YM/heuAP7HmeD8="
      ],
      "moving_mean": [
        "aiRdvuSrfr2DFyi95ZQLvn8s/b1pEie+Q7UVObq5hL07Ngu+H0MbvcwiZb5mBZa8S82dvJrkjL0LIoK+37wUvT/RX73r7n69fjk8PWQbL76DH4y97j5bvpxB6L2F4kq9rlSSvU38azsNO5W8rNpmvp6MDj0QLE690c9sPco4Vr4="
      ],
      "moving_variance": [
        "slf3PpkN8z4Dd/s+r5/9Pi3y6D5OtzI/KpgJP2ZK/z5lyRE/7M8gP3o/5T7ULQg/GDjoPtTIFT+m6/8+KWINPyfB9T7KQBk/jAoAP15+Az/8iPQ+dUMIP68cDD/8nQ8/t6gEP6rcGD+4DBM/XhkFP/Um+z5Idvc+epMbP4lmFT8="
      ]
    },
    "batch_normalization_3": {
      "beta": [
        "0w4tviLD+L07jCu+DDkNvoF2C763tDS+epM9voheLb6i30G+OFYPvpd5Qr6TpTu+H60TvpBCHb7lvDe+k4Q8vrC8Kb7bBVC+fOABvp6zM75wBVu+Tvc4viaQPb7zfNm944tIvvjq7r1hOiS+po0uviaZ672L8Tm+RPkcvjt4Bb6csze+3CUovl+cxr3tNeu9qn1lvj59NL4qole+uEr9vfHU3L1TKiS+OxYgvtUjLb6Trlu+DPQZvrigSL4jZyC+xvRsvoNgUr7blRm+S5AjvpeeMb53nkC+JMu/vVRaLL7yUz++Eh0UvhtDPb77ECS+R6msvSzXHL6TpA2+Bywuvg=="
      ],
      "gamma": [
        "na19P633gj/bNYA/BUSBPzgcdz/JnG0/Pvh8PzH9gD+0XII/d6F+P1vogj8pcHo/PpmEP9jXgD8+F3s/DRt8PyvGfz/UXHc/Inl5P5ardz9lAYM/8XR+PxtwfD+bK3g/2OGAP1z/gD8HE34/p3B5P7Ddfj+tzH0/F7h3PzOTeD/vNX0/IuuDP3/Jcj+l13s/BQaCP29QfT8rPYA/jFp0P7KTez/RY3s/afGAP5npfz+iFH0/bQd+P8rIgz9fAns/immAPxdcfz8DsHc/aIJ8P3OofT8khoE/q1eBP0yhdT/MV4M/1Xh3P7Mkfj/0Bn8/GVV4P0fGgj8fYHk/tet5Pw=="
      ],
      "moving_mean": [
        "uOK1vf2y7L1XCCq97ENTvsjagL3apgc+bkKGvVFhY754Pss869gaPH2Glr3CU5q9G0jCvVWMAr5OQiu9lRqQveX6xr1h8wy+jfaLvWgyxb2l8z29D7HPPQJPIr7Ak4W96IFkO+HAVr5Gm9q9K9FvvPxIPjzmFbe9CgP4vRtYFb3Ox169eRSMvQ2O/zs0qx6+wCmNvQqi8b02HVq8IM8jvfpzB77B6Ja9fU4svgJphLypPjq+ywBPvnAa572QLQC+gJ8KPYl/3b1K4B2+kCKAPZTgP73O38S90KQcvqVf7r3IBTy+xrWKOREudr0f5JK8ROYcviLTt70V/aO9W4h9vQ=="
      ],
      "moving_variance": [
        "vR8kP+SuMD+Pkx0/GMIeP/2PFD9CcCY/sEoUP0E2JD/pBhE/BegiP1GPJD+fPxo/Jr0fP2ToID9l6Bg/fE4jPzvpGj96ziU/dJsKP7GuGD/29hQ/eRcZP7kWEj/vHh8/wgsaPyjvFj+M7yA/oZYfP21yHz/vCA4/DV0XP0mTGz9IBhI/2NsdP6LRFD+erCs/JOwXP6b5HD8VaiU/3/4IP2e9FT+AUhg/VAocPwN8Gj+JBiM/Jh0hP6CJGD+r9S0/8WsaP/j8Dz+2ASU/z58lP5NOFz9bEho/MawXP2q6KD97wyo/U0IVP7omKT/+Xh4/nhgTP2PvHD/T+SM/XCUQPw=="
      ]
    },
    "batch_normalization_4": {
      "beta": [
        "oWeivR9MCb5cnSK9UHXgvZHdOr1t+6W8mdz0vEROmL1i0Ma94UaIvYgM/rxUKKu9SYp9vS8mcr5kwcW9ROOSvSiG3r0SG6q9C7OTvV/dC77035C9Y4CfvSV+5L1j3Me9h74Xvq9rlL2tmxq+KJnWvDNj1r3x9Aa+kDTPvRDeyr24BTW9KIC/vUW8270/UlO+eIBjveJ9AL6Y9b+89RAvvSYbVr6mvea9YbYJvkf0A77R5a29A4EBvV0eFr2zqzK9Ah6nvcShkL3GGfK9OYEovSITCb6NmbS9k6LPvRQQDL70rAm+C91bvSe5Er5Syf29U8yrvRweDL5nkN29o6H4vQ=="
      ],
      "gamma": [
        "2a2zP/JWtz/Plqk/ou+bPxDTqD/EkZs/bAnFPzkNkz9GSaI/TfK0P+TCqz9ESZw/owGkPzpfxD8DAa8/ECuUP3lepz8AVLo/jWSoP3p3nT9WQLI/2yOYP3qonz9E/Z8/CaKpP2jkxD+62sY/kRK2P9Nxrj80c50/Yua9PzKzsT+Vb6M/SEGyPzKLoD8Htck/vhKwP/yasj+KDKg/rk6tP9sMuD+aXak/hPnIPwf2oT+B/bE/I2+qP6gYvD+r8LA/rQqeP+Qpmj/bfqs/rty7P4ersz+VLqI/oqaXP4uGmT+y76A/s9y5P6DKrz8/P6Y/NzihP1fmqj/NpK8/NqauPw=="
      ],
      "moving_mean": [
        "MZ1jPYJlELwuJmC90GndO44ChjuRY/s97I7Wu6fHC70jZDm99q1IOtT6B72P4Cy9SGFVu7kDVD2a+aa77OZ6PXunVr3PGk887qNwPX4MSz0mN7K8pEeCPcYNKz2sAfa8JFyjPcmPlbzO2Os8bKWJPSn30bu9s4U965zEPNRfozyplpq8tqiHPAwozjzaqwI9Q3gBPcDEozyQpMK9ZYE5vUsWFD0YLB09HyL8PfURLr1UEdq9SlSyvR4fTz2c/Na82yMLOpm1Rj0XVRE9MDH/PJqNFTxYoRA5DOCxuxVfFD0jx5Q8qOfUPWa9nTyzOX49ws4JPR3gwD0xtpm77nwqPA=="
      ],
      "moving_variance": [
        "HJHJPn5wwD49svE+CVPwPpw+1j4IbgU/1TblPrT/Dz9rFfc+iQXWPtqH2z4J9AE/JR/bPkjJtT7mVt8+/dj5Prttxj5l2/Y+7vbRPn9L1z43SNY+AcwBPxgR4D7tNeo+HfvgPr7gwj5a27w+F/rpPgFqvz4Lvu4+3L+9Pqihwz7zr+k+t9e5Po3u3z7mTr8+OmXnPrpD1D7cNtI+ONvXPuqj4T45DtA+q+O7PkOqAj/+3NI+vhnSPnmx1j5owr4+N1vxPlZQ6j6L/88+273WPm4axj7cyec+m/fgPpdDAD+8Kcc+6zviPskj3T4N5co+t6cKP2wa2j4zhNw+4vDVPg=="
      ]
    },
    "conv2d_1": {
      "bias": [
        "vYGCOyLG1Dof7qk8AiHHvPVniLxxOAM9Spk3PZgF7jzHUSe8bMiwvLNZDjwUatC7WM92O1+VsrzQ3d88v0fXPA=="
      ],
      "weights": [
        "jnIePvHJor10dT0+XtSUPF7Uaj2PaxQ+f98QvaDyjTz04wO+b1EvPqH48b1d+o+80Hleu+TWTD2CFsk8G1mBPVURmb2bQ9m9fcCQPp4DHj6TvFA9LFtcPqrrdb4YuBk9z50cPVyBET6Y/pA8nZ78PWtnjj0WiWs4fuR8PjiMxT2E8g2+TF8lPqf2Ib3j5CE87qdoPGSoqL3HBEG9sgurvWEKHjxrpzK9Trs1vvPgRr0iRTA+JvmHPHBCy71MhOu94DQHvk1NMD54sTq+Pf4bPa1N2z26Iiw9u8SjvkS+BL4rfNy945GZPf7LEr5+tnW9P3+5vZkGIj6wXSo+z72qPQe/37wwovg7zXj6PHXmgb1ndGg9JTPyvdcj872f6Ke9NPEzPpnLuL2Gnwa+hYbHvVMJMb02pOY72F+uPQj0pT2223c9bo3ovR+7B76f5jC+4/UUvh8lzb1Sb3Q7dLLtvI8TEr7UxMS9Q02jPtMFrDxAw8o9gJvnvYtaTb4OeBK+t2U0vSPb6r2RJRi+Z7ykvYpymT064n+9YOUVPmpqhj2bsrg8mfSlvVc0hj6BEQo+giasvNM6zru/QDK+lNDOvVnySj3XEyI8mVupvXVOFb2I3hE+6yvAPXtVJT7nR109sG/6vDHjC77TnwQ8xgePvcwy/7vydUq+bSYhvdP26b1Yn0S8nVk6PskdMD3HiiU9vT0TPq5tAj7zhMW6BM26PDpC2Lt2G1o+rHyiPQHGYz2fExS9MrdIPgo9Q74mAFi7Yu1NPeg5jjwTPMo9hLmXvAkvzbtYh/K9BHOkvB0urL32WrA84xzHvQJucT57/LW8x+ohvuo8Dr6V4A49JU0SvTT+CL7be/k98407PZ2mGTyMrA4+RRvEvBizLz6N62Q7M+UEPm2Rur0wmu89AlhnvJDpPD07sz4+9ohXPlVWpj2E+da9HY2RvASXTzxWDlQ8Zo+LOVdv2bx63lc+LqbFukZ/w7tLy8S9Pxkcvr2l5b0IuqY9Y+7hPc5EQz434LA9",
        "Jla0vc3xYj6MdQO+NuvnPPdb7L3NfoW+/nzuvYXW4r336Iq7xuKJvqwfPL6oJ0u+d7uyPTperb3p8TA+NeizO/b14LzagTW+tmJOPT9eUr0SBxQ8E5CkPVzN8L2HIYe8ZB/XPOeXBz5C5vK8dZspPemMYr1h6Xa+WBO8vEGzsb0pq4y8QijmPUaL3T2l5q49R7OKvbgNr72OuSe+KMWsvXz/sL3xitM9rWOFPUexNr3Hkx8+E8slPnXDd75OALC8gom6vdRLQz754n29IumkPEKFCz7vm2A9rTQSvrZIZrx2Fcu9zOwoPoQWVr7jQ588xKaYvQO06T2mP6Y9pt0mPkS7nb37hAa+8DkGvoGArbw2WtS81wu6vayX9r3Yifq8xfwIvhkZbT7xSNG9Xk2aPV3atL2Ehl6+ICqiPWA9RL2WOac9txeQPvsXGD5NCig+xBYeum9u/b2+YP08G0FYuz2tDj6qIpK91FoJPpMulz3dPdw9nTAqvrTlLL0AlKC9zTfzPSs6WT3QNzs9/3cePQBnYb3ZmZ+9gEVGPqkdDby6boG95oLxvfFM+z2qaBW9AlKNvLHgtb2X5Tc9QK3TvEJUmb19eTC+xChaPiFdR7wLG/w9qUQkPqMXCz5iKdY9rUU1vm48wL1f2BI+u6ShvMQH2z1jU3i+0EHPPAh7j713LKW9g4jhvGqWOT56I789BDTIvSaO6b1wPBq+MWG4vSDjlL08HLK9D8iIPU1KgLz3cAs+qysMPtspFbw2RcM93tI/PeLgbr1lVki+7rIBvuQ5lT2hmZk9YXBRvmElb7sOd249r/uZPoWaWL4J+OI88WINPMQEYb5gpMW9eMAevjmfGr1ASK09Af9LPhsslT1Ddg2+YFdQO7PdDL1IR8E73pl+vSQrIz3cNSC+YwvFu/eiE77MzJQ+rQ9Nvv5Gpj1eHRy9aHtevl6s4D2DrVC9obTqPIr1Fj2q5529iFOAPOHDET5M1/s9BO0dvfdYvDzXrrW9B7cTPrccr7200QQ9",
        "VLnLvZQ6Hb1WUTw+NlyrPCiPJz4pXmY+7skOvjLAiD1Wrfi9bXMBPpzKAb3ZC/28K+yyPGcKqb13lWM9ZTanPOCQkTw2aIA+2TlGvosHpzpkUvy7Pa4Yvip2ND2/0CU7/6TKPMdJGz7N4H++xXBhvZarhD2Br4o+logePm+iFj7Dov+8miK1vHfMLT00CRk9nz0vPTnYHj4DMU09qCc3PABuhLoS1jS9i3wmPdnOPj0SmSs+Rx4bPthOED5AqFk98riKus0aPb5FeM49q/x7vd97jL3Gl0k9HHxSPJ+SJD209/Y9otGGvZxXvr0xtN29gtXYPYeyND5qYXw96NNjPajcN72l3aI+TNVevJKRnT1SPNO9yXGEusUoBL758oO9mvCNPK+sMjyfD/K8gdD6u3xZmrw0dQK9NijSvc5Yh733UJ29pKcMPlV4b7302eU8ClbqPSVNwD1hil2+cCieveJyzzv2S3W9uiKLvsGELb6oyAY+2MokPiNVED5IiVY9Q5HfPTYBJD71XTI+VO+XPSlvnDwtlWI+c0WRPTCMoz0x2Oe9a+z7PaPxE768d3W9/GajPcfa+b24SU2+kVXBvE0aPb1zjoO+QsRAvqBTGr48A7S9+4AevhN7jD1jEAm9NIv4PL6qQD0tV7q7LXRyOyNEabxFfde897gfveAen7zh/xC+TsQAvsqAUL7Au568jtGWPc52VjwvOGY8jgUWvPKi3T30M1U+B60dveVg4T0CoqG9FDO0PfmtSz791qg93KZQPcNjUz4zVBO9X3yjPSa1AbrjtzO+FEJnPsRYPj324wu+WnsvvoRRy7ztUxe9qCfNPOK/8T0ajT++F6UMPbhN3L2hmUw+qSyzPVXOPj5KvhI+PKcyPj8sF72t9Io949yJPZnb7zwY+Ic9wCoKPvho872c7vI9HeUsvvYP3j1Wz2A9KBG2vIvM/r3KCAq8uXpYPS7RIL1qDHo+1XL+PaDIzb1eFM49Y3UDvkUvzD1azqq8sQqmveeRQT5IShs+"
      ]
    },
    "conv2d_2": {
      "bias": [
        "9FmAPC+ptbzrUBe8A3r7vPZ1fLwbCp67hVb2vL1qz7xTpaC8IZn0PCQX6jwx2si8xeLCPD/2UrpYpho93PFzvQ=="
      ],
      "weights": [
        "+YgbPX1Ocr2cigC+pAfcvVO4Fj6x6T07GA+IPcux2jxCbCS9iSvCvahIJr6K5Oq8JqoUvRijDz4VaDm97wPHvZwNxT3gUw++LengPYr2gT2t9BG+FN9rvjTMEz4eOQe+yvgpvuR8KL6XUua9OVMFPqPpmj2d6349KAObPEn6AD4025M9aUm1Pdw7Kj5cAv49ZKa5OgASnL3fAvC9mfu5PS1Fnr08xI89lZzbPZq4aj6ypo68HJVMvAwXHz5W3U+9ut4Qvrrx+7tSo1E9K2HEPZf0NL6KLc89fPXhva8jUD1LYHM9wWGwvSrT7L3EySi9QoEcvYve0z30hCK+QRjwOohkUz3mdxS9I93bvQIFur3/k3I80n+zvc+0tjyipJG9qJIbPLB4LD7Bo3Y9cNcLPskEEz4vx3U8LlQ2PTZE7j2Muyg9dcPqPPerpb1hG+e9ZF/HvF55nzyIfCi86AGePQHtyDprFA8+/JfevQdvo72zbe28pdzXPSgI8z24GyI97XGkPLVxSj44N369CgSWPSQquDqRFwY+Pn78vHrc8z3ElgI+4naJvYl4HLzUNSQ+MZWWPdUxFr4jAFK9UeIcPsjEKj7A2Pq8lUVqO9Pss73ROyg9yEIOPqIwRb1UZA++PPZLvFU27j3/xYk91HaaPXvGwrt3TNq71Qq8vYadND0ePYQ863ERvuSaab3V5QW9aZwKPn4ySr16iw0+nO7svJdcpz3wjgm+uX8YPp1NnDvASLe6yqr1Pfrt7ryZUk296RnavTIVob3uFyS+tbm5PQqgHb4oMxs+2yDVPFwW3LuLObu9xx/dvRkA2L16uxy+vK3gPcPe4DwHUh4+FshGPt41mzypP4O9Py/TPYe+2j2Pfbq9L00wvvSVDD6szE2+i6fcvRhIDby137C9PrQ8vZpdiLzbNAc+amuMvU8DR73vKPa9rbUePuP5Hb6wjI48o0vcvdEgaTxwNbS8UIgWPbcFjL3i+Ko8brljvKe2AL4+tj++xtwJvgHjvryQp469",
        "JP0kPk6HpL0aoTu9CcqfPePtMT4DF/G9CWgJPsKYpD228Rg9XtQcPntclb2sA7w9tvBnu2Xkuz1kVxu+PssrPs3UH74Pse08jUrCu4XyIT2rkD69zQh3PKUehz1YCuw9knAMvhQnNb4Mpqs8U2siPoTZwTv0Zpi861unPce4UT4ajiG+CzgwvDlmkL387wE+NtGLPVPdLLz6vuO92FamvQYSNb6Agi88jXIYvg7fAL2sWZE8neoEPWZWcL0EcuO9ImxcPQoiCD70Q+K91B7MveWNDL49Z4O8RgdOvmmDhj3euQ++ZwsuvlFpjrxCH6E95zFDPAch4z0qcUO9X5UQvpUc4zyqWwY9pScWvb4GtLxy2Ys9N8HTPU0AiT3LJBq6ubY+Pqsibj0Itpw884ucPBQW+710+SU+i0UavkyWLb1/guQ8TF6YvfCj5j2TSPo9RbcevbrP1D1MHAU+epm6PU1mkL1UKJa9P+csvcUE3r1hp+g92YOBPFZrrb3G6WK7AuatvAZOKTvInwU+RPICPhu1DD7Dxaw88wy7Ow4eyTz/3C0+/UJgvjhdJT4SVDA+iS4CPiNuPr0wuMC9bH+wvbZEMj3Q5vO9QRQuPeVc9T0dFO+8f9DNvaw9ML5qcCi9o+8evt65Ur2IqCY9O7CrvdPY3jyg44C9tnXYPSUJqT3KoXa7AFEvvpkoID49QwU9w+CDPVndLr7i0Qi+gyIjvc4JWj49Jk6+WCWMPOJ34LiOEl+9r/B3vLSnpb1P4dk7Jn2nvR2vCLw/1Ya9cLCpPT2m/jwLfEC9AS/nPJpEPD71AE87WIUmPvknC77rook8vlAKvoG8Kj1vY/E9SRNsvrqVsDwM8Yq7tSKEvbUbHD7d5ae9QprRPWkGLD1MKPW8X94IPka17z396BU9XmaRvJ8/E76PcaK9apZ+unagtbxhZgg+PxemvRMxar3i+7y9GVImPNtN/rxqMFk8E0/jvZKo9bxX7s49FugRvpZFHr1/9rK93nrsPN3xlz31QVc8",
        "spsFvcdP2TzKoYY9kKgGPWR2PT7DICe9+qYXvvOTJz79nm69UscDPiq1wD1qT6s9Bd60u9M++T1vwXk8nHQzvdoFoj2zFcm9P1G4vXL6AD6y3689KsvOvTSyQ76X/FM8UnWwPWoNC76swfO9MOEfPnGrHj6S37Y9TInjvYcvGDzuJ2Y9OhgXPrDI873CJoI9KmobvgrXvLzHJAO+FenCPa159r1e5Zk9m5pIveAQlrzgVaI8hPzhPe/ICL041XG9eLpsPV9IJj7zuci83gEmPh7/m71h+V4+YDQKugSRKb7Bkk2+pjq9vTCFs7z0iRY+xAacPceHFb7bbYI7hZsYPjXEmLsdd4m9sRp3vbiNh71Ffx++SoQBvbHMz7xEF6+98xy1vbdUFr7hbhk90jnBPW4SAj4Sx0Q96+EKvg1OBT4zjwy+ysLJO8s7lL1diQG+2Xw+vXsTk70xUnc9K6zKvUadhj0pNiQ9I6ApPvShnD2LC8o9Cd+qvKxfcbzfkQI+d+SZvLKExr2/wY08BHh1vaeDCr50miy+Ukq5vePSKD6Ytt29ZLaRvU37SD6JykM+qp+IOzIekT1rPSQ+88oFPnM2j727b8k9cG8MPt4nID1IIU2+TLquveJV9b0jpJc9ZxKsu/KUYb1MSoY9GLjFvBzWnDtTUTc+DrLgvSqJpj2ll7s9kG0GPqHXNLtbzUC61nu3POiRx73eEMU9388PPv0lcLxgVJo9J8+uPQ35Jj6iEMe973ATve/g9b01qR09a56fPWpDFbtbp4Y93CwGPkLhLD3wgdk9/vzjvWk75r2uxw++aXvYPUSXub0815k8efunvXZE1j3vbzG9TgWzvXJFPD2Muf495sW3vYdP7j1eOgU9I4YnvnJyfLxWqsQ9broYvg3gdz2Bjfo9sGiPPUv9VD2atEw9jEESPuqqPj7yXA++U6eTvMGJLb215449v4nGPPfAh7zJoNO9CRyJvcq9hb2+HaU95NJfveJlSr3QXDe9yM6FPUILzj0yGfo9",
        "TcnWvRcDUrsAYgA9lKnuvS7oyzvh2Ps9VpFtvr/hlr1rUti8m/VsPcpznDxfAus9uw3evMYMED6NZcO9/dJjvQLmXb3Hxge+F50TPts4NT7R/kG6iT4wvnC9Jr4BWuw9UtIzPn4yLb66wew9EI5ivYszw70Sfqo8eAY/ucGOmb3iBds8MlL4PB08vz2sOX4+jSSKvd6eV76nOeA9c0zGPRJnXzypKD08O0bAvaaC2j3H+Yy9cracufSbgrxlZSe+m3l1PAjpZj0zKY695w0jvL8yxL0lWga+mTjZO4aW0r2h4ii+D9WlvbMt572fAZq9TdBaPTXjFz7lK0A+3ImYPbZKPL1dM2A9kHnIPbjQPDmB0e46FjKhPTwCHr79J8S9w9lbPWenIz6YpyS9y65/PQCLYrzLcg4+oxuvPR/Q3b0oyTG9M4wKvqQB+Ty3OPC9KbkBPnLyDL6fuRK+m6kpvTN2mj3z3Ra+eNvbPc/Qm7yOBRq+GR6+vb1pfL2skms91sWHvVyGDr1yeJS8l5guPnHFxj16HXS9EXcCvmmAIzx5ApW8+sqoPZyLc71Oewi9ilYYvhAZ4D3VxnM9YPMIPoFuaz0BeAi+ese+PdZvJj7McRy908iqvXalNT7KeRo8UgwZPoEHSb35VMu9S4CWPL8OCT1XHJs8qigBvqfFST2tTry9/CzPvSpBiD3yiwa9gVDWPSQ2ID5XVzs9Jr2wvVfu27x2CUW+BjzAPW9Fg72+SpS9eXwwvcgKKb5naIY9oq6+PVAEOz2gHA49fSkDvg79/j0DP9k9WSUZvCELar3hf2u9KU2mPDvv3L0vKB89HJqWvV65Ur0YqMs7C9KQPQJaAz4FPh49/PadvX0e9D3Kbai86gNoveE7FT42ZcQ9WfX8OjWDm72MpIi7smEKvjZQ0L1ya967Qd4fvkFewL0nqte8w3TmveOe2Twpodm74mQ9PXEIJz23H369oCsBPiKFq73N7ac9UMukPe813D3LNpY8kuMVvph+XLz79uS8",
        "n2P7vRPplD0mwp28SKihPYH6Ur3tUro9eiGDPZEbbL0GR5G95HGxPWqN1zzukxw+BCpCPU5TlD1F+VC+Ba1cPlzk2T0QAjM+NwqIPJ4z7r0t9oC71qewPbVdJLw8uHk9N8C6vcsWpLjiR6A8gKbWPIBAqzwtXFC+/iKhPbx/Sr2RG949iIngvdSq5D1bTBi+0CSoPO6hyL0qb2y+KfoePpwfBD6SES6+elFCvsVrJj5yGC++au75PX7uND6NHae9JdvRPOrQdD3G7BY+d6LXuioE0T0q/r29he/pvXKzJ74NAdC9fEkjPkkBxj2hy1c9kPwlPYC6EL1QHgs+XZPfvHuBdz2D/gg+2p7hvLKb072ea6S99MwSvtfE0T23AY48y53tPPUQFT1pNB4+/xo0PRwusr3rY+u9Uy9cvMg/Jjn7XM69uUcRvmRxN7yh/ie9xJQRvt5njroUugc+sc3mvQNlvD1x8i8+egCOPVNCy71Mzu09Wlu7vZ3ZTb2H39K9lp1Qu7t6GD3+8I49YtvrvX9wpT3RMTA96VMZPkZEND4El6G9m2IpvQ1PMLylxuk8P1WZPD9DXj1ZHzw9j6qavWF3Fz1z7Ra+BUO9PSGAgD0/VGQ9WAiLPZ+Vyb0nZCA+hsSlPeXkt73xssW91iDLPXRSkD1/FPy9oEzHPWGul73hmIS9uxcKPhhj/j0SzC6+8mOmvb4OAT55FRq9dTigvcUeJLzUgd+9IkBbvQ/BkTxKbLW9sik4Ptwt3TzzozU9MEXkvby1wT1/YZY9k/4Mvi62PLtkuKS91njiPWcXoj12qI290MBVPTOzRz3NZSm+Nd8VPkXhBL6pagc+jQfZvQcebj2ZM+69BCPNvdooqT39CEc+N0KtuWzuOr1CMaM9dGCIvWUY1r2qDVY+nM4RvU51tT1+nR2+xwINPsT2Cr6+9368fw1VvW/zdb2SwEM7B1tBvSqt+D0bC6Y9rQP3Ox8+6j26LDG+CWJ8PbzQtL22+6+85Yd5vUuVCjyXRBu9",
        "AagJvpgWUjwrzdQ9gxkmPRsyGb2JtJs8pdRpverxJD7xxAs+othrPs8euD10BT6+YDSDPZny2j0A80Q9DugrPcx0xT1ufd+8jruAvBRNvbxv6l09kpgiPZp4Hb7+2wY+ian1PXmdLj2lFOq9s1hWvoRNsLzyBCy9t3emvICo9j3+AtO71ISMvX6Wnj0ZOgw9rnPBPBMEYT1fpSG8XjTKvAh1+T3WKsk9Z/HWPX+DvT1MurM9lF84PfD47zvR3Aa9M8TjPKyUBL49/Ts9nxZCPH9DAj43UEu9vrHgvaRlcb4yxs69m0V9uwF8ur1hsnm6ENnFPVquDr4zIge9DiWYvdZXGb3+9Ky9eiMyPCCeyD0moQe+Xt6YPXD6LrtPb6884SwwO/JTOz5JDbm9ZCwtvWsAOL3LUM89+SA0PX+2FzxvECg+v+kYPdxNxDlw5QU9iVjrvbC7Dr5qk949hgNPPV03yrxRJ4U9ABVrvJzgqj1C5AG+Vo+zPc3Ygz0WuiA+Zlntva4hAT5iPsM9FqvEPNQ3LbxuwxA+0KwCvmWBpDyH63Y9O9K5O3BA8b1mzAQ+1ZFHvHNJyDuhRue9qboCvknwBb4MamG8Yl/LPMDZhD3454K9TIACPqX08D2UTq28N58HPUf+u7yGEVM9xjN4PWEr7b3xVBc+oyRPvogOGr75etS9PO8fPhuzwL0hrde97ySEvVmlzTwUz1K+DWfDvMtXJbzLnP28teGZvWX0Kr0nplO9Z4GLPf+Yjzvo6lg9xbAmvbjxv7yZO5o9tYYivRzuHT4dJlI9o1IiPdz5c734b0A88Xyjvco6LL7iInS9gs6UvGQZ+L0jDo49seRdviknlj33wNU99XyzPSmlDj72hMu9jUO6PFXw8T0s2Ja94rQPvQS0q726Rqq78GU+Pr/Hjjy9ocI93HxAPTOSc70WRr69uTfxPXoRED5ATT09g16zPdPruj2wlBq9RoA3PoJ0pj3q2bu9btqJPAqzB71sB9u9A09PPbfQNr6dBvu9",
        "ffYOPk8x+7rwqSo9cM5rPXl5yL0yS+o9kMEAPOYbW70PkII8sS7jPWVGw70beoS95rmlvUkEYr4D7v69PnMVvnR6zb11UJY9/P3PPSgrZjv+s0S+gG0VPinSGz7YC8q99Kpuvab2CD6jkjk9xeUUviwNAj5Pqvm87C3HvV20y73iITG+Uh1rvZCXkr3euIu92EGrPW/jBD2bXyU8eqkBPh+DAj5Rq1M7PnnbvSDnGb10sam9y+Ecvg40Hz258JM9x/z0Pbz6yb1AQ0Y9SskQvoX2v72UPgs+GDUPvmcrNj2w4o09VGgwvtU13TsI+Mi9m9HEPTUqIj3Bbdi9/KwBPvvc8L2oLg+9aXVXvDZnCr5VFz09ICcNvjpchD2Ipm+7OaUNPpM16r2ZKYm9O0sdPdxyKb4j/4c9MWhouiAW4z0WGxS+4AafPVYEv70ZNrC9UozGPJeHzz361g29jQZTvYQxDL5x6Fa+AEmLO1JEx73U5A2+NbySPWWfeL1LfBU9xHoZPvZg+b34BjS9JT/ePH8Dkz0VueK9CqD4PBAv9rzghPU9LUDAvUx52j1SM5G9djojPqzFkz1LYxc+BScoOvjloL3QGRk+ZlWoPcWoXj1XjgO+j0IZPSzQtD1upG88gzInPVesJD7t0pk9Tas1vrGVvL31cVQ9ywJfvTp5HD51PRQ+o0+QPR9niTxs0p89LpEvPSNssz3rQDC+2nN9vY7qLz5FSXu93+vUOy67yT0DYfm9x1BNvvYp3729Eww+1fkKvpcvmz11jsW9Vjc1PM4FBD78qvO8JOU+u6rQzj0loKs9b8XHPYaDwL0dVqa9rgWJPQHLhD0DyTu80U0KPtuIzz2tBbO94cq+vMjzh7zNIvA6gFMYPg1FUr36qDc+aF8oPrqkaD28fMA91MHkPf9JSL1Mow4+iNy4vMf9Xb1MRLQ9qGvCvTS7W7xKl+m9d3rzOwHISL2skAS+MiiQPcLPKj1hcdE9iLCUPSLwDj69xJI90RsWvTCIFz7iQHQ9",
        "zy5hvSsy3r14SIY8sxrqPK8EBz0snJ4945UGvqX5/L3gyJw9C5CnPQSqyT325OK9xx8CvZtlQT19OC6+sfMCPsq2rLqW2Ci+S1AEPrE26L24gau9hD/jPRbXd708UsE9rxRqPT4lg718HY69enLgPZXdk7vmcUg90/xVvC1+Dj2LtS68atJlvVk/6TwLUy6+Pul+PYaD3D2Fa6A9HutsPUE8BT4Mk2g9a05LPo0cBr62oBY84SYMPf/ePT4/Log8Y3MTvARoT77KjQO+8xcMPY93Mz22FOi9lLscvhb0hb04yyA+bDATvjF00zso1Am+byAUvsgqKr48nA29HUPKPKStFT6Gn5s9UsmYPYCU7j3jzgQ9iK6svX1wt70Etp48p2QmvveP/7zFkWU9w+ISviEfFzvOdu2956KpvdOs4zwvP7m9gAyuvTRb1z1ReS6+AtEEvXTAIL5xZTQ9AloKvRZUfD0gXfO9p3zJPO4mI75gZcI8LO26vMJ9vD3odnk9clcVvZsS6j17/QI+DGuEO41QA77sfdG93Kz4vMIniT3WaBm9acoLPWU3Ar1X40q8cjDTvQXe+j3fPZg8mLtIvYSmor03pT2+gaoDPgwrBb7s9iY8w6eBPfWT2Lxon3M9goaFvIkedL22uOE8spQUPQYKLD5q5Zi8w2ouPt6r+L2/bA8+Fc3bPebHWb3/LtG9z9mJPWL7tb26ZVI+eUoLvECCAr4ZtNg9IIEhPeyZm7xBjuQ9j0BuvUIfFb7N/J28XbmoPQ5msD1J1vS9KRErPdx5+T1an+g95bQjPRdFmz16rAS+gmjOO/6crD1ZOKU9RGoiO5Kz6zxkNFo9KL4rvlA9170Hd7g8/3/FvZQQi70yyNK9MZ8wPQAaRT5MS6c9W/vXPLpKo7ypfLs9uFunvbwArT1F7Mc7FrPcPFl9wjx8iPS9x2wVvBces7sRIu28cHMcPlkEPT6A0gW+ZXCyPV43Wz1DCpc9Ipn2PQMZG77DyCK8PVQ/vu62+bzeSry8",
        "su0gPu4j0r1N0l6+DbRJPe9Wbj1kIAi9HAcDPtW/Rb1vquu90PWwvT0WrT1JrI49qxE2PtOBCb4O/fq9qsQ8vsqUzbxZQV6+T7dzPa1xuzzbj8M9MzTcvbYFlL2hemo9vjiOPQeRHD5AWs29PZ7jvb8ulr3Tu0C+Ngq0u6q1mT0ctc68be/lPZAL071Nfva84rlGvT0CH76cciO8IO0hvmiZP7w4be67FCAUPp56Gb65xwU+gSZjvlCu+70aqDM9vy7wvVKn4r3P7mI93mFKPb/GMT2QcQS+1GeUvaFp0D0D8AA9hKY7PdkARzyi9to9OGUqPX3iIL03zC0+yfL2vRNZNz6OeZE9+XhcvdBmjr1VDtc76qzsPYsjlr02Mq09jXiAPZ3tK76tr5498DWxPYIVUL29thq+wpr+PUzV8DyNAOK9KesWPtPHhb2wc9G9YWQXvmEqA74fgOw9ULi9PLNttT3jOsA9S2kHPkf+oD0zATI+8g7lvM9c3T15QS6+q1/qvCOfvLpazpU94bVCPYo9Bj6UERO+zu4FPoKO0LzShLi9aecZvpGZTbzcquW9tGFlPQs52b3jEYS8RZ/WPXBf0L0PC1W7V1E4vkIBu72mbFq+e92aPcKXaLpcbXg96R8YPqvRrj3Jkk089LQLPfbafjxfkXs7CitQPqI32D37PQE+S41XvqJP5TuSUwM+gErBvc/KLz5hcTG97mrevZmgabyi9Aa+NI1kvXw0573YfUu+kT4gvt2bBz2jOLM87w4OvromJbyLwem94ugePZ9Ebj1M9xU+hYXHPSjVp71CBQ69PDR5PDD9FD4wIQO+vwxpPW+HmT0Hrvg9zrxUPRjOXT20pwy+1BTSPXv1Ob635MW8tXmXPdQzBL5b3QM+vqtLPYUzBb4tO4u9HSrZPS2axT0iIii+kPv2PcJM3bzUr6c9WqmFO1kP5j2u0bq9wL00vWE1wL34Rc+9V9NKPR6A+jyMA8+99asEvr+4O76n0K47wVyMvYVO3z0zyQ4+",
        "xw0Lvse/kT0T6e+9PZIJvrjueb2ZnWU9JSn9PYUIW73Qmzq+ZeIhPt/amLsaEDK+57uAPSB5HD6jf+S98hmDvffj3j2nmFM+mM7rPd/O772PieW9flQJPqYJyz1rdiK+UJGhvR8lyTyBwv89CeXtPEcQ0z2HodM9X53NPeXUYz2cjpS9c7KpvL8boz13q1s9kSvfPeld8rxCW544gbgDPWHUkj341I099avrPFi3Ib4tTC++VvYJPf1TIr0xFSG97QxNvf81Yb3nyZk9aKWYPYlevL0A4ga+0REfvtFgC73OtYg96GNsPEqJj71hhhe+GHC9PGcGUTzqyM+981KCvfiADj4Pnka+iybTOoILpTxpjho9YBVCPaugIT2E67i8rur7PVodibu7Xey7PxJJvUPQ/L0t70m+k7ewPS2Rnbyj5Dw+f9AHvmfXFT4Mxki8DOO5u1BHvj2S1Ji84zYmvgLvIz78tVq9UokUPnY6Bj4xifm9WwMaPUVcFz6mM8y9SryFPHNQOb2xXCs+f1jdvZ8x4r27BfC9nkdevUEE1rw7JUC9PUmEPUjbazysy8+9DqHSPduSHz41dqa969nBvQMFMD5wcaW9IyG5vIExSryH6s089CwPPQL1cT3/OPE9XZAkvdqXBr6YzCK+/3yyPUBp3zx/E3497ZbDvR/i6z3oRE680WvSvWab6DmMwNW9exEdPgcRnL27S1i9Wzy9PfV/ZD7ElM69gDr1POfo0L2MiAy+xsmovXsr5T2FM7k9ffKgPQYMAD6FQRy+mnavvXY0JT7Fl3690J0CPvWgAj1avKY8mXA5PjwZGjwOA8E95mQTPcx9TLs3QIW9qjGkPZX9hj3PCCQ+mpCiPF63tT0jOCE+l2j+vDehEr7VidK8RWm0vGjbNb6Z3Km8McntPCq7wD3sN2g9qo5IPijgk73q8yo+qxZFvQlA2DzR42C9fS5DvgEtuT2PNB294XbcvD6hDr458vk92fy+u1kqhLx59N89WpUXvn9oor0SDXE7",
        "nav7PRHXAz6AHPU8UHEqPIoOlj0j5pm9SOL4vPbjab0xCHK8JPHIvdKo972IqHI9AXqmvQro67xIkwg+7UQ9vC9/vr00/IG9kBSFPYDSur3W+3E9fRYYPgqyHzyPsc89GAi3va/nrb0rYDq+SQNLvUkR8b25zKU6v2SjPVL/0b1TIge+X88qvha5krxqBh8+Tl16PXNrCL4o0gI9n1UMvl8Qbb3hefY9H4N+PSfvoz0RYCG+Yp7pPQ8tUr1vvUA+ZS6cvcZaI7zCJog7vGEKvlShEr4GOg4+afMEvvBZAb4HRn09RoIxvi6KVL7Sab287DLMPU1f3D1sLOS9ZpuFvbpmEr2j5j88s6qKPSlMqbwYiBy8qQ7APb14JL5x/gy+0DeyvLttCby20ZQ9JhgoPgW/VT12PpK8KK9EvEEbkjyVQo29+DsZvdCt1T0OH1o8OOUFvdw9gL0jFDS+NN1QvNm2QT1KC0++4A3hPajCoD0yxs09VLbzPUmA970Qd7C9JgCevaeeED3DoDm+9zKavW0Ivrz8OT69OL1YPdFvtzyDJXi90z4Bvpy1Sj7rWBK9HX9bvCxPz70rscC95htcvq5CbL0XJOu6jWkiPneJ0zwPNgG+N4oZvptSDD1IysY9d1gjPi1DBb6Fzgu+5LGzvc9FET2dklU8pOTJPa6ROz2Q8ds7z7QJPu1bMj2kh6u9YtIWPbQfpj0OnkS9AAoPPspS1TstSf89hiY+vb1cBr6XP+q95DbOuZ++kb1Ou6S9oX5Hvh60Dj5tjzO+AH5cPebndL3GlKy9RKkuvTXAQj0a9d29u1muvIfj6z2HfPq9cLjOPUYfuDsB3tE9hicVvmuzFr5UAxG9es8OPBON7r1+YCU+7VkivQEajDzFk+e9gwxwvUM/nL1in1Y98pzUPddZm7xvRwI91M1kvcXEQj1Xncw9b0kAvsoUAr4sz5Q9xpohPRO61j1QuN89ovZLvTD+XDz00cK9CNe8PfFkET2kLT2+qS+JPbhohT2Y5y8+",
