{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              19,
              19,
              3
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_1",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_2"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_1",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_3",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_4"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_2",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_2"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_5",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_5"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_6"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_3",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_3"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_7",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_7"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_8",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_8"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_4",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_4"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_4"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 256,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_5"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 361,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        }
      ],
      "name": "policy",
      "output_layers": [
        [
          "dense_2",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      19,
      19,
      3
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            19,
            19,
            3
          ],
          "values": [
            "fB0iPuSE7b92PHk+kbEGPkLbbD+mNza+nc+gP6Z3673EDNK/wUOqPrXoHkBo9Yi/FfC9P+LVar9Lrq++Ej2Fv6FPLT9b1WM+fCOOv0ac+r6k3LY+bsMlP+VZqD+6WrS+yx0sP15chr9hXUU9Eh7Svn9v3D87mxI+YbJVv2geAT/bT9I+59S/v7LkJD4pSTG/5/JMPwwtn7+xY4o+zFiCvxlpij6UdKg/+f7xv8QPNz//PyG/pGu8PvIdTz7OrQFA9Fq6PlKmjr7H2e6+jHznv1NZRL/96UE+5keEPhMghj+zBnK+Z9e5vhPbG7+B0po/n0jIPwS6ZD9iuvK+xgb4P8kfhT9wHvG/7ziHv7/y3TwpjZY+kmugv/GVkz5IlOa/5Cm1Py5VLz+BeBy+niWhPq0B/z7OeI4+nWkZP0jHgj6ZMBO/X7/lvosT4D/FvKK/nHeJP/EnL77po40+PMmyP516sr628Ac/QHZSP/aTq77hDXw+GUNPP1vN376frQS+Kq3FvjAL6T73110+wcU0Pvn/Gj/UMOq+SsyVP6kDyb50yxS+HNTgvmWDIEAFwF2/J2DjP5xixr8c+zK9JVwuP3aR4L6mpyI/onnZPyCv4D63vYs/Zxarvlrv0r1IqY++qaQWPw8/g7/bQSe/ULgePlfdtr9oZFO/ozDsvh0+Rz92mfs/lurTPqwLgb6cvRo+JJSRv6fU1D4QZaY/cCfgvnTORD8765A+KphFP6+aoL4ZMJE+pO6+vkKnh75X1jU9LFJWv7aTbj+Ylxw/EtgFPq5ilL1dQLO/Nzu6vrf9zz1WnS0/11WXP85/Kz4CqMO91chEv8yNLj44FeU9R11OPwNlYD+Nu4k+oi2avxIHDr+XzI6+UfQcv1gBJz+6wlw+0lHaPz4llj8b666/bQ4ev5LYEb+kWOi+zM8FwP4yD76wj26/0gRhP3HNCD/4e8Y/JPmoPFZegr5MBMQ/TXaBvpzhdr7jYBY/pn5/PmnApj/zdGS/uOggPmWIHL9GX7k+",
            "UK0aPq8RjL5CwXi+OabDv0JVQL72uaS9fSVBPulfEsDxzea+4RBBvmVYDj/pQWo9v8+iP2acDj29MIy/mUnsvsfn2z9jtx9AXL7gv/TFvT3I9Fy/nPJXvxMJPr/1Cp+/wf6EvwWOxD4B5t49Ytj9v7X0mr9soca+QkOKv8pGyr/Vanc/vT0IwB5zAEDwfU0/3IEZvtiItL+BFz++EcR9Py1rqj7v2xa/DSH7Purrnj/jPQfANffaPiyec78UdcQ+lpC/vhbm3z4ktNK+2xd8v2IgvT/jSA3AIuuhvpcJlj6v9uy+gjVwvmHiab/d4x+/71c/v7LTSb4kmyC+cpqcvy85Er8FzII//HlNPtn83j/fJMq+/4w/PYvJWr17d26+i7fsPkyutb974Ki//Oj0Ptf6LL/aos4/kO+gv987nj/W5MY+8IeVPk2Qfz4ZdC8/OWp9Pxcvkz7KB4m+ZB4mvnfykzzGXyi/6BDov899jz7TzjW9ipc8vfiMWL4QOR+/NgcZwD5hCz9OvHY/TrebPqXojj3ZdSO+TTAQPyfF0T9WwU6/i39bPyECTD8SNf2+AxE4v+2u2L6Hpo6+iImnP1bxVj4TaIC/s9SRPm309T5lpZ8/2IKkPZy89r/Sgwa/LiOfviLf6T7Fi68/vRywvi8k+76RCzE/erR/Pt/uyL/bslO/BHZkPrue7T+aAmC/Rj/oP3Msjj8dHGO/9wSTP9liRb/DVmw/JPn6PpyyvT8Wh2i+W6prP0Aulb/t0X6/AtvIv6YXED8nuAHAqQ8dP44XgL8hgM6+BGxsvaPAOL/AZK2/UQAfPpFXJD/yyQA/5905P7TdlD8d/ki/iQgAvii7hz+ofXm+ONx1PoSGBz/CMQ4/sIqsPiCS0D6mntm+huf8Ppq+qr9qZOC/Xnvzv9NZSzve0is/EyC9v1LtMT8ovGK/ypNdv7kQ3j/HTb0+3tcrPww5oL9htd+/tYzTvs72D0BG0ra8NKxWP9QB1j+PnLQ+ciUTP2r1AUBu2vi+",
            "QwXvPgGRmb9GzXA92AUVQCLR2T8kmwLAyZjuv+m4Ur9pLbI/akaHv1Bfkz8i0HU/ytKZP3jaS758Go2/DiByvo1SPT8kSEY/u1YqP5kR776HM9Q+nVhov6Elpr81BLK+QtZ5v926w7870AHAZXePPhxCc79fmVW+St2rP7PmKL9vVZ8+q2+RP/7qxj/vVx7A/+8jv2BoMj1Etjw+mgp1PykODD1gJWu+b+yvv8AnUj/M4co918p4Ps+cgr/pOqA+GcJHvnRsor/zegDA2Ld9v3uSpD/w5Mo+X6e4Pzhgrz8SmIS/FORCv89qC74zGHm+TCSEP1DpZb84vWW/0bV2P1dlo7/K4hE+LxBEv/DAM7/Z3is+d/L8PSEkn7+PSE2+0E58vdH0sb/ORyXAMiy7vs8D8b7rlyY/QxIXPwmCZz9MoLc/hNrPPvh5N78rwt2/7DZRv+H/m78Ulac+MVXSvy1iCz8XDEG/eFz+vn37OD+Zj0G/dZeEv8iEMT8MSk0/QS5mP4D3wT7V9dm/DZybP697rb9yq5Y+JIcxP174pb6ie2U/AFT4PgAdVjwQoWu/2q1qvXco4z1Z2cW/kRqJP4w7Kj6CIg8/WveGv9aj4D4xw3u/tDIuv8sPxT74Pyc/Qsv7PmabnD7BEw0/9WRMv14vDr+k1i6+LTk7P3f5lL/ZHYU/qAe4PsGBhD+WnOQ+XAHLPnl7179Disq9Om9wP3+T/T0Eufs+C7VoPgUDCL9ebFS/L2eiv3tCvb7m1j295xuUPyInVb/gv8I/erbJvr6s7z6sPbK+eSbCv8Evj7+TsWe8UzCuPyqhbL9PuJK/ozP5PrRmqT42/XY9Emyjv/g2xD7aH3g9aJmavWhzG79IVN8+eI5Vv+wmuT+NvYe/qKaMvzm4eb+A6aS+lvwxPryhyD4Uzog/XhssQKFB8D2yogm9F5hivseIOr+fhQm/dFWSv0Jg2z8po5g/LhYSQBJ6rT97VqW/AJ7jvsb07D7GsPM+jA3bvT89iD31y34+",
            "jD9uPykVrj4F+vQ92AcwP4vTvj5k0glAMADAP6+uij9T1wdA+Gguv3QAVT+3MwW+UYa6PrOwn74AbIA/Y37/Py7dur9g2Wi/V96Hv/gwbr/Xfdc/00P/P+AEj79t/wA/lDPGv7Yk/78ZpDK/p8Okvylfyb8LZK6/22CMP/K/Vb/aPYA9Sf5APvGGK7+R/0c/BxkEP55u7b1PyhS/DQTDPjwbGD/VXq8/0I1qvpgfQj+IdTW/r3iZvpsd4jy5YuC+LwZTv0Vqqj4gPe8/1Y4oP6X9Wj/gCok+IEEMQP9w/b1i6/c/kSHtP/eGij6j3oa/xGphP3/6ej2RD4S+mRysP6pZpj8VJAPAZWurvrMQT74Ys3M/QPaOPnPoYz4aAGo/ne0SPw5bgD/FYcs+08OCPwGOz79hiHu+/rmUP/OLcr+Y4iO/Pel3v3sxOL7dQre/kHhtv7ZlzD4CSJI/QrW1uxLOTj+ozqK/PyivPn5Zuz4gLuS/U+jpvqfWEb40NKQ9um8Kv/RDFz+WpBG+cQeLPyMEY76rFKE/jnMKQD2Ccz9HKF8/OKEHvmCBcD/mDLS/MbKJP/xJ7b9IY6Y/ESDHPr001T8Q17w+liIIvB+Fhb/Z6rI+6r9CPx9+Mj9u9qg/7XSSP3CXJb9ivoe9xpNmv5uLjz6Bw1y+/Iawvif7QD7UH40/jkVbP5viWb8be/q+I9/eP5VdVz9LwpK/SvqNvoL8mT7uWmi/82/svi9Lqj8RZjRAtq0zP4tlMD4or32/usJLP813try/gLQ/Fz+wvkzulT+1FdC/p1iNP1NoaL+ELGi/zyOUPjDAQz/rRMA/fyXyvnqbYz4JHAvAt3rXv7hNHL/d5wFAgVi/v1CYr736Dpe/yjL/u1uHhj9qGS4/WBzNvknRwTuWWeq/3FI9Pmrfoz7sK0O/M6WKPiOJUj/sPx+8WZSWv1LHFr/P9eu+DIqTvyaCKTx3BIs/UzYIvjWXSj7s0vS+BW/LvwLNmr9BUCPA59pMPraQrL4PjK4/",
            "/YmIvbSnl74og6g/PaWovwwx575IszQ+uN3EP7VcEL3qVPC+2qvGvmgl5j6J2lm/Ngutv1dRBD9zxd4+dkOpPe+s/7391AHA2NCivwpCcT496jg/mYxvv97kL79HUlU/J5SNPoLYMT+/NG8/vb3OPnRSCz4eE4o+z7O/PaD1m7+6lnI/KrgcPi3CCj+6bY4+l18tvmiE3j2t2nw/1R+avzie3L5DbcK/uRWEvt015j4x8vE/QQjsP77cIj4rZLY+5k2XPaG3GD/rAJY+sJykP1On+T7Tznu/s9pKPlGTnb7KZnc/YhOMPi1aZ77lhdK/Fj3sPn7Q27/CmYo/r42gvRxIsD8mFaE/p9NbPwDtUz+MDBC/P1oSvy07h7/5aU2/DJ11PtR4RL9Y6AS+EUBZPx+Y+L3L/hK//eg0v9sDsD8qkDq/zVA5P1xJHr4IKaq+oOWMvzfcbjxG8wK+lAkOv+2PWj/gdKQ/1EWKP4guyb3+2lHAauLgP2WOczx5jUk+cgNzv4xA3L9qE6s+4i6Ev8ugW70MAgrA20OpPte3uD+RAz6/wb5Yvpj5QL/R9Mm+28DaPluVnjwIzwm/YBp9v0EB77/x/YS/0QgMwIDyhb+jNek+c6jtv8sc0r7dNYs+4hPLP4+qhz/7yIm/gboMP2aNIT1zJsK+oBEWP7Zzvb1UggA+Oy+hv+QicT9g1am/9Y3gPMeECz/VtLG+meQnv6Fsxr66zlo/3ESoP4rknb8G/u6/aBpfPll0hr8GG14/voULP14zqz9BbwE/KpB4PyX54b7lQhi/48k5vwifQT9DTFG/BdOVv9p9oT7S5mQ/v7R0vzrmI74rfPG9wd6kvrHIBb/zFki+mgeqP42Gib5ya4s/iJ65PhtdLL6IL4i/Eg2CP2hhgz8XqR++hEICP8T2pL3fuW4/6WXvv3rqaj/vH/Y/TSMnP4RRB7/JTt6/Ny8kv5FvwT7LYgC/c0D3P2/nwL5zVOa/Id/KPvsc3b8nMeC+RsmzPnxi9b/AEFK/",
            "XrhQvsf9sL8Ogxg/cSgKwM80Ob9OcWS+xmW/vn3vxz+kt2q/4nYPP/W+q7slWIa9y3sIvw8MEb6GI4c/OFsDP+3wub6GWxg/Y9PgPu/aoj/HeE0/HI0cvurBmz4zELY/iDUHvoWtET9rNSw+uxeZv7l6lj/isQbAx2+JPqPQij+dow7A1uuUPKZ+Rj9AX16/TrZivneL8r/jdnQ+tQWTPwLDnb/YFaM+fe0wwPgdHj8ZKrc/kNvrPz/dhz/+jWg/plqvPrchtD+H7G2/YxyHvReGFEBol8o9PW1XvVi/6b7ujgU/a4VcP9MxXb6edIk/Lax5PzJgFb9dNSM/LmZLPzgsqj9xPZa/tBWMP2+8dL9HZNE/KCopPloN4T4Xdre+/b4NvIgALr+mkGo/woIrPxIAKr/wsE++Gq6zv8HgRj/TcAq/MS+dv2rS+L/VWje/v4fOPnOrrb4JmwO+OdIVPzwQ8L0gFqa+/GKtP5qCob/uhqK+l+cmvjvzJb9+tBe9PfUAv/IF8D6vdH0/ogjJP9E5wD0LYSi/A3tYPsHdeD+Esuy/c18IwMy77D45aqG/lXSMP3jk7T7MtII/Y7cJwOlDHz9Sqs+9hEIqv+iQpr9yLrK9V9UqP0AcEr9F/YI+3c6bvsO4hD30WWk+"
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            361
          ],
          "values": [
            "AAAAAAAAAAAAAAAAAAAAABCPEA1ZdpkKAAAAAIKL8gUAAAAAWPIaDnmSmioAAAAAnuXTAAAAAAAAAAAAAAAAACOHNgoAAAAAAAAAAOZWjgcAAAAAAAAAAA01EiZPJ7QKm+AGFYU2RQ4FOCAH0qGVI9wZ+CaiyV8QRI0gICosdw3f9fgQoJvbCPLciQWZaUMZmcEsBCD/lAQAAAAAwzpUBwAAAADH7sEEt2pNJ69tnw8EbE0FLWZTIDUfVxHSbdkoEPlmHnpMAhd/CBIhldtMKQIA4hnrDrY0+4TBGxvGwg4MKhkKAAAAAAAAAAAZABMTzh0CF/equw/5TBIggUrNIvi1ihlA7cgadsYHInQjIC0b204jhjt9H+oJXy3gSXw/iE5qEYQqgCzw+IsThMhQBAAAAAAAAAAANlqHDY14YgppK7ooLdQbG+fbpycox3kooEMzH3uG5Su7H5ox0VUrL5tTSSUIVHEqnd/dIn7OpCzxI3gX58qgBd2qQyAAAAAA3ThDEwAAAAA9SG8OgSx0Er7x1BpNyhURinw6GGWSmCjS9G4dsz/jL8H+5DrD+oUxpTXQLJ8GESPdz18saoCjMDyNThi5OCIhAAAAAFZU6AAwQ3AJyqWjGAReIA7Be4QgCHJyJZgamyf86jMgXxi6MfBhTjMG1yAsuaskHk+JgDnt4PosYgE2KL1mQyVOv+g0hN/6HQAAAAAAAAAARDS/EkzBGAlk45AdTbGDElfeJhgUkZweeJ7pOBbfry0U2ZM3KXHKMrZz/iK/NowioMoPNGqESijBhikyqgvvJkjkTBcAAAAAAAAAACYolQ+GKE8HdPGJEkgCAByL2d0aEeKOGBMeIyyeRJQ4164aLJlGrjTOIEMqrgqAOJxuSzTkURY8Y4tkH+0BCyrDoAQiAAAAAIPyLwwAAAAAMasrHllcBBs1kXYO5ReXJX2syBVBdvk2AAAAAItGjiou4NImW35nL2WTwSR+y6knYczsIt4KoihWi0okwxqBFkUMOQQAAAAA",
            "0YU5B5/WtwWyvrEItcIhGQRvmyguCSc7B1GPIAltAxcKOPYtQU49N+PUaida55Q0QspwJTa9kC38VW0i6WyGKwAAAAAAAAAAjw3nE+w1AwTR0tYL4UO2GSjsvxb2kdQeq3/gIJOStiCf2rMZiKSiJVPsASRDgOQ36W5EJKRf/xkkq2QYPEpIKD8wxCYcljMsAAAAAO2eWwwAAAAAx9EjD8iFCBLnwZIm/JYqGwhAXh8MFCEdOoFTJE5wZg66tzAdqEyMCpd78ij5STMcwm/SJLSXkSyHUH4u+UoeCgAAAAAgEQgYUobQHrqjhCdPvQsjyZhUGP0uxSNqBpYt45dCKOKWXR30giUuFSEvJWRGpjH8GjIr0wpaMI7TzB4mQkA2GbUoLGH5AxAAAAAAxhe6BowmAwyA4wsGzuxdINu+dhQ32r8bOf8ULTOz7RtXxbIjdA3zLY4jwiYtiSUce9maLJP0/yeYvvY5D8slJeQyIRkAAAAAAAAAAAAAAAAAAAAAhFEiA/nxqxcAAAAAne7sJorzKBugre0bCbQWFWt/jxFop2UZ99Q4Kwr6hCmagsodKPXCB2v/rg8I7U4eJasuIwAAAAAAAAAAAAAAAMMNywQAAAAAAAAAAD5j1RfKVtEFuroVB04LARY8t5AUpPQ3IOKUIRQSVhsjflafE/Ce1BzrGTAFAAAAAFwsgAMAAAAA7zzPEAAAAAAAAAAAAAAAAAAAAACIXxQGzglpBYRndxjOywwC8FcVFQAAAAAyjnYMETzoGJUyrBkAAAAAAAAAANg+xx8AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAB01cERAAAAAAAAAAAAAAAAgar1CAAAAACCGlgP1Ea4Es4aog/wCmcXAAAAAAAAAAAAAAAAebQYGQ=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "batch_normalization_1": {
      "beta": [
        "BJCePK4DUz4I8ZQ+PW4fPc4pez5xdqE9tLMOPlqXojmjz4g+1W2IPdKfS77cJpg+mQGjPPUF4D7SBYw+m9HtPg=="
      ],
      "gamma": [
        "VaSdP5jocz/Tm3Q/zk1ZP0XNdj+0/WQ//t87P1CobD+a1l8/UAmBP6PlkT+gB30/1l9uP6khfj+2jn4/HVx7Pw=="
      ],
      "moving_mean": [
        "SJQqu8P/Nj2cywo+lb1pPvUsyzz3vSC+1OZGvhHqnD4moIk+Q4dIPcmsjr35GeE+0gnQvQSaTT2fs5Y+RNUzPg=="
      ],
      "moving_variance": [
        "1JK4PYzVZz1OcD89uGlNPVWPnT0kkGE94OuEPTwYnD02FII9PW5TPY/xZj0SPqI9Q7uGPUo4ij2yOHo9FDDCPQ=="
      ]
    },
    "batch_normalization_2": {
      "beta": [
        "qPD9PWwEYb2fdm89TWoVvbRfyj0gpIc922SRPZfuub3P+kA8hoNmPnXTlb0XWJw8SO+VPaVFSz1duVM+iH/yPHRSXTsiAHQ8NBIwPjyh0LvIcra9puuYPZQ5Lb6Xqpo95KF8Pd4N1T0D9kg+mUOdPQJXWz6t2AM+LFy2PF4LQz4="
      ],
      "gamma": [
        "b8hVPzqeiT9iR3U//wiRPzhphD8O1nU/zjeEP7FRkj831IU/aTxnPyvRjT8ZXYQ//lOCPxPkcD8GpHI/asluP5viij+YOn4/sZBzP5nMeT9OtIU/u8R6P8pkgj+wgoU/Kv2NP3Orbj94+IQ/ZCZ7P0TiaT/wlXI/GqyFP5Bmcz8="
      ],
      "moving_mean": [
        "icxYP8TXy77YFA2/jiQ5v/XK3r7R0tK+DEWRvuhcG7/CFN6+EPUnPmdQLr9gVPy+S7jUvrDwar4+ICc+ZFONPSLVsr5rsF+//diZP+AJOr/Wzm4+74wpvz8EE7+SdxS/WF0av6Hmtj7VPiS/aV3ivQb1TL0Odiy+DLPdvqVC874="
      ],
      "moving_variance": [
        "M5nBP//x3T8ft6U/jnL5PxS49T9toso/olfDPyaIA0Bp/8w/B+2xP4mrsz/XEMo/TxvNP70GxT98hss/jNgDQL1n5T+sYq8/uxwOQEVytD/3F8w/4mLiP8vGxj8Gb+4/BETWPzS/DEDxQsw/6jq8P/7e9T9BDbQ/W0bqP23WwD8="
      ]
    },
    "batch_normalization_3": {
      "beta": [
        "GJkQPFizI77b/u69EGThvSFnkryug5a9TpoIvjYX6L0FG2u9jaxWvZ+9vb30Awe9Sd4ivZNvGb4KSjW+pEszvT2+cL7Fy6e9eUB4vvrA6L3y21a9dnTtvCpmG770LuC9C2ovvnkk/72ivei9OWhtvmGz+70NvJW9yaETvrZod71oIxu+yuk1vkxR170VpoG+DaOqvXnT871b3pq9Gn8FvsD7qr5YxC2+yHB1vpqK/DxWmu+9ck0XvX5Ojr0u/5+9AHDPveYAw7191Uu85Adjvs1zJr58uNO9Hc4Svc3UPb5HXOO9DtatvS6VI74ehfW9e9S0u8MNOL6ietG9lvHYvA=="
      ],
      "gamma": [
        "50x9P2CHeT8YuIs/HJaFP+WTgz/noIE/NI1jP1xHiD8N75I/1UKDP5wwdz+34mw/UZd1P2B+gj/cMH8/alNkPxHNeD8LF30/VW2TP4O+cz/4lGs//J6DP+KZmD+g03U/eIGIP3b4hD/rXHI/lsVwP1oQjD/ucoM/x3KBP/7ycT+NRog/mAKCP6JVVD/+Qnc//euAPzKwgz9iOGU/qp5+PwvCmD8dNIY/DbeCP9NAbD/zXYg/G+aBP9LzbD/qQnE/g89mP5H+fD/CWIY/hemDP05+iz8D0IU/v02IPzPmdD/fyHQ/TBGCP/cHij+9U4E/jLxwP8xqlz/VcHo/nDN+Pw=="
      ],
      "moving_mean": [
        "ozosv6UUAj4fn4u+tTMOv2lxLz5h0PK+qF62O6mtg77kVCq/k9jqvTjn0r6C8Ki+PfvUvg4l2L5Gicm++aQcvldvU76OuN6+0EVEv8qyzb78CZy+IbINvw9RKr/Ry4i+iF8cv+Bayb6FHle+c9kGvupLUr+wHPW+/RJ7vhKKO76Hhgi/l1XNvvBEGD50PHO97REGvz0wZb7oIx2+jZebvpaN/r5L3iG/CLCZvvRQOjyxjga/F+YVv88ekb7Yg5O+9xMdvlL3s74pUM++Xspbvl4eX74s5+C+d3kRv5/hyb4ZtQW/j3A5v43UE7/SIcC+GTHEva4ao748M7++qawDvw=="
      ],
      "moving_variance": [
        "oEnSP8U1tz9UDwFAv7L1P3E+1D/dy9U/kaGtPw1l2z8OMPY/uNfZP7AXvT99tro/yw6rP7ge3T/4Bbk/7OTKP6FiyD8zLs0/0hjhPyjesj/GVLg/CnHuPykbFEC3yMI/C9D7P4jG7z+17sA/EsvaP2EmyT+ePsg/KX3HPzGyyj+UrtQ/7t3aP4jYtT/uJKg/mirWP2m4zz+eKck/zuqlP9eJ2z9RLsc/Gh21P1hxzD9ha/o/FBPbP9RQoz8ola8/FXmrP49k0D+PLtc/E+bLP4xTzT8cWsE/KILYP0FxvD8lzrk/+g7KPzIc6j+58Ps/ola8PzzFGUCT4Ls/bdHMPw=="
      ]
    },
    "batch_normalization_4": {
      "beta": [
        "fUTkvhU2zz1cxw4+TlKnvidIk778qZG+uhVqvqmSE75L5WS9u4devZVP0L1vz6K8TTw3vqI+wL2Paw+9b+36PF7uQL5i6Oe9OLuPvotkmr6rm7W+h+dSPYSO4r3dTnQ92Pc8PNW1q76aowS/Gb+mvsYOTr5MRv69e0zXvttOf71ttfe9I5aqvqP+jL0XRne+Ft9gvoUrOb5mcYW+CLyOvvbT4b3DZjy+SgcIvu5W772VsQi9zZ/Uvi4HVL2f2PW9EvAhvmWT9L36+J296qSavlH3Hj1PUj+9+0IGPBUXYr7RTeG8ZA2XO8Y7X74Ymme+owNjvtqAv73zxHe+I75TvQ=="
      ],
      "gamma": [
        "wdkbQHMBBUBnBgZA40IYQFVVEkCF1xZAjo0UQEAdE0CBGA1Acf0EQIRpDUCk6AdAjLYXQIrGEUBB6BJAGEUHQKw/EUAmAxFAeSsTQKjrEUB4DRZAuacMQKZfF0CLZg5AilMMQFgUFkAXIRJAdOMaQCNaDEBkUA1AYiQUQARvDUAikA5ANOwYQPsPDUAG5Q9AmDURQKq8FECr/gxA2mMVQG6vE0DGmRZAukcTQH7ZC0B0DQ1AyPUfQDGAEkCFCxJAUykWQOT5EEAUpA9AZ0kTQNdsEkBWFgxAfCwOQBWGD0BlxglAESMIQEA1E0DrMhRAIVcNQCi5DkDg5gxAyVMOQA=="
      ],
      "moving_mean": [
        "15TUvSgosb56HTK+oDfavk848b3omVW+kaVIvl0C776+6Yq+D7dnvoTSNb4GbtG+FSrtO/uT1b4YtKe+n9Vhvo9hub7579695KrBPUfjf7yVd5a+TD5evlea0b5fut6+NsJkvsyrVL6JTky+C5kIvisN8zxbFom+k70vvnqLrb4kuc69mJlYvkQwx74zxdq+usG2vRCGt71X+Le+1ESivhZ5Xr4bTPG+U6n+vXboD77Mf6++p4aYvvNnyb5nYMq+i8wJvtEAlr6T5Sa+1KrHvqjhxr3jPDG+1PjYvsxQR76E2OC+qrG6vv9rhr7lECi+nLXGvs8AlL5iFYe+T6z2vg=="
      ],
      "moving_variance": [
        "rQx3P0MuQj/FXTw/RGRTP7gbRT8gGl8/XjZiP2PRUj90Yzo/h+VIP4BOQz+j2U8/3x9cP0J6Tz9AcEw/PIJBPzH4Qz8Z8zk/kahVP/MJVD/u3js/boJIP3wzTz+xEkc/JitHP9XSTz+7MUo/2o5YP0VQRD9K3Ek/WUdSP/kpWj/3X3E/zdpmP0DMPT+MR1E/T5NfP8VSVj+W2zk/thI/P9flVT/HWl0/zwU9P73aWj/cI0w/vRlnP/QgVz8HvVk/nU1iP6JcQz+AW0w/9eNOP4MNUj8NYUw/XQU6P7wvTT/izD8/8n8tP0OTZT/xFjs/7FtFP0g1UD8Hx0U/a5s7Pw=="
      ]
    },
    "conv2d_1": {
      "bias": [
        "cMrIPd+DWT15xkK9NHdyvcgqzT26gw29x2FKPnOsZ71zqPq8fH4/PbHFF71oub098anFPYO60b2i89E9A5SLOg=="
      ],
      "weights": [
        "UVbhvUhVTD0ATjO9m8TbvTxsOb2funW+hxVxPcIKWb62cGQ9AbgzPONkTT6wtdq+RhcXPqQ/Bz5CnnS+/UPePNl4Wz5uDUG97PEpPWAsS755fwm+U3kRvjX44T0bQ36+WIqGPYt/Cz7ek1y+u/N4PY5xnj1Zby++KA6YvYDhCT5yszA9N2aFPTRIZD1ME/+746A9PVsPib5V3Ke9HSNLPUBSk77zwtQ8D4cIvv6+0L3nmii+1k7IPebbvT2gGQs7cXv4Pa8XgL0R3MU9yJrbvDrZ2D1nwik+5jtQPeoe2j2+ate9+5cSPHy/zj0ngoq+gwdgPX2QoruvB0m+S+8cvTzbgj5ewb69ER1dvQzTMD5yCNy+iJ42vG0P4z0V84c99ND7vQF/dT67xOY7avSOvXspQz4eyXu+jyoCPjHCvj5he9Q9I03zO1YjWD5RW0y8UgazvX16vT7Axsu9WTJdvfrVg7zDcYy9URr+PA2A6zxZyRS+aiU/PrJm4bxJhp8+Ax5hvWd3ij6ajEK+p487PgE/7D3oIvw9Ah8QvnAowD0vXJS+tFpGvYdHVD1anv+9sEcQPpDEDD5YTa283ZYovh99C77Ho2I++B0Cvkjxlz0yp5k9l5S9vaB05T1F0xm9BiUoPezO1D55zE6+aDopPXHfTL5BwpC+koT5PaflTT30BhW9UhRsPfWxPz4OGD6+ttCFPaHcP73J8CO+iyZhPVQB2r0sv6c9GeGVva5mmr52rlq93XzTPXa0rb1Coq09K94XvjgyJr4QcBm9mAcCvKW7orxxWJ8+DUwKvohYkb78BY8+03W3PZadAT7m9x4+i2GoPUVB071Gf2C+tUa2vNBr3D1OrBK9tKrovTL18LwnK08+ZWKaPRY4j76G8TW96kEUPctLlzyiy9c9DWLEPb8gOL0Pa/k8mNmcPeFMc778dnM+YIp8vWZlhTxfbvc9OkZmvbkTdb6AuM49Omc0PZynkD5Qaa4+5VC6vYrf6jwIgYo9KZWmvY2T7r21jFQ+",
        "ESonvcldQr2at6k+IyCNvahKsr2YDCu9Lo3IPT58RD5zwFG9/xQ6PdLZWr7Hf5u8CjdQPT0aa75IVzW+MXCEPVzcDD4ovZo925jvPLxsV77nSxY9Yt20veK1Gr1P3wk9f+nAvR37F76LX809K2XDvRDGxboPMga+IdETuhRYMT657WC76fxhvXk4OD6zymA+nkhbPfH4FL6DDLk9om/XPS5ISz35Gze+GW0ePkoQcb5x9008m+bzPPgGTr5GKoW+pHjTvQALAz5f+0Y+/POSOoQ+pD1cjti9rhAEPZFjQT52UVK+lbcIvtokjD0oeda9PHtRPsKRB74F8B8+0R+wPGXyCr115eM9kluRvUHggr5kyW69AGE2vkPdAb0gfXW+ACKPPYSKXb5qNr4+Ll5FvbMsJj7mHeO9bcjHPeqMNj1FJey8zjdBPJd8vD3LdQS+J/IWvqOmPz7/3RQ+TsoHvk4UTb7v9oI+yNoOPqeB0r629+C+SOGbPUD4M70RERS9J4g+vdiNML37lm0+Khb0vHpk3D0apu69iDwOPOUF4LwPkN+9GW8APjlqN74CgLq8axaDPXfhxDz3jYG+raqSO4nj4b0crAI+fjiWvactBj1YE9G8nWzWPYIqsT7Rae+7l/SdvQjVXr7g7N++Frp3PcNHNr5Zid88wodIvVAVTj59lpi94/jTvUSLVD3/nTo+c0yzvTNVJr4EPIE+m0SXvVUKJLw8/Go+EsQVPX/BYr4SdEo+9o8LPlvmij0suKC9ojDuvMjwRb7Sixe+aXa6PFGa6D1CaPW9Ald1vWCIUj00GxO+9hajPMmF0D2cgYO91s46vcDMAD50GqA+hD96vO5vo7yDcH2+CtHSPdokN75Z2EE+J7atvTWuRD7VfTG9FmU1vYFlqj6twtu+yux3vQKHVL43naS9CGeevCtEiD2+AIC+yI7gPdvpoD3r7oG+OaonvVK4nD7v1KC8RUUHvS7nB73PCqE8e0fNPM2Mxj1fxyy9yyt7vKX/or5CO3++",
        "WJOkPc0P/bwrPqG8yPbVvRsO3bu4KJW8Yunpu9BFdr0bokM+t/6kPTr1nD4tWHO+9qTsvUP3jD6nsyY99rjxvag2YL4ufxc9ZRQRPrSoXj240JW9lP0oPQMRkz2Q6IG+prYfvkwYFz1yrNQ7D1u9vSAGer52Jd+8ClJnPYC+3z3pGxo8VeXhPS2xiL7zXrE+TUcYPpBBOr6SCz09Ahc+PfrhGT0BWQe8cDknvi8aQD4woRK+DpraPHnRkr1uEPo9"
      ]
    },
    "conv2d_2": {
      "bias": [
        "YnACPoeBvj1gaJO9ZHEIPcKdubyjU6y8U4fAPByDArvz22E93jgbPkHvGb0Nvpw9AznOOzcao70u+Uo8QH8HPQ=="
      ],
      "weights": [
        "sPZRPkDqAL29c+o9EphyPbuhoDwFRJQ+yKsUvUtfFD4279m8CH5KviOxur2yb4Q9pimyPeDeCT6wSIi+i1eYvFfAMLwJugm+dTGrvdCxGb6fqpM7U+NZPqiePrz6l7E9ta/AvQ4oNb54yUE9n12RPf+MHz1+pXI8JBnuPZwUNz0CxKw9qsi1vRgFYTwt1ZU8wCEVPeTq4Dy4kwy+UbB6PN7es73VC0u9p0ZDvd9iUD1HzVc+MOTsPRLrwz0wzC68es8QPhoWU70phMo9qyPQPd5vML00U2y+9KmJvRjUFT3OMIi89dr2PPflOj5R8LA+1KPnPdnM2b0S5io90NPbPLt7Xj7UmGy9136wPCr9Fj4f6o49YTq9vSOrg72HfR6+B4GZPV0jTr5V+ZY8VijMPWAFir0ckX8+IVjFvRRUhT0UyTQ+rf0EvEaIFz5K8xg+5LqBPUcZmr1vjAq9VgiIuu8nmzk3cFu9npX6PGyoMT1j8KS8sJKLOicsEr4cToM87kaPPVHAMj1Iozs+/aQQPRBvIz4VkRS9h6OUvYTq2L1md9c9ooPWvSlSKb3jGNq71z72PTojcL1xPfG9LrShPLmsbD457KI95mw+PeHSaj4dtr+8teRgvlxVdD2V2KC9LAPpPYsphry+FwG96jpvu0cevDyukYu8dTdpPcQV57wyMlc+gK5Vvmi8Cj6WXck9/1TWPdkhOj6AryC+Z6BxvE3nwDxUI3m+cmEwvdwUxz0m9KE99bpkPqBHSL7Q4BY+Try4PWQJ1b0hGbe9gU8+vdotvj2dVhK8W66SurPNTr45QhO+rbQAvQF67z1qNxc+WeZyPeBRGr5fFw++qZf+vY7wzb0pwDa8aE0CPc6C2zwnpjM+loMzvs9h/b3J4Qs+22/LvMk9BT0HvMC91dQKvEP5kL0tQGk+t1OsPLMflD1jAji7hJKePNgZJb6iFDa+lwmDPRHPLj69MN88u+JzPOrG/r0yY/e8kNIlvY9hW76uKjk9//Mdvi79uj0C4549",
        "8V0tvgTFET7sq6E7FOjDvGohHL7Rc+I9sUTvPfMOBL7K6fI8Gc4OPrzSOD6/zC+9/qEWveXel72jZti9F2/0vC7qs72brs49yNlKvo574b36SXG9lngHPrPSez5BVSI+iMx0va5FUT5ymh0+zZlRvircr70CHGE8AMGgPXuZHD7Rk4i+LMnfO8CTC76RX5G9kBtHvvswmT4S0Iu9aHM+vZNpIb5zWys+XeGmPSseXL6VIo88+dfzPTEzwDxyA9E8owZSPWt/Abzxzo+8igF6vdhWK71d+Mo9eKnFvEm3ZjwTVyg9CB4oPhH72T0QhBk+77Iwvjo3D752zSK+avOPvWXBlL2BaM89vxquvSoPkL2FtMi9mKi0vRJPBr7Hlbc8Gzy5PDGNJb4Lvaq9ldsoPiDxkTwXhjk8IPtnPi7cxTz8TAu8VQnpPbZWFj4FLbY8J/krve+Ez7zypwG+7geXvbe377xawcE9D2aAvVIK6L2ahca9/e60vdN/gj0jQRC8a171PdgTED5VL2A++hxPvW1qbT7FOV29EQsAvQKMLz401ms9ow9FviYcLz5QbEE+LLgRPvfmLz4taC4+Tp13vpUdQ735wa69HYu/PVrxXr7sxzQ+IHslvnINTL4FN9I9nuVGvFCQ2b3G2Zq8sjLTPRlESD3ASri96Xo/vjOwY74UlHg+0ccevrK6Gz0aOOO98qNAPkuxJb76CHW8wUKGPcs0iL347f+9vM4RvqtyHrzpXOE9gHevPY0/Tz70VN+92VFtvkHBk7qEfi2+6Oslvq79rj0dsDS9xXAmPifuND6i5gK+tVbiPUNagb6FZuU7vukiPi/GnD1vSrq9WfXovXvETL11jPe9xWXHveDR670gpAQ+fvb0PSLc5j3cMPg9wrWPvdJqsTyXnDW+4u7APSidTjwLjKE8rWkEvCfimbwoGQE+fdEDvrVRk70dPLc9d64HPZAQI7yCk4k9JR7oPUvSxrrfJ429gETQPVWEVL5z6uo9yva1u0e2uj0UxoI8",
        "FtabPCOUET5QepE9JYscPl2f7jwHVee9PtRDPVwpiLx92kc7GLl2PWTEj73FkxA+KBNAPU8rgL12yUK9GJz5uxIz9b3RVki9RiRDPieKIj63AAE9FgLhPUCjG70Sk7A72MkrPZBR0D0qNqQ9XmokvEKJhD3LZea9sKcNPmkQKj3D3XU9tplrPd/ENb5gZiQ+hCT5PePXh70gDhc+AsQhPeaAvb3KhtW9iN2XvChPhr0O2V2+DNoGu3FcfL2m3529PsSqOsr62Lx10LE8+9mEvR0RSz1tdPy82G3PvEwHKL1usgw93gwzvv3AGj12ERC+0U7YPUImFz2v0GY9XnEgPcFoF74k4/893vExPnXHvL5tVDK+XdjCOj69WT5NqvI99Uw8vuXWBT1Hj7698/GbPTjKkb01jc+9kAA7vrF/Aj6T/4S9BZmhPacIybyJE0Y+xDgIPlNVUjwDseo9/6WrPbrPVz6opKG+XyfYvKvsSj4+Ak09kcsYPlSfKz3r0jc+yH6JvVZyxrvbWo89bQdhvSzibL2PglI+wvqbvf+Xuz0R39Q8VNTiPTd0CL7SGz++hboOvigE5L1bS8K7StmevQPWV73qf1c+oo88Pb26Sj4mDtI6dkByPGlskT2vIAU9EzkmPjgNOr6n3yg+ZEgRPiK/DD7tEy0+vW6VPVJEtz3xXnA9YvOxvVREH74LuoI9twF9vj0BgT7VUpA+X93tvZK/xr3pzLU9coMoPVfSJD3Ir7698IC3vOTRYT3VfRS9u2aTPYhIB7zwCTA9dddrPpUdRj57c1K9R5yQPeBfmr4Y9Bk+EnncvLm4Nr0l9Cs+nfRHPhkkkz2FqRU+mxl4vU70pz3G13o9Bti9PXmqpzwVBS+9c7tivdJYKTwO6XM7Jwr7PShAqT3J0m68WJ0uPf86Ej321ve8O8EAPNBVaT1wgJ89Kg/LPT9tRL7xjXw9cvw5PRbt5b09cpq9/1PfvTgdgb69sqI81bf0PdvSiD3HqRi9J/Pjvan8+LxTLxI+",
        "0MHyu8yqDj01ELK98lJ6vtRnZz3ftLA93CaYvJrSzjyhtxo8MANOvd3NST4R+nw+RC+tPFBz5L2obem9Grykvm6XSD7WvMa89Mc6PZ/PwrzEGOK99wVcPXrMqrwIUSE9XbofPiWLmL2trbe9GVeTvC2HTz0eM5m7FlBVPqgIpzuOsyk+26PsPWaiyLxftqo9eB9hPfD/z71rBCM9UdXxvUc6BD6GT2o9Q3w8Pq5IBD7Z6eG9h1w8PqRuFr76ABw9tODyvU+txj2+6ge+DnWcPSGZpL3/3IO9gVpnvbgZdzyLSQw+iA0QPsH1cz6MrE69mX2kvXF1g75Ze1u+ZoSkvV2NoD0qfqy9TgUhPtDMhr0Ok+a9UzT0PGlwdr7AJlY90/SAvm0xfzysA6O9sem8PcTQBj3jDGI9lH36PK3ZtzwcjdY9iWpgvcrubL2D1lc9CtAivXCcKD6I37+73XO2PFlprT0LQeM9hdrkPcy/Jz0leio9XHYrPrLOOT7ezkO+EbKePTkf8z2qnIY93x2JvVjqTT50WgM+2dlpvAKmcL2ums29tTHyvLLNCr0/FYA+QluXPFD32LxRIjS9itoZO0srgz5t6No9y7cLvfCmW74CkUg+TmyLvdQwwD3hiSY8DxzKPWAI/T1L/BM92jcjPtWKUjtlNNC8IhoKvmta/bsKsP09irRQvYcDAb3LOau9PI6YPY8U1L2lNJS8y2k+vpadLL45Fja+09QrPVplGj49Woy9AdZrPfX0BD4CxxQ+vYtLPlUswz1hGVg+NeM4Pg2RI73aAbe9GK1nvpAsmL4waKq8lv++PgsOVj4ft7i9hLQovhNSir0OWAs+jZ0FPtQ3+rxcGeY9L6xMPlWdBz68pke+GOh7vTYaar2EFJe+oKk6PUpTLz74YP896bFnPgGVk76Z9529CxI0Pu7OLz42HnO5obGkPB3IUj6GXa89qMkyPH7pgb38r6W9hbxEvs39uz2VeYY+thiHOshcwryI/Xm+7dFcvfDQxL0IFlo+",
        "U0nyvQXm2LyMPO09baycPaxpfz2PQW29cfVPvY4bKbvBwEU9QEcuvT9s3r30018+4lbkPIUkljwUQRS9XewhvgmeM737n+C9xzLMPfFcX7wyMi8+5NRWvVp7m7uU8hc+AYfovb2G4z0SqTg9ImjKvdkPAT679BS+1bejvQ2RCr32Dyi8WwtmPS7MDr4II9i905VmvQtnQT6jexO9qOcwPctCIL3A5hG+MAs4vCSWWz22pvo9KfiLvREoqjzoNse9FV28vTmQOr3ALno9OiI1vj4HPDqAwgE+y4AvvlMBSz3KrQ89RzIqPuMI5r0ekfE9FaS8vRw9JzyAIGg8gqkHvnutFb6pmac8Yl8OPijXOb2LhCA9UKPrOzazob12JbS8ozS+vXa3Nr7If2e7p2y0vcDytD2keZs9wPELPg8wUj1JX3q9xb07vZB2AD5HYtu9vVOrvOPhlL0SS0S+g5AhvVXmX74eQBm9esSgvZvhPz1dHWM9UGlsvd45Qr3e8CA+S67GPGPfrr5jvyc+/+Ovvdktmr0bBMK93dt7vpUGrr1Pi5a9xn3MPIranb4mNsQ96uBvPdC19T2biaq9YNWLPXIvYL1IDla+GfbwPeAnvz0x48S97zbTvd1uBb5BSXA9Xn3lPBhzgD1vmB++fittPdfPKj4feQU+0+SjPS3ywDu4AlM+xtI1PbxlLz40qfu9KabFvRZ/hbwPD6k9k88kPk4hzDyQoyg+uxEePZYhJL1QQIW9u8p0PDL0RDxz/T8+y3cDPKdoBL4DyR0+c9M+Plp1vjxvPbW9UoyhvRVabr16HXw+4qAkvjDmOLuFY6++PrZUPgaaiTzt8kM+WD8Qvqbbrj3S1OK9xJxJPhTFIz2wYB+9YxERPW66Ez5Ro7092Q5AvReijD4EbSe9xoH0PaVvMT7iWRg9/voTvvycib2WANg8+BpjviAQKT5+JCE+xj6nPTgjqbx0TyK70aqnvZqMF74yLbC92WxNvhJHkL3u54q986y9PP07Pj51hEa+",
        "YS7pPcuRIL6O5qy9Hkkmu7ALmTxWaz49NpgsPa8Wnj0ad9E7gxV/PMbDlzsnw9097Iq/uU4FkD0ul749/F8mu9y52b2p/oC9NIZWvZ+pWby0ASY8QNXovWbUHb4Rdpk9WDVzPhx1hT3G6Ms8br2SvE9KhD2Ty7+6apeNPCNc5r2K+869+Mf+PTfBib3BKmc9Gj3wvDF5k733OuQ74ZO/PeI47b16wbC9NNAVPshBAD4n75a8zOwfvQEz/73g4nM9IaQGviL9Bj3W5m08cvKnvQ/iej3fO/w9ERUVvkNfb72/8EY+5h/ZvajAtb3L4hW+X5PQPEO8Kr0SBu29znEBPkogdL2AhgE+dJrOvCKUsj1933O8DOMpvmXXRT7Jn0g+FO56PG6T5z1YlyE7mVQ1PiP3Tzw3m7m8VD0YPohulT3/eBK+8pxaPvuG2j1uJ2U9kiAdPWkFTj7S6cA9YpNVvQ7Stz35Sj89yCGyPWrVRL4JDf49pTS3vTTS+jzN44G9cSxyvewAM77bTwE+97yhvRe7N763nFy9HG6XPeOG/TyywBW+VigYvnp3XzzfqhC+YdfqPK8WTT39Pb09y15HveOdTDonwhq+Ao2Evl04rz4HET0+akCcvSZawbwSQyw770bYvYx0sbwHGOm++eRZvXIrML7D0oq+Z3E2vueU+T0yRI89bWdDPY4o9zwmQxE8NE7ePLyDYr3Mvlw+fH4QvmI++z1UKwK+x7F8OgSe+jwXu5m9kG4nvu60wT1hHva66uQJviQxNr6rUbe9k5bEPX6A170yy5K97xT+PRFD/z2Mof69sAyBvbXVWr4az029tQrDOkHA9b1HzuC8cf/YPRJUQr6bD0Q+JEd4PX3Kk72ZP5E9EaKhvR4CeLvA7re9+bQavoS6KL3N91K9akA4PMXQUL1wEbE9fHjtO3E7+LyiJOY8TIoEPoyoSr6Ax4O8zRI9Pv5xyD06NK88nxLjvTBNxbyHEZq97528vZX1+rtU/+68DDDXvRsarT2rSsQ8",
        "1b0ZPIDdDT63n6G9LiMLvjIoojxjjHi97NUzPpa9jD2ClYc7JDVsvpvbNb6uz+W7FCbqPbPyCL5PX2e9iUKYPDWcGj3UM1i+XdwPPSSWPr4MOQg+wNslPm3CYz2XCRy9iWqvvXyfcr761KS+6W5rvYcoxT1mjRa++IbGPd4fxTw7QXo96U8hPdUTX77RQ7q82ccEPviZC75xX+Q9AUWCu/K5Xr7hj2+9l/2ZvQtEhzyovM89RtFmPSz4Mb0mvQK+Z3GgvWDAHT52oMC88lLWPdQxSr0cxTM9dZL/vdGQWTrpybY9eMA5vo+A0r1BUjO94XFxvRFHDz6JNVk+OfIQvYOIa745uXG9dHbfuxwQpb09PnA+/ViuPTzHYb4SYJc9EIQlvkxjMz6x9QW+NV9hvWF/Jr0uV669JfwIvhrNd7z7jv+9aqQKvhiDhD4nmkA+uo8MvgEFWL0gz7y9VPpsPejOID79KIq9f/Oevu9/FDt6hNA74AnivZ2WWTzM6wu9PScQPj3G4T1t2jG9IMXQvepUQj5bPzW9fMctO/U0zz1nMyM+R0e8PWYod73OWus96YYUPIyCkr10eDg9I2ecPXomsT0I5Nw9sF+nPeMaPrxLIWG+OUM1vkqJCT7cclG+PjvnvAyjvD1+0lC97WWDvJAY4r0kx6C7LPqWPY5LeD0LZ1a9P5IZvjPbE74uzAY92T1qvZ8ZPD14vFg+UBVZvDGmw7srL989TCcNPqOliDxun6u+Ks8EvlgJEz78V0+9OUMIPcb6Db0weiY+cVp3vfjouD7Azoe9ENR2vl7okr7TN1S9dsH9O9WBiD1LNgM9AtFVvhMLjbyplgY7rMi5vVtHFz0YCOY9YZUhPlvtBz5stcY9YOyFvQDWaj0n5iq9AfGIPWWczj3D7xs+BXbBvD7tCz7qAg+7H9byvY+h9z0+bN07tztRvi+TEz4gDQS9F+3Jvb3zLb23Ttu9mx9BPWGAFj7QPlg7QArfvaDxljx5u9a97r+sPWcQGr24+1C+",
        "CwoBvVGpNLqBAf89X4Y8Pr56SD5VD5Y91y5bvTrBnz2J39W8CZMLviRukj36abE9j7tOvuBZ970Xnwq9YvqVPTFU27wXXg09jyojPltxF7552SE+hkkqvsVXIb6QUTG+3zBhvUeooT1Mcsa86bwbvuQOdb6RsgS9AmIGvjAcwL4TmEg9z1otPSahcD1rWbe8gXoWPpgvt734wcy9ZQsEvld61b0OzrI8ud4ovesL+DzsUZ+9FP1FvU1a4z0yABc9w3QZPIBBNT2TLNc7Q5B3vrRYij3z3jG+WunHvZBR5zwqouG9o//BPDwT+D2bbkS8t2dgPmLSuzzb5j++evQkvf5kDL7iJgu+2lLpvTEXqrz3iAO+iWsOvb0P0zzH14296yGbPZybsL2xKM08NodVvVoLL76whw46pBlKvnHy7LyZBWA9gOrEvatpCT0FXom823YTPbQRcj03uGg9y8UJPqr26bwoAH09hWSivVUreD3slpq9zrOlvUcpAT7v+mS+OEpUPiGIxLz9fKY9P19VPoJPyT2Wuwq9P5DlvYp25b0wtEG+SctOvY+JF75Jc9q9xAuqPFucmj5dteg9TSuuPEmRPL7N2vM9tdSLvC9phT3cPSY9KO5fPsJoZb3UgDM8ZC7DulHhfb0DrOc8XyxFPUVyqLwHEDK+7u9NPeeMx73ih4u90+6tPRWe3b1klXA96IqAPcAdsjzMBum9Jb+qPGuDyT01yR++DRvCvfbJVT5lGqE9P2AbPRHFPz2/yR0+tQSuPvWJuD13lbI9y56WvfQwHD2eoGG91nCMvYQwyD0qmx++GjrbPTuqcr5bRQ6+2urDu4nZ/T634ns9aL5KPmg7mD2Rtqk9vh6DvC1wOT2Lu9091uonvgJzjz3qfoG8Y5hBvIK3wr39bWQ+0mXxvR1aHzyr0l+90qaMvUaLmbz27BG+ZreyOwpFNL3qAZy94kvAvTsiDr45Ifc9oc4EPpakv7wH1bQ8VNgvva8qibvCorE8hBjlPfMRbL2/6NO9",
        "qFFCPrIJHz7tO2u94px5vUreAz1xgJq7zar5vbLnij3NZZy9QexkPcBjQ77bAwC9qQKgvYKKsj485og+jXsQPQ75Eb6hNc88+qL9OpxdrD2mOxs9aA9lPf0T0Lt3xbi7GxEHPayi8L0o/Q89Fo73PAea0L3chUy+HoWvvTK11b1Au2A+62BrPXOwMj6zZPg8+1CnvRTLwz0xcz69pRvAvYk9gr1uKK09CrcivMYtQj2UIfO97S6wvJXByT1HSAy+1NcfvZD9t70GHYi9HY1tvbGaDr7bAz49KxwFPar2iDxV8Rq+6VRcvdtUjj2/4E89EmmNvLvvIL5Yj6E7goJfvNsQLjzGhEq9FY4aPr0ogby2FHw90Ku4PASUSD7obFe+t4d7PcF5cLyKWIO+uzNZvcr1BLy//J+9VSTDvZXXLj5/UIg9qNWsPQsVKD5tLz4+/+iIPfYEGb2yz0M9Z54tPktAKL6p6gi9w+5LPbNq2TwvJLq9AiRyPetVBr3UdgU98JCevV5XWj06xy2+klXlPLVozT2DrY6+/IekPswL5r0fDmS9aH9dPh5DYL5f65M+nfcSPpRjGr5WXb69IJOrvYzIG77SwkY+wOitvRK71j2mhxg+ZcUpPAUBDj1vRYO9Z/wLvqUSUT0pHFk8QZSzPV1IkDtxi2A94pWcvX78uz07RI+9LIB8OoY4wD3s8CY8RQ1tPfie4L17JVY+yeByvZIzlz0snze+6i+JvRI6p71qeDs+95haPKk8tD2I6SO+wGPTvFRBUL3zGJO9RreGvdDwRr5IOo+9CofzvRlQLL6ptf89wYcGvlO1Hb0y1iC9ovGfvci4Kr52mMu9tiKqvaBQ/r2qcaS9pzrIPe6n87wihQw8Lz6VvpMFgrwdVEM+VW1evfueAL5zybw9FJuKvhjpTj60PRC7lyr3vbiNOD0524Y7QD4ZPufrNT1sxcc80SP7PQRxHb08Inq9La8Bvl+enb3OnrO8kpy2vbuTWT28Rxs8RjH7vWVmEj2+5Am8",
        "BYqNPDrSb7xHnds95bmvvm9DdD7gfHo+VZQZPk3MEj2Kp9W9D8InvVfYx7wAHyK+FnKGPUXhAD5YenC9XcLVPWUpJL1Csbw9DCrxPNtl670LYdW7sLZDPZVnKL7iOKS9PLRRPTOXbz5aDTC946s3veCJl7zuery8dyduPoFinL4OED4+s4t8vl9iWb2zSz29MckCvsMqRjtTtwC+npsGPqpxvz29xVw+D0iaveUWljuoYAw+N33HPXN4LbwXNI69T4PEPRsPxDzM24w8oVbzPFMQlD0hUxW+o4favEecJ721OM896KYQvvRqDj3RahA9HKYAPUhojb1HlP49mjpnvSo4OL0XTea7/a2sPXwNUb6IMck+12WZPsq+Kz5Dfks91AKQvRvvgz1dMIs8San+PfiGPr64QrM9vO8uvstioT3szuo85xPOPP0URbw/7e49YgruvCNxu73vjWe+R60uPoX7EL6MtFc+D+uMPQkA1bsyYNc9R/KivhSEhT3rtoW95vmUvIJjPzxvGJG90h2APaZrKL1tRiO+bODMvW4mpTyUbXy8NelpvbeeuDzj8mc8FZBHvU1rPD2iucm9LAT9vRT3T70L2SC+Zqf8PdnMNj1tXDe8NLIWvlDG0b07jRC+fbKwPeY2jz2xCAA9qiPBPK3LPL5eZDI+kZv6PX1QEb6Tyxi74WqDvUaya72AP42+aTIgvfLBHj6Gk3g8Ogp0PdEkCb4Plvu9rINKPTbRyr2FYGc9NPxqPddqN778lWy9a3C5vW/ZxDyQ5+u9i0eKPR1w+r0YOPk9nXhGPUwoSr0v5e6994gGvgut1r1vARe9K7s4vazZ970tAN89yNIIvvHW7r2ZgVe+xBD6vK6kRT3hd9o9bMqCveFQKD4gDPi9Q3aLPgdYFr2RtsG8gzrFvU1QZT3Mkfw72o2pvC+DD7wghio8Uv//uzpy/D0m9Ia+nLvVvSNqDr7smsE9wlh8vNDI5D3ct+S8rH+FPnUDKr7uLrM9FwXlvFbHNz1gC6C9",
        "axNUPReaLb2uyRk+KU2evRgMd73p5+E9rhqMPaGl5rxJkXc+BDa+vSV3tz2e/rm89zlKPjq+9L0D3M29IdW6vRe8eb54Uzi7+CLdPWpJaD2Gg6I9/6sYvVfiVj6FcLK95T69vSvuEb6YeBC+lB/CvRpykj1JpqA8GVWdPRMAgb1JY1m9d9ESvfjb9T2rkjU9bpK2vWNjB725CkU7DC8sPq84Sr3tQl++SNWWPiYzm76yYUg+HCogvXG9Hb2sjYM9H9JWvZa0Kbsxhm+9sPxgvQnkKj62iD09yU/XPeokjr0EYi6+962HvStsRT0cjDY+g1cJvgI2Ar6woBI+MSR0PqYNljuIj5S8FFNBvgUliD6zrpk9WwcyPnmVob3Env09M4SGPK4ScL1kV1W+Kd/JvYE8jj0+/BS+Sc+qvZtiyz0I11m+kXw4PmYgA77b1fQ8bJ3pPfFljr1frQC9UuNYPvJL9L0/8r+88elmvK0lvT0i7/G9gluzPe+OmjuTTzg+sEFfvZC2mz2YpZy+ABxpvqDoD74nY/09Maf5u4azAD6zqwY+B6YiOuKoB72gUke+k7hKPh8aAL2pMsA9UyLfPcD9s70kI/s9H3/YvWjyWjyodYi9Se2JPHNTiz7DO909dofePZ4tqj1mT2q9J+wEPplBob2n3au5RDcGPuG+2TyN9NY9FgJ8PTJvTL70aLG99O8Ivr2OhzsBJQ8+E9nrPS+EdL2GRpk94VK/vSyO/Dy3gP888KQPvriUYb2Eg8a7dXIAvikZDL4DtWO+38SrPWaVL76fByy9n1oWPkyE7j0vEL89PaxLPs+5Jb52vxC9uYmrPQhAKLwnNxs+/UbnPTlcl73Fbf49F1K6vXqwC72+sQq+NiMLPabpRz67fTK9GAqgvYC76L0dBvw9pEwyvliX2T2d8S+94VURvkT/ozyb6gu+nR21vUc+Cz7fY9E9SREcvgUBKz6Rl8495tghPSdaKD0AxIG9GBbZu9zMJD2woLM8YyInvvBNFz2SPz8+",
        "ca1PPbEFLL5sLiW+vZa8vYk3/r0+8bc8iejmPSb00r3Hn1g9vO4PPja937uU4Ju9TmSgPfqp3Dz1kmO9jf2CvekBzjy+AAW+zFqsOqoQWD1R/Vk9/9yRvI9HDT77frC8aOaKvv+bmrzu8SO+8pmlve38Fr6sAyM9HxPxO1o1Hr4tTgS+SFCOPXUTKL4E8ia+KbDJvSiafj0YFWI+5DKzvSkNGz76kI28HYAXvskSjz4sSgY+/sIgPLi1zz0bqig+mzh5PUhZEL7NpJU+sCj6vcQsGr3DKri9bsSzPmhyWb65AV6+HNAfvUY7/rzYlK69pFChPSpE4r2wXSY6RSClPUOmLr4JbaI90EPZPawN5z1dWAe7AyW4ve5z/LxShPg9KGAoPJthsT3SruC61RV/vX7a9T0UqmU98qsQvdN2LT40RDm92cPHPdA0tLu0deQ7rEDWvYQPKj72EMQ8nhUhPXDhgb1+Usc9WxZjvgKTdT1j3yo+jF3lPKlL4b2qRKG9kMjPvJvetT0cWWS94dUwPmBHvj0pjsE9ZiwMPqC4uL1OnZW+gr2ivaGeD77EllW9NoJBPky/UjwItPG82W2kvA7iiL1I/jC+RxcGPvC9ID5aIYm8wVunPcXMQT0objG+FFs8vjdrPr6exBi+wI5kvksyZzwo+8u9E95ePSOJXL5LAxq+VHy7vn5JsT06SrW9ZYgmvVjFA7q7DQy98g35vZSohb1zuAw++c/hPfAmTT3UQua6t0u/vZM9WD5XtoO84TyhPBpu2b1fNy29LrmFPaBFEz6ChwC+7PYAPlAccz36sJG65IcUPcmVOL2f7ZE90I9fPUde7720NLg9Qf94vNjGOr7IvS2+Nl0PvpNSEr1LUp88lAOfvMdKDT7HlJy8QylivOts7TzjDiq9rTUZPTSBq7zhSvw9PitYvsVIljw+2/Y95LJEvaPnFD0EyYS9TMyjvOVKVT4EKbu8cy25PWtWTj5maTY+ogvEvRhsHz39XTw+0GUZvWQpDz0Bkaq9"
      ]
    },
    "conv2d_3": {
      "bias": [
        "2iFNvkSblb3syJa9Kt7yvQ7qjb6sCUQ+s9inO9Z2Z75/54O9rDTJPYAvNz2VfqE+iJqfvuf0FT7ugwA9DqOpvWXJor69wOy9ccxavdCnd77xX62+EHdQvlMQb72aXWY6/ObsPaH5F750Mwm8EjLvvR5ajz59Bs++kAjmPDxaD74="
      ],
      "weights": [
