{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              19,
              19,
              5
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_1",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_2"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_1",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_3",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_4"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_2",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_2"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_5",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_5"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_6"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_3",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_3"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_7",
            "padding": "same",
            "strides": [
              2,
              2
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_7"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_8",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_8"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_4",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_4"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_4"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 256,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dense_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_5"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_2",
            "trainable": true,
            "units": 361,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_2"
        }
      ],
      "name": "policy",
      "output_layers": [
        [
          "dense_2",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      19,
      19,
      5
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            19,
            19,
            5
          ],
          "values": [
            "adCsPj645b9g8K0/VRoeP6wIqz5+9dE/bcmZv2Q0xT/gmV0/f/zDPyBC3j7qI5Q/OuKDPtoRub6pwO2/hAo8P8eBM79x82u/se4Tv8UOiT/fE5q/j0lpv2Dk2T5JqG05nte1PzlMHz/9t1q/5VwsvyMIET5XSnC/Yo40Pzlv67/R34W+dOMNvtLq6L5Z8Qq/wLcMwFFOJD+cm+s+YTHIvvtqIT+vvSG+/0JfPgf8bD+KAaO9i/MDvypqjb5MFDm/WKc0vy4XDsDPpzU9yN4nP5PDEz54dVo+Evglvg+vIMB6h1e/+1MkPzFrvz66Aoq+YywbPzeV3L9Ab6C+qKBxv+NLQ79SVDTAodiTPqO3vL2MfIU/ov6PvYCInr9xI/Q+igMsvj/DDr/t/Lm/e5E2v/CC8b5hdtM/wkmsvgIybb8a3Mu+hkhQP7ncCsAq38Y/Csz3vwRTxr5p9tQ+zDMkQOJ5Ab8/2VK/MG/Cvu0RmT8qaf6/R6YoPx3BnT9MxuK+BYrWvs1VuT3hSX8/A8VuPsT8HL9M2yvAv912v5QMt78Egs6+ZT1YvwzCXT/Z3qC+lVagv8MQtz5/8MA/Iy9rvxBEJD94zgk/t7MJv0iror9b8Jm/84p0P14J9z9SxwfAOZ0QPtKzMj7k5Tq/Z0XUvhhkE7+hrrS9gBcmv+3Ntz6qCXI/AT0YPrfAFj8AmgBA184qv04WFL9u7v2+54eRPymQGEBMFai/IFenPru6BL4+kfa/nwoKvzD47j6odwDAR1FnPs9LJsAg+js/SyBnvyDJrr/c0cc/12iEPwfNNr8ft6S+KcZzP9Mt6j4SYgS+TOZFv3ed0z44ThJA8sirPmxHjL+WDPu9Rdcav26iDb/3YZy/gTVvvbgL+7/DY0S+/KIUP730fL4wuvk9V0zBv+BsZD8o7Hg9kLWPvxsvzb4Jzz2/SXyDvpmFKsDtywdAoHhVvtdGLL+RevA/ID5hP+Ol/zx2vCK/hpsDv82A377jyp4+pIaJv214rL/nhY2/",
            "9kWeP8XZdL/YfbW+a+g3P8IOXUDvE22+UgZRv7qqHL8JSty+slZGv2HOj79+O5o/gF1ev+J9XD7WK/q+HLnvPwac5j9Dc5I+b3o9vk1ADr82Hlu/1u/uvgyIbb/VMk0/3uF6v1EFO74vueK+rhraP5OK8z40YAvAW5XzPhc6JL4buCW/U2noP3Xxpb5VSKc+pgDyPrCzdL/I2YU/YLBtPkmkaT9CNY2/q0KKPyh2CEBjRas/BCF4Pv7c3z7FcClAe7bOPxSJIkAhqgFAlvpAPQSDMz/p1B2/r3N9PnBE2D6nB1+/qLbHvhl5pL8xnqi/n2g5P1xJkz/HjZi+8RNPPTLDFL6XiV++aqk2v/AlJ78Yf6C/JVOCvwqNRb5paJ09UsLxv75JHkAi9zu+/gYxPtQWZb8IDL29wwBOP+G4bj9CyEQ/EZwAwD9BIz9W5N+9sNP4vu8har5AOqK/4imPPiKi877BV/4/TekKvmmsrj9zWQ3AC729PUGBHb8qxrS/rvXFv7Kfi7+kvcE/8BDMv0LVtr0z36u8LobnPhn3CkBx8/698nYKP6hMSL+Qta+/o7YDv1W65z+sCve+ophsv6bnAr/4fp4+caq9P4jJLD82yFe/+ZJov5rmL7/mfUa/xl8BvjwmCr8T4do+ofGLPzylXb/qDqS/0wbdPrZmBb+ba20/PXOSvbyzOD9r/AC/c9Z+P4irOD/7Zks/jYyRP9yjnD91fJQ/iFaEvwRHLr9EJUC/iS1kP/7EDL9S9V6/061Eu2tcMz/bi9s+Wqivv6jtOD7qSkK/vd10v7CRtT8HB5k/ZXC4vubM8b8aX76/NKXPP25oNL/41JQ/mxa4v/71tr/wJAK/uGgdv3jEzD4z4dQ/zhwrv3Y4dj/EK5i//2NoPxS0pz8VndM/GzRcPx2TpT7yHDI/t/BBPxJviL7WuLC/DPcov0Nqhb/pPS8/V1mDP3jTYL8TNue/wmKRv90cib8dbkQ/RXeovQWDDD8fw6G+lTlgv086qD6+3oK/",
            "pM+qv5V0Cr/ROsa+ARXTvx6xwT/REwBAZFJDvtoGAj7ts22/nqmGv+oklr/8RcW9Bkmkvemchr+kt/6+m57kP7h44L71/1m/t9fdvsNmg78L3NS+ZBHUP8ieV7+0/Io/DErpvSDjiz3akRO/PhQPv1qumb+rWxe/Hg58vhj8RDyjx2Q/1EQPPj0yJj7GQ8e+rBqHPh7ZIr8YcfU+EhidP54f/r4PG9S+ODWAPlfx+jyjyX4/Ub78PPH3k74Im4G/Dh1HPxH6w74YYLu+mCN/P+HkGD7R5gI+vNUCv2snR7+tJXg/rgGYP8NuVT9zu5y/PJj8v2n0O7wKpJ0/uGIxvonrFb/atsc+uMRDPqa6yT+NUL2+1J7/PePpZr6RkcK9tW2oP9cbB79UKpi9mNDhv8FzW781h5I+xs6MP6BNs7+yjQ++MhIJv36QW74cSys/CtK7vuFPXz//Xli/OFJJv46pLb6mh9g/8ubOv98S2T7nm00+w/3SvacLWL/znwS+P5GdvUq7Qr9/ZrM/bg+Uvi7JhT6fy2q/9rckvh6yJ79kFzs/LakOQLi/sr7RMIW/tQx6v2eHUT8dEDc/E82CvVLic7/Vmz4/SEdsv2sdqr/OQJm/xgRbPxgl2z4y+Tu+9SyRP2yfnT66KOG+YdiLPoR0+L632no/CAjbv/MWh7/8DpY+ZqIav9NDX788TZs+MxPhP6OBpr2V5wNAN1zDvobJcT6VIpe/3TjZP/ALyz8b05A/5jNTvMNniz6S42W+Gpmvv/Sjkz9sv1C/OLbevxVKzb2K7NQ+IImDPx5Hpr5Ixoc+Gc81P1mbxr8V0As/N1yoP0x8Er63mKK/pb+JvyUzBD9ApKC/ydFqv/rn/b8+LWG/WjJGPo8Lhj5ft7e+gG+OP5CxVj+DO4Q+1s9pvygGozxHLN8/xiozvxzjQj64sau/6XsGP7RPqT99Nxu+4EXzv8pMeT9GTou/qZQWv4GYtD6uMnW/5vNsv7zCD7/a9LY/uJfUvx6ryD08hpS+",
            "UU25v50p0r+oFmC/8fAlv4E+C784jES+YdfwPwQCjD/ri749Rc8cv9dMMr1s90I/z4HfvbehnTzxDrM+UefpPkV03j7lXtm/e1NEPtlZPD/hhW4/XYnFP+5zOcDkmgq8M9X0v3+BND9dBT+97F1yP6sjHL8AdkA9tBUTvzGJUr6WBfY/LJCiv10GyL5jOxG/pBiMP7ECx7+ump6+ujByvs4FpT/bKgo/nkKaP3h/C794WuE+gBURv77pT7+lk3tAV2XTPzcrjL6SizU+pMRlP66qebwYeDdASqzvv6vByL5cYm0/SCCBPsawmb+zxT2+LzXCvuTvhL8sNY4+6JWqPxSYDr6K54a+2pEVvwzesL+RHUC/QD//vrclcL2eX+e/grwyPyQgPr+HxyG/GsiQv9glVL/XusO/8ndzP4FHXj8VZzc/RlICvq0QHz+S5mU/OrYzv7LoG79xK7U+3FpOPgHlgj4hbNs92kG1Pf+svT/fqEA/AjeWP14SIT4cJZw+jUoNQNMlBz8xb2Y/axyJvlaglz9X4WA7u/6VP9KdJj++Fe+7t0tpvyo1s78rwRc+FjxOvsvnNL65ge4+zCvdP7t0l7+Qx4g+x0vEv7Z2ID5jkqk/E22lPrEMFD4A5Ss/XxtjPi1RqD8XKJe/M3HrPjngBL97E7s/Mnu8P/Gq9D5rA96+RNs0v3aAlD/8Q4Q/PRryPgHaaj0F5kG/WOXePvLSy77HN14/xBCUv10cHz6MdbA/9Ey0P2fkAL7CII2+CTFRvrRe4L9W12DAIf+AvUC0hz0BgHy/1nexvgeE1D+md0w/FBWnvy5rQz8ibWW/HqGLPRimsL81nXA/cTMvv1KNHL/h+QQ+OJnTvsey4L4dt1M/HpFNvSgDGr+E4/A/AlfqPlxPS79LPEU+cGa7PuZyU7/8ZYs/O3XyvxZaJsAJY3O/judbv0qMWD/TP7i/To6mv4ndcz/MGcw/k9ymPKMNcT+u7Ie+UenuPjZiHb5QoIW/aitLP4scJz9wRRFA",
            "/7TPPuJhUr8/Qxu+beirP1IlwD2nOlU/BFcpv+Rybj+jiBo+nLCCPygJtz7zOZE+29Hev5DcnT9XKV+/dvXIv6Qb1D7a8UU/qeigviI8mj/BHWY/zlAxP1CUoD9fRi4/egi9vn87F7+Z0tG/XXRbv4CMo7/htfU+hTADPnrnbD8jKOy/2Vo+v1ZpWj/S1zM/lFNev/aI07/3rCbAnKqgP8Y+lb8P8+M+0eUbvQvrGD98VVS/27efv7ko9b9utQ1AFM/iPGnuAj0Cl/y+0A9Qv65OCcCId2A/dzAkP66exb4X7X0+BglJPkARk7/rZoM/H46vP67FET7nAy2/Ed7GP4AiV7+GjxO/WgRxPz3Eob8z7VY+DDDwPDBVwb6+VP2+p+eJP+xVDMCS1rE/6MnJvt+/Kz/tKeY+uYVmvwJwKD6WF7i/ADFJPiU3nj693nA+XEtdPgZEC79fsSA/z+BTv1oDCT/haVo/Kl2Lv+QW4j5/AT4+2pwDvTIZ07/T0LA9PeAlvWtc+T5gQzC/e6LLP9Xsqj4E2HA+zINGPydhVz8Ef/E+7/iAP0kkv74IQdi+KPO6Plyair8LFUa/T3aSvmOnibyQxoa/OzuNviTCsb60jPK+UiO3Pgw0fz6KFZ4/Ika8vjU89b2gI/g/+44IO/akXL/wo8A/jL4QP0HOqz9+7FI/+IC7Pxr+PL+6Inc/k/Zuv6yauj+rKDo+Z+w1vjQc3T5VAhm//RrovukEAMCbuSU/FFaGvlEAwz6GZBDAQ3aKPOWgbD8V6Sc/AJ1/PeamND8BS6I+Lzv7vlRLD78Yn0A/BOdjPyEmhr82T0C+78fmPiG5rj9J51Y/6HTrPpbOQT+mgc6+lwSZvz/umr9l0ak/wdNxPwr7i7+Xira/xfTwvlzBZT8LKlU/YTxuP8R8ST+bujXA8pYgPzD6gD135LO+aHsGPvxHt78yB+q/z1XnPsXjpL8taJY/9Mejvz1VQD6ywG0+/k3SvxNTK7/ZLJm/Xi3wPihNJT3ni0dA",
            "7+8EP+w78j8J7KK/gva6P/evsj/sNTg+4OWTP90PKD/Azc+++dAgQIEo9b70Woc/WneTP3fnBT9cjCa/0kicP806NkCTVIG/xHO3PW/Plz4CoK2/rP6MPqQQjb8PNqI/fbxwPr6Yl78yDzs/OMPJvrMob75pdnW/6zrQvuBj979YDpC+wH3wPkB5nT8L44a/bj0LwNCi3T1Wdo0/ipCUP3NeREBmb0K/K3mqP+ewS7+fxyE7HiVGPk0wnr5i1uk8xZQEPfM2T74KYQo/HBo0PsTsjD+6pBDAQFOZv67iIL5DEB4/Sm5vPxXRvj9ggow/T+gRP+J3P7/Z31Q/7DQEwKuunbtRWX0/5ZPCv+vRjD8EAkG/aHCavyv6Sz+LgRTAtrQwvojwL78CBdA+G+PaPyN6D0CHc0+/ChiVv3+N/b7SHtO9L6E3vqLd676gA7A/mGBRv+BJ5b7N7Ua/uXFAv3enAz8gUgG/sUr6vqpuyz/Pu76/MGrIv64sqr+HV/0/bPjQv8n12z6tRxLAKMShPvZwm75gGz2+asLxv1qInb9D+9y/6IMMvix+gz8FSpi/MHbrvcstE7+etBDAzzTZPpskST8tBr69EVaIP3g8N73XKQxA0w2YPXuRMb5Op0Q9GucHP5hk+79wfpQ+C8EKQGgdLz70+GU/ZAE5PluA2j6HXlK/msVuPggbHD8J+YW/GI2Hv82ioT6MgDK/EZlDP0arBb4HU0S/Aj+Kvrsi2z5L4+O/yvp5vKwqljwRceu+JCXcPghuB7/lvBI/4740P2WOGr9EVES+3LOrPM06e77cCjA/vvVeP6RR876gLQC/pukHwEVXKUAxtAc/UoaivlQ54j7Gy2e/asaAv2cUvz5cz7y/MHZFP6WdyL8pdEg/HMLHvyM0dj8268k/bTS5P0FcD74PCTu/zOy0vx4NCkAhHQG/pJinP/sMnb9xePS+I5Asv9d5K7+77+I/ml+VvpJNqj+T+JM8J/WfvqrhOL8obK89X/xwvsHyNT9T556/",
            "gQzWPjLuiT+AZkm/b3pdvrl0CT9+oem+2OBHvxIXej4GBWq/jUyJPsdYET8NuQG/WYgrv2h+K7+9RLw/6EKSv6L5Xb83Tbq/t0mMvxHRUj8lMOu+uG4AP+THNb7FpKS/yEl+vss8mD43cNu8BHEMPw8pvz8BuJO9Qe6Xv7o5IED5oi0/KRbCPwwpKL/+ixG/XY0eP2YuOj8+asW+KTafv4MsE0At8ne/6+XAPyc0zb+ML2+/QA8rvwzBtT9KVIg+98Y+v4MMw76k56U/M5llPz4VhT6Nwo6/FcErvlNzrj8IpbG/uxvPP3FXkD9StTA/kN2iPvDQ5j1mSYa/RVHyP3tkuT5Ktcw9vRsGPnXsAz/iYAQ/J2/eP26x4r4yzZw+/3ZnPoZve77J2sI/UttLP8L0oT/M9sc9HlgmPyUucD8oW7O/NUctvyC9E752mri+IA4IPruBBT/RZKG+R9fuvi+q3L6sPfS/kz1Cvymy2D77c18/XGsYvwL+bD6dJGQ/A3ghv2I7jb/r/Hi/eePxv/bMkT7NVXs/PBc+PtpRiT9cAQ++BJtEPi1tJ7y7clm+pwdZP52oKr/vcca+lcZMv7sbRD73Zyg/fG3vPrpiwj9kjRW9dEpvP9t00b+smJO/jvhlP855E78JphW/HHxwvxbeCb0kUAxA5YqHPwtesr7UF5M/rhB+PqYEST866Ho9mJJWQIgSoj9xM2E/mfZoPjGAWT7JDl2+opWbv6crjD+IOb+9AlS3PUMWHr+YAE4/HrTXPrQHwD+jBKi/27WAvliRkb4Y38K+gZ9ZP1h8jj80h5W+ktYyvnlglT91Qs8/LKUwvy7bjT5IpzNAdg1yv4dbFj4nsys84kn5vXG9UL4kNYU+WuiKPik3lz8n8qK/QwdoPzOWmj92hZ8/hNgoPcHJ8j7vMpw/aHY+PvCMFj8B4E6/QFMBPq/u/L5t2/k+yNmePoYyRD/qXKW/iKULQL8yGj/yBfO+R2eeP86sPT6E9y6/Wjzmv/8Kkr8opJg+",
            "+WGiv9Con70F7s2/XCWGvRALyL23EY8+Q476v2eVQr+cYCw/RR83vmM8Lz9sTC8+QXTuvkEUmb7cWNK/ely1vrycvr/XRcm/xOswv72FSL+e+X0/lrxZvesD9j9ybXu/uNJPv87D4b7MzxVADlOQv5AxkL8OwUI9yKfQPpTf4r75xNc/J2YzwAo6k75E934/oGWYP6MTYz9RL5q/5TJOvqtjOD+Z95O/pAFGP8F+I7/gNxA/bNBWQF5YXj9+H5Q/4JLVPr5rpT6/38e+BpJ/PwdyAD8inrm+BJbIP7wiK7+ntBU/hkjaPyATEj/mXO29pIczPwDi677HilI/q2KnP4HaJ78MwKE/MzBsvzfSwT3CVoY/lVMFvtXyNz+i7dK96mezPsmNAj/tpcQ/zniUP8/2Wr86PMi/Yfb2vmwUI76xO3Q+1InYvzGFfL7+mAo/52MZv+Q0t75IWGy/qxixPQ+gfT932g2/2MWzPbN1h7+8GJS/wTThv4CUlj3HtX6/wjquvuqXBL/eFkM/uNoHP/uS+z7ZEcQ+QCRAP0NdWT/HJio9qMJiP73JIL+rhaQ7Puv1P7G7FT8J92m/rLQWv6Ni6b+Y7Rk/SCTVP0Jyqr9Vjj2/K0hHv2PKQD8xD92+5MoPQCx5qD5d/U8/BqwtvxcMGr0rXxc/ZS0UPxaLBb/BvpU/XHZRP737+r49wjU+3ICSP4i5Xr+rPiY/iKXFP8PXR7+788e/fwN0v0CGYz5SzZ6/2nPkPHJJr78QNik/XXOMPsFShT8goWQ/yffWP0Vgub+i8Y6/OnnevujRnz10wx4/IuuDvQbj+L+/d8a+UnFyvorgAb9JWWm9h2UEP9ayEr/t1349Io2Qvwr7Kz+FZtU/DBkrv7T+7r6qAcW/IWmxvwV6Xz5zWZm/os8cQGInxT84O0A/QSB6v6hBCj9Gh0K9tfQSvwWz2j9oERVAPa2DP/LZnL78moO/vrKlPhGl6D4BKSLA8KBov5zloD+z9TK/UtOMP8an2D+mKju+",
            "jPGIP6/Yoj3Rt1G/lo0vv5K2hD4FlCW9BitSvzIrbT/v4yS8GOx1vshd/D1ivhPAARLIPsxyJj8IXIU/rbokPk6EVr+0dyW/vnKAv33vDj+yxlI/ShzgPjKmQb9yzbK/tHP1vYCrQb8pzgBAZoMKP29ejL+PM5s/owWevx1xQT/JKiY+0DL2vUCaQ79H56G9LXUeuhdSE79kxjw+BSbDvi5Eo72jxWI/BP0Yv4jJx7/16gtAIooUPwpv0r8lNuk+ojSsPz3z4r4MVzo/JixJP/c5JT67HhhAWIOYP04wWT/G6gU/x0frPHFcj75Nl98+g+4MvrYbJb8oJyW/9U6svg9lhT9tpq2/BORtP3QlPj8ORRc/OIkxPkkkIz/h84a/8mILP7gyh79i/dQ/tbYFv8sv7b5hVjE+toobPnUumT4+1Ik9lRytvmqLAsBtxCw/d2F3vq0Rx7wr8zM/+mS+udBvSz7RiMy9wQR+PzEIlz95lV0/+Tmhv6GK0z5RKQg+XKUyv8nKAT9Ivc2+rvKQv/MFnb+BKL4+bxG4vUf0Dr8hJpA+4HQePy7KEL+beoa+CFfPPg1AjTySAxA8PQE1v385i7/6aYq+Klbcvu0qJr++0I0/EMHcPrFoV78SNJm8aqJ1v6fetj9qw+m/W1s5vpXSCr9CL0k+jfyyPqXCCMCCfAK/uIqbPxs6cr8IRUS/JPffv+UtGj+WXqG+HIYEv90jKD7WwVa/9+avv8aIKz8/TLY+pT1lP6czqz45CGG/mWfkv486i77O1xY+6YfdvdnW3L9TODi/lwYDv7Igcj4fc5Q/wDSdPyjXvbzhJci/79qdPz5dGb81NwI/We2Ku2zmPD9Oz7q/LY8RwO8yur/3eae+0cyWvurL9r7+vDY/2q+7P5CMhr/rqyC/mM/4vw5HSr7TthS/t9O9vgLFEsCThio/2zacvwQ8D7+5f4k/Ce2gvY0mD7/qxzu/Q1hNvzV4j7/kQLq/gCKAPgNAlb/Vf88+UItjPySYWb+B62w/",
            "vF6gvSN6iT4nAbw/TjRxvxbwZL8JQnE/ElA7v54sJT9VCKI+ulShv0fnhb/2rj87GoYkvs8xIr+tWm29Y+OCv7w+Kr9APhM/vTInv+faWj9Si1m/VxcEvxtxzL3jlPe/8wsAwH4Xxj7Cd6a+muZkPcduej+cZ8K+2SKYv8h9G79FBZ0/I9IavclRdL9wcfO+uX7xv/rhlL43iD49JQ1HP08kDT+vo6E8rgcuv9sVGb6UxrM9wkI6vyU6Sb2tYGK/3fnIvxX9i78H14Q+iOEoPpE/B79MaZc/vW4lv0K9kr94wx8+qzpoPwcOeL6bRJU/u3AWv/Hck7kTRsC9YLhaP5Da4b/3Of49C87FvwTxm7/pqyo/hB3GvqOMaD60eCu+nXlTP1dY0761pVA+/4AqP9/klj8="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            361
          ],
          "values": [
            "AAAAAAAAAAAAAAAAAAAAAIOZHgsAAAAAAAAAAAAAAACwkBkGiZwZCgAAAAAAAAAAAAAAAAAAAABtXpYAAAAAAAAAAAAAAAAAAAAAAAAAAAB5BK8QAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAEA0wgkAAAAAGMqdDgAAAAAAAAAAAAAAAAAAAAAAAAAAfK+NCZVJJgUAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAABQeagExPkjDQAAAAAAAAAAAAAAAERJjwWgBA4GAAAAAAAAAADoCEcDyvRhAwAAAACzDMAX1rSEFgAAAABTHAYGAAAAAAAAAACFBhsaFgaLAwAAAAAAAAAAAAAAAJBg4Q4AAAAAAAAAAPZvtgIFVQcNAAAAALGmAhIAAAAAAAAAAAAAAAA49dUEzDCKFALBQggAAAAA1B3kCsc/yxvUc4MDCYN1BwAAAAAAAAAAAAAAALtTlQZXr5QbAAAAAHPFcBZy91QBAAAAAAAAAAAAAAAAOBiGCgAAAAAYLuQGxlEYDQAAAACLMR8OAAAAAAAAAADGRIoI7h71Cfe8kAF4j4MEcquJGAAAAADTugIFXm+pFayWrxRvlCcTYB66EgAAAADExLkQAAAAAC3P+AJrTfwBCz5CAgAAAAA6anUJHStnEIxE2QkmtawBAAAAABY3fgccZuQPyBctDEZp8yZdK4cR+xoSLgAAAAAAAAAAAAAAAAAAAAAAAAAAxBvjBu43kgcqgj4dSF3FEw11swymVPMD2UMHKQC1piGN1goUrTY6J7l1WwI+OroPXIXDDwAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAsZxIEAAAAAAFvgQrN3wEExTAkIjmMKBZWrxIhu6RlDOsNDgIAAAAABNf+LkbHwRDyYc8KAAAAADjvZwEAAAAAAAAAAAAAAAByXi8SbCRHCdy8FAJPugEBAAAAAELXPA5aTdkPztURJew+5Aw96RocIPCTHgAAAAAAAAAAOX/vE8H2jAcAAAAA",
            "AAAAAAAAAAA0mbsG7JrVAlj9Ph7nPbIWAAAAAKGAJgxOvYci/A+HA647Ixqckecc2OX4G5+0hwyrNT4fAAAAAEDf4gIAAAAAAAAAAAAAAADxrIwAbqoaDgAAAADa6eQHESMHFPsiTyjPTLQJGTCzCcQBrAZR+EQc/LrPF8L6nArWvVIYiAcuDgAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAC5o9EAKW5pHs4AiAk5AY0blAqzE7vWbgSXiJQTH1FqEQAAAAB2sdoWAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAQD0QAwAAAAAAAAAA2xlxBXQtIwExGh8Jy9S3AwAAAAAAAAAAAAAAAEkgCgEAAAAAAAAAAAAAAADTCAMCAAAAAAAAAAAAAAAAAAAAAKDgYwHYTQ0Fqu+nBNT/Kiy7vi4Rpl0ML2UdJggMNkgKSsgTGRgJ1xzvfHkNAAAAAAAAAAAAAAAAAAAAAAAAAACQnqQDAAAAAD957g1y00QdMgCUD/9anA0HPRgHKBEHDYK3tiNACygnB1MtEaOH2RntHusCWKMHBVWDHgoAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAgHxwO2pcaAr2rpwLeqj8FvxzGJQAAAACsCQcSgymeAAAAgD9LhworKVFiEHNtvAZLcCUPAAAAAIeupg4AAAAAAAAAAAAAAAAAAAAAAAAAAPyIgxLeX1sKvon0IWAhnR0HagAtU3dgFUSzBBicLLUJ600ALJg+BigcTLwNAAAAAAAAAAC9g3IHL0KdENSUOwkAAAAAAAAAAKnxuBMabSAOjXrSAQAAAAA3I6YNAAAAADRjARcAAAAAIR1XMDNuQQIAAAAAAAAAAB10cg+hIIgHAAAAAA=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "batch_normalization_1": {
      "beta": [
        "RaejPr+uWj1AphI+dD6bO6RBTz50pqY9X9h3PSbhpTyKbac8WZecPpPRbj0/eQI+r91YPRLnRr04vi6+MSKTPQ=="
      ],
      "gamma": [
        "IFVxPyxOhD9tQVY/XhxnP5ASfT9ozIA/EdhvP/J0hj9+KYc/cuNsPx2YXj/uEHo/rBGBP5DFjj9Nz4Q/67aCPw=="
      ],
      "moving_mean": [
        "A5EQPqXWRz2ryhU+FV71PUURAD07uya9h03OPZa0mLtHYlY9BQWAvevjID3hYvs9HwICPpOpzb2APzO+yVTxvQ=="
      ],
      "moving_variance": [
        "i/ykPG/iEz2bESw8UyaaPI8vtzya/Zc8GnGZPDD53zypUZ084IgNPcmehTx9s9E8+mmWPPjU8Tz/Hec8SFjTPA=="
      ]
    },
    "batch_normalization_2": {
      "beta": [
        "OBFpPlgA/7x7lQy88iIcPhsruz3JsQU9Zs/BPUwr/zyfM9W9j7bWPJy8jj104FI9jjHiPWhQsz2lil29USGoPVa2CT0iTxG8BETHvIWNTr0+ot89UvmePfZmEz22so07+GWOPeF5JT50VEC9iUjsPZHdDD7mrVK9TMEivdTfPT4="
      ],
      "gamma": [
        "kJ9dP+XAfT8sEnE/QJF9P3lLjD9BcXA/R22EP8m+aj9mvIE/D+eEP3gIfz9FMV4/TglxP9CUaT/Lxok/qbqKP77klD9uxos/zLyTP3t9eD8cj3E/a/6AP2E+fj9ko4Q/vh9/P9z4bz+hjIM/wSmFP78BcT8T+4w/abp9P9T5dj8="
      ],
      "moving_mean": [
        "JEGzPkgYT7zGadK8SYgVPh3Dr76JBzU9D2w1vq0UyD4f6q+8L3lqvp8/nL7BTTQ+lP/SvULJvz7HCdG+4K6dvumRGL9gkZO+ybLevq3Ztz2cZqi+aWcyvr+f/L1E8+e+04R9PQt4hr1Dao++csQKvtrgKz2NeZi+g/eHPo09RD0="
      ],
      "moving_variance": [
        "HpMYP8NyJT9nOCs/bR0KPyAOcj9UfB8/9ys1P3CZFz/2yyI/NjMjPz4fGz/MqRk/IvgjP8sN7z7xyz0/hL+OP1F1pD90l1M/YbZdP1FqOj/2lig/D1smP0Y8GT+Fn2k/kELxPsfIDz++0WQ//ydJP+KcKj+S4ko/7/ZLP/F2FD8="
      ]
    },
    "batch_normalization_3": {
      "beta": [
        "DWGCvTVLyLxNfeu9PBGavET88L3xXLe9XfAcvYN0xb1XOhg8cuaxvUjFFLxrlae9Ee4evXlBO7xHBbe704F9vdbHvr1AWoG9WRv0vSZL9ryV+J29uTR/vduNC7w6otW9wK3EvS00nr2TAZA8XQkCveyF3r3NF7q9VTQEvmtJ8L2lhA6+o4Z7vdqVYr2XnbK8wfsIvgr8BL5D7ru9iajcvHzXtj1BFva9hAoRvSatGb5J2cy9zNm5vUb0jb0ooPS9oS0fvI3uZ7oHlXS9LdFpvTqji71ReI08PNOzvVXTcrzo+cc7h0cRvUSIc72hSj+9MkWLvTytG73Ym4695Hm7vQ=="
      ],
      "gamma": [
        "TUZ1P0bBgT9sHYg/Ee1/P3dSfz+RCYE/mg14P0Avgj+UFHE/w3aDP2b6gT8CXYM/dr57PxBcgj/Vin4/Cbl4P2wgez8vroY/fa+EP27khT8lxIE/gx6BP6jvez/ni3s/a855PxZGfj8BiHU/92h8P328fT9PR4A/iTGEP2NohD+8Sog/31t6P2bqfT8c6YI/bD2JP+Nngj/a1oI/3rZ5P1OCgT8L/4Q/qwV9P8g7fT/RRYg/v+x+PzZsfz82x4U/XHFuP1dGez8VTXs/Dbd/Pxi9cj9AXHg/w5N7P+XHcj+zI3g/tmKCPyM+ez8uzHw/WPaEP21yhz+uI4U/X7qEPw=="
      ],
      "moving_mean": [
        "0AP6vM0sL76KVyA+GorovXkvOr5iVVi+5H/8ve+nVb5p5Zk9uhyKvvzkHT0jkXG++QoSvjfeK74NELq+AtnjPTHnvL11v+W9rhtGvmw5W74b1KC9FBg4vi75E76iWou8YIt1vtTjeb78ooq+7poRPstQar5dRcs97yCgvja5Hzx6mOS8YYFovkmetr7hTKK+dwOzvBolhL6/oo6+MwB1PfNwjb5M5LW+aC+uPLfd3r7gS2W9BK0zvkDoCD21ERW+/owmvhnEAr1WOce9HO5hvvdMK77u8mS+dyQjvmPjbj6FMEW+Sqq7voF3YT2Oi8C9igviPKYKs7yqfg++y/+evg=="
      ],
      "moving_variance": [
        "XxdIPz9gYj9XNk0/G7pGP3bZTz+mp1c/HG06P60WZT8gxVA/C71DP6+jVD9S0Ew/1sUxPxI/ZD/aBks/oztdP7/bSj9qJUs/O91lPxPzRj9ylFU/iBNBPzABLz+TXk0/PkxJPzjiQz9++jw/qXAzP9vtWT/N/0s/NyJKP24RMj/lsFw/QIBcP7KvRD/pPkw/GTpbPzFVYD8PQls/8D49P6YUWT8phnY//VlEP45cTD9Tk14/pcxAP1EJOj+nKzw/abg6P3D9SD+QWUo/X95KP9ZtNz8sKj0/1O47PxE/XD/BNT0/EiZPP4qIMT/VaE8/ClleP/gTVj8puFM/EKFIPw=="
      ]
    },
    "batch_normalization_4": {
      "beta": [
        "O5jGPWwUVzw6Avw9bhuVvO1Kej115qs8ZgeOveGolD2M0Mw8N/MnPf9nYT2XcqA9ySS0PbnrNz6k/ss9uQYsPS85hz3tsM49+IaMPQ2dIjw49ca7wqJ1vBwEGzzBsiY+VcYiPY9TID4Gsmc9M7xmPR+w3zxSAKg9qIjavd2Kmz1Y0ZY9nSWAPdmVOT1r6sM9+LKfPZfWzz21rNA9kWWcvCG3lb05beg9g/f6PcFC9z2uA6I8Tqgivcdshz3ia/Q9oqixPe1MRT27u8I8BY0yPcwv+z1MIvU92rGqPSKEGD0UiF49iqj8OsMVED6KXIo991uePZZ6+j11Jou9/XHyPQ=="
      ],
      "gamma": [
        "MzbKP9eeyD+22cQ/TFnDPxURyz+/htU/RATBP7e2xj+AocM/kjLKP1XMzD9P78U/1KfNPxDGxz/7QMg/4dfKP35Fxz/rKcM//1THPx3owz8OY9A/gmPGP7SRxj/t0cU/RJPNPxzpxT9UMs4/GzTIP8blxD8bL8A/VNLEP9zbwz8CfMg/xIXDP6Kawj96qMQ/t3TJP3N+vD8m2Mg/Nx3GP2TSyz/X1MU/0R3BPxkHvj/7/MQ/mWXIPwYVyT9e08g/vM/JP6NOyD92w8Y/UAi/P4kDyT9nML0/iMnEP8xPyT9eQ8c/DlHKPy7UxD+hEMU/94XFP/K0xD8kLMY/ZRzKPw=="
      ],
      "moving_mean": [
        "/8oRvs7el70QbCo9PyrwvN01G71ySgq+F6eSvNJ+WbzkZhW86SSKPahj7L3+GDe9VwlQvQxskr3fk/69X55rPdTkDj13fis9xcoOvqRiWL1d3Js8k0m6PfgZG73/hS69uCbfOk4A4r3T5BO+H6r0PDM/Eb6xvIE9IXO/PSXdkr1M8WK9ZGzyPEXmHT0JphS9frObvT3x/Tscui69k3Q4PbcQqL16/JM9lXMkviZqF75m2ae8mdGdPOfojrw2TOS93w+hvcSnqr0fypM8Jv18vQojlb1i8ZA9/E8CvNBYBL6k2K89UVMNveu6sL1wLd86gVPAvWADJj2WBLc85vIRvA=="
      ],
      "moving_variance": [
        "E5JDP1VyKj+jdSU/j0YbP6cWMT/uVkA/NlsSPzkRFz97gCU/vBgcP5yjGD/NSRw/3WVDP9W9ID/u5x4/MvYnPxnPHz9jDx8/PCIgP2XfIj9dhzw/8EMgP4+7ID9c4yI/2t8mP/xzKD/fejY//sIpP6vKJD+X1yQ/ZgckP5UHLD/DrTA/K1onP0/AFj/uEy4/xTovP8U6Pz/voB4/iCBJP3ORIT8qASA/jS8gP7+bIz9r9xA//UA4P/t7KT/f4h8/SQIlPw6qIz+suTY/DxccP+Y+Gj+Vyyc/3WMvP17PKj/O4zE/gC0yP7KmHD8kGzs/J70kP/auKD8eMTg/ON4tPw=="
      ]
    },
    "conv2d_1": {
      "bias": [
        "zvTSO9LX0j1tUuY7updKvRQG0zvqz1q9JfKJvJR/H70XA2A9zn0fPQl4XbyWY0S8wTS+vKZQC71uhYS82NWzuw=="
      ],
      "weights": [
        "5xiHvIUfYj1joTU9ZSC4PSrLv70BagQ+gWBwPQ+qjr4xrL89pKSovv7PEr6waL08lH4iPEDRtzvGs4Y9sgXkvX43Aj0ks4+9IZ+QvW3Xtj5LLqy9U1AWPTYQRj1poOY9/hcIvv+PUTxUHRW8EfJkPTbS7bxNZ+A9MCYCvY5D5z32ph++JtJfPBWfeD4OgOA9g4r2PEAn5zzhMD09mXSXvRmnKT569FI77kflPCTWez3VeHe+FURmPfPGGb0KuKW8mrXvvcixoD6foQA+r/5HuwMMS75u3NK861GHvXzF7z0u9QC99tgwPt3trLxZJgY+Rb2rPT/vJL7m3AQ+ccsevgEaID5YwFq9hZZTPDYTt75BmBG+NEIaPjUsIr4W0xI93YGIvB4g9bx4QM47frzcvWEr471nTvY8eocSvtxZQj5e+xA+FLuKPGSYGz1iDL69WnwmPhnKAL5PVHc9q2gxvkwXL70rpHU+83SdPZ25OL0iiBg83KsSPSBfHz5wWkq8go3OvKdMRb0r/w892jopvpVuub26/JO7YzgQvetTVLzI/NC7pTuMPVapir3E+TA94ahLPVcGbb6uLqo7cjMbvulGvT3EY5U9ClL4vrdmG71LWM+9f+y+PlouDT15Y8S9pGQSvk3KVr0ukSa9lx0yPX6ZP74oAk49bLPAvZqiMT4gVh49d78rvpUcRj1tL6e9AeBevWGEz7wN14u9R7Yqvssx27yYthK+pZWZvaVOLT4C5ga9fnq+vSCxBD6HmyO+yOt7PgwSEb2lVcC70caHvoeWzb1+0k08CLMbPV07Sb18sY29PewiviE6vD48GBE+VA4vvmGYWD4Vinm+kWm8Pk2ceDz3Kby9pzyJPrw0g70fKq891wMrPpETo72l2kS96nBqvYbCGD5XzA++1J0Xvjf3Nj4CK/i97fK5Pd1SRD1AT4q9z4H2PSOSjb0ue8w9zbGuvXDXlL34Fk0+swt4vdkj2r1QZ2W9SNb3va2msz70Jwc9QYQ/vgnJUr3jaW29",
        "f1YZPtf03L0ZERg+/XZBPEqeOb6yG/Y9XKUSvtOngj77zeo9/QhSvof+iz6I0Iu8pEutvrCs7T00VVe9WqG+vcLMTjy9fq88xguBvZpG0L22TCc+xdI2uzbnCj5w+OI8VnhAvjdGmT7l8Ty9dXGDva7q270dZZi9m1gJvOInob2UfY29Q9LCveytvz21FK+9yS4svVlETj4rau09KU4ovaGKBj4lyMG6TRaKPY4kEr6vGIm8A+9uPPkeyjwVZyC+DqxZvNPQyTx1nWq9LYElPPCGtz0FWwo+3++rPJczfr5uqR8+BvqVvkKBoz20PMo9iMdkvU0yLj5B8F++8tBHverz6j05esK9U4fmPKg1rj1rFsC8mUugvciBGj76+Qw+d6mZvhQckL3qGKe9aE7zPVF2njxh8fs9pXMpPBFulbx1HJ69wJi6vRUnmj12iJC9xBG3PX5FVL0DxwQ+xeM5vmXMpT3PHl286kc/PaY/mz0KXde966k+PXe8Vz0XOlW+plQhPeT6MT1wehS+crP8PBQh9D1AE+Y9tKFgvb4HRLymogE+/xq6PTa10z1uXeQ9q6M1Pt2VjLsC66W9o+urPDnzhb5db+W7+WkZPc6Wsr3Kc5Q9urRQviXPS70lIEy9wGtSvY7Uyjz8Vbi9osoPPtN6rTwI+Kc9hXkdPca2EL1y6fK9kooCvV0/lj74XMg9guskvsZbsj2yTiG9IRG4PUSJ0bsVg36++REovmnbaT0j9Xk83ZALPqoOr75tV7G9TouXvOK6lLzyJfU8pzBIPZcvTzwsB9M8kdaWPgf8wT3/F9I92+oPPqVrDL0kGOw96HcHvS5Xcj6a2KQ996QHPlkAF75eFdg9yhZqvXtl0rxA7oW8d74tvo8nBj0NiYe9FxwtPphpFr3y62E+Yf2uvTSMtLwmOgu+sXbIvd7717zbACm+8llQPg0hSrvmvJG8CpvyuEUwW7sRkI48ehp7PIBnJ74QyFc+oxmfvbs+m734Baq9w3k/ughGhL7bVDK+",
        "K9bmPhBMjb3xOKi9G00cPoC3rL0YCPI9Zw/XvbqEBjzguFY+X7Z1PS8tM74iZKE9HzH0vbseXj4RGrC9nFUePQydsT0EyBa9nYoCvaqrsrwOPrq83QZlPV43BT0+1Xm9ADPGurIB+r3Q6oy7GCxavKGIjLs0rg++xTKdPloPlL01jK098cBBvgwjPLzd7Hg9gRWXvbu8Bz38igS+YrsXPBIcmL0OuxY9rIHjPSiayb6hURy5TVA7vnibVb3rjlQ89tCQvP/qu73aAmM+a/yBusbGYD2Kr0C+O60YPbbNWDyztDs9F7XUPVtdQr6+KpG91/REPql64D2jPDw8NY0mPqqJxbwaz8C94w8zvSpOSz1znze+0DQrPCAKOr10Cuc9LU93PYhiCj1tN409KovSvRm3tT3rSGA8UDLrPBwPXT1806A9qau5PCL6Iz3hjlO9ain9PWKULr6Ng7294loePkAher4kNUA+g8XFvU4VWT1dMUO+ejlHPviaGr43lVg+FijJvWu/gT0huOq8VmX2PQp9z7w30IY9PQYFvu19kD4Bd4g8lFHuvUjhDr5u1a09eXsgvXD7Uz24diY9vjK+PZdLSz2WJ4G+E02qvYzhRz6EMoW9RUvyPZCGAr6utlA8C7DFvHoZNr1PzNE9ABPMvQst0719dGA+l01AvXTkPj6sn5++oRYsPYPu2z0aTdG9UuXTPdUdqL66INi947O0PkKhKT78YPA96o6jvkoAzbtakgk+IzzfPZBHUj1O+uy9EIzGPKc5zz1iHIO91d2KPN79g72dJOs86jCuvV7O3b0ODIu74baDvi7oT71uLvU8irAGvqWLqru/PMQ9uYsdPZAI2r3L3PO9QuGJPYD3JL6h7Vs9ftUpvpsaaj5rQCY8fSXkvXDZL77kCiM+0aCGPaTuar2u+ro+464sPbG1bb5Wfz4++1I0PKYEUL2/0YO9CR4dPgTnAL5Br7m78ITlPTGpPDyM1qQ96BMgPdaJUT3HmbO9VEPVuqzlAr7XpGi8",
        "QlioPPHDhr60res88152vZem9L3amDy8wrSgPOocMz1vuJi95FQpvvZvIb0hzKC8ooqPPQdCvbxDiiO96n8GPmbJC748I909diQwvjJiET4rjkG9dmouPXWbALyOcKy98uikvaiT5TzFXlW9fEbAve/FUD5lGjI+9rHnPYbBvb5ac9i8dA28POjtor3+iC88KGeLPVg+9jxJukq9xB/jvENTnrzSx1E9sLT4PHKyG77a8Mu8FORGPfN8Ab4ENdK9EVWYPsitwDxjk7S8BY/OPeyrU72sNHU9iiOfvI/Iaz2VG2A7+EBRvauCPj2YHpy9lensPSzpcr65ez686b7BPZCpQb2E/tM89IMavhLW4728/hc+nnmuvbXrJz2BAVo9hgMIPkfSYL7nQG69625iPZNnxD2YEag98YcjvvYrhr0iw7c8QZosPtfrMj3/Gg4+298RPqw+lDzeT4M8bdWyPQNAEL5P0j09eWDKPNQhGj60uxE8oXpdPryIuD1JfwW9Z0CDPfth67we2Tw+XDYePjgNiz2gc7u94QPMvMTVEz6V4s89qSaAPDSpgrz5C2G9WkyEPqSpN70cjau8MkagPSvwHjxYeOi8cmdFvK/HVTswoKk9t6gHvgH5wT5aKgC+XkvIPZ1NLb6pyFQ9Hk1KvrRuND4JNNu9jah4PgKw6b1cBmI+qkacvQ+MZL38YyY+/xu0vc7RwD3qVqm9OUplPXuxX74534s8ls7TvPOdE759bvs8EP4jvnghkj3h5zG9"
      ]
    },
    "conv2d_2": {
      "bias": [
        "iVxVPRxBD71kcZk9Vz6mPSgexrxP4kG9cmpzPaHnhr2Iz6s8gxCKPZVT3r3NFrg9Gw2YPUXdk703sNK7fVUevQ=="
      ],
      "weights": [
        "9trYvHScuD1GRiq+z7dXO+Zp8zsiTQS+KzU1PbZLxT2RnZu9Wp8dvTNBsrt5QQS9WXBnPT9zPL1FsCi7VdL4PelJA76EisA9v8ZIPVN6D7q2Dr43v/2KveQFnLxdBo49aPCNvG6gnTzyOvo8dUN1Oh/YT75cT0e9DFU3vcYjnb021FE8/MaBPRa72L0/m5495BXXPNccibzjpQ68MjSwvAdcgT1h0gg9lZWIvd7bar1digM+cuemPBFdqL2yr7g8NBpBPS/93r3P/Z66eKv2vW0z0L0Ruok8g4OpPQ6EFz4hCNU8qAh+vVRfgj3OVRK+iUjRvaz0orzcvtW8V6dAvDI1bb5QNo69+JcevnD9oj1ULzm9kcLuPVKUKr3TUNK7+hmZPQ6Qxj3gdKW8S+0PvfXjIb6f8GS+nx8VPAThID56wRK+1AXUvOJCo72XAsY9pRyWPTtdLD1aD2G+ldYeOWAGIj3FmOS9RrNcva5kEb3bDeC9agsHPUOtV72u6Zi9M+jWu2c+WT3KeIC9ff2APVucCb6OikW85OaIPD8dgrwJTCu9n92Fvd27gr3iV+k8JYYQvcLTrj1oc2Y9CQxIvoYlEj43Yok+/34HPs56mj3A9uM9e7uFvWQvjzsdur090TsHPltZJ7zdKxM+vpeDvTQDmD18ieg9xSshPluQlD5qR+O8DFEwvbWV+zry94087R71PXDADL0mi8Q9bmd9uwu3UD7w5AC9iTRDvQYPur0UBle92oN1POWsWz308DY+Xl2APOaDe7597Ts+uow9vTnJOj1bvxK9tLhzPfCLDb7tEwg+V3ANusfDaT3gkpu9C2CcPD3kwzpCuQc84ysiPMwbXb0S5Ss9dRORPOno+j1ur3K964UIvVT7eLz2g0Q99eJPPQm+Cz2GEig7X03gvcvr5bzdI8o6/V/TveNPlD3HkES+06XjPOn5fT0G/Na9Lm2MPT4FSb7vvBA8AM8TPSlOhT4KY4c9vQfXPYRhiL1AvXw+cJrBvaFLuD3tas29",
        "ZrMGvfaiDD3yxTa95hVXvlV40buZklA9GHxKPeYL6z11omG9o7aUvZCRpL2P0he9wJSfvckkHj5C2ZK9ByVNvezLzD2WLEM8mBV3PB6B4Dwfi4U9pO16PA+C/rypRrs8uSiFPS69rjt9wCS+6P1zvt0SEr3FeoQ9PLM6vZoOubxlDJ++ZM+KPWDqxbtxXFi+pT68PffjGL6OXH09uLDyPU7mBj5OgFq9fZKJPZcCY74x/jU+4vfOvZQUwrwrGuC9M3uhvGWexT0FEca9EoIcPu4ND73M6t+8Wsg/vWDDN7yPgvQ7sIPUPNIBmL2Evg49W/+FPadiyb1OrZG9H9asPXsrv7srEdY8QwSIPDtpyD35+Wa+3iWNPYobETxxCIw9dm+CvDSoWz2d+OO9xX+SvS7oAL7ScZw6xpvWvW6kqDzjAty9hJxTvpjlSz21UKe9BhHSPdV1Er2tCaI9nuDevIOjJD5ijBg+51iNvDnlkb7p9Z49UIkNvmk6Ob23hIe9QZGbPTkZhbxcp1m81wJGPgAevLtbaq69JMYfPigBbT12xre8CQzzPK2Jnz1HFuK9GVwyPqxZ8L22FEK+s/mOPtafgzwIUUc92iozPVdDsDuz+to7Wr+8Pelryj1dhtW8KYLRPVGcnj3hFJK8YDtZvbIhnbx5/x+98fFVvhDtgL2zx1w8+1PrO4zVbj2Nu/y7n5CnPdEy3j0gsAg9FlHKvRRLFT5TboO9OuUQPCs3ab2EX6w8nwWTvR5ajLwUOmE9HYqtPpyoyD2ktb49/hT3PfyRRz1ic3K+pD22PcyLKL5BKM09w7aAvvsFE71qRhO+vpUgPqgu/T3tj7s9FkYQvjCEebx+qQa9Crocvrbu1DxYFoE+29KQvYZnR74bsYS976QoPscMJb49JBE7GxzYvMbbFr5mree7C2ffvfy/DTomfVg7RI3KvKXVHLzlsY89DSsAvZNXr71tJeM8FRnPPeKo+DzV7i49wnIbvO4/lL1vGgK+ILHuvWexYr3mh4K8",
        "4YmovYYWsL0qeZo9Jd6PPjtKw7y4qeq9Y7OxvMoTyT1nc5M9LfsfPQuIlT3PP7i969bRvS0OSb10Jfw8n5VRurquG77a+a099h6jvYjExz1BkKs95Z0BugAcxzygKek8oH84PQTxfz3gKfE7zfokvWn57r3bvvQ80SwWPMLULj5bTS8+tt/YO8nf6jz1pRK9K3baujhfmr0ZGGu8Ot7tvQ45oD0utQ2+kJNNvW3SXDvz3vM8j0OyPbRccz3Ec0+99Ww7PbCdnz2FrHy+0XiMPZPvEL577PA8goMkPo9FoL20omI+1JIIPnC1DL64+Rk+fBqbvearOz1ZTHK+f6cavX0LUzxd1lw+kJdUvXM2ZbyjDj4+uECovKFpkj0owFm9unsWPcTg6z3Jq/A7BHFDPPQlGL5bZVk+xtymvWc0MD0mAJM9JG4SPh7zhb4zX5w9NSIvPkw/Tz6HpxO84XssvZRYWD0KtIE+tw+/ul1d2T3rHxy91J4CPj4OGr6U97a9jLsYPgKBezwiCEi8WzSCvYuyjj0jsck9kzPcO+lnAb6HTEQ8OmYWvtoysz3gZAA+c9vKPdBE7z1P6hS+kJ3CvC4yWr3GrNE9WSKbvfoamj1IRCo9XRVKvdaT07yGHkY8P47mvTdmNT1GR4C9rojYPZKkRr2prBo9MmbKvTgoyD1htgO7gRK2vEE7qb1fPBa+KXuuPYY0Qb7zed89LcwIPtAt7jxqGKC9sVIzPfFyNT1PJI+9j7mhPMzz4j1ypXW79JoKPiEbHj4zgZG9fFD4vStdeL2UPw6+aqxDPQf7ujsyYl89NOODPU5bCb7Sl2Y+cnOxPJntzD04O0Q7vnQlvZXqAr4riCK9d02dvQgVq73Tl4k9fT5uPeEaPz0F0OU8zs5+Ovt7pTr6Fki+zJodPnXCnLxejds94hHGPK1GAD4r2qc8trnTPEEw47wJbVq9DW57PT8JfD2S8cG9CF9BvUVsnDzVCZm7Jy7SPRWa8T1djUM9GyWxPbEm2L0/mM47",
        "G0ooPTPzNT53GLa9Dx+MvVMPMDyMJOG8gF5LvbPXGL4u0li8eeIvvWTmAT0Wlis+GBDzvWhuQT64RtU9taYDvWSJGb6Mozk+o8qfO0CeCT4SJTW+0WGKvdy4Mr3VUMU82ZXrPQqMmT0uEbo8JAliPhTJIDxmlDq+0GwGvvNYjz1cYIY9SP4YPXXuv728ipA+m65yPdlUQL04+lA9fe0lvo2PFD6xaI880XC7PRZrDT2uTPg8PxvsPbKURD2H69W76T/4PVR9xbmEd8E887etvczqWDy9XFs9+mybvU1tiD1YQ2+9hZshPtCI/T0izyS9BsyMvFfR2LwD8iq9qMEVvv5zIT6uCug9D1MSvjjsFD5K/lM9sAYGvtt4Jb46Owg+1v7LPeWhqb1AjZq8PmEcPq4/3z18t4y8xcrcvZZvv7xK6Gy90OQ7PKgJB74d39480iH+PGNmLT7Vd529BvzXveNElz3wLzc6IUguPLBdPD1QkZG970v+PX7LdTwf7AU+t+jFPfVTDL6sGjy+9y4aPnZFor0631O+f50JvFUs5T31OLQ9GYX6va8sOj3EoTk91+tRPB2ey71U6608/EKgPTwbm706qSw9UywDvuOy7L1OCGC6Mj1fvQ7rA71YVmK9THWDvBPjMr4pte48OeFSvV62iT3we+29XPgVvMpczbxEdp69hQrJve/uV7x3brA9D/LvvQTucT1TbMc9j269vJ55kL2OTgQ9ExePPQLq9T0nxle9y+l8POFwAz6BJK+9qXQmPCCPobytVBo89K2WPEa8EL3EeI+9+d8QvHXVOrxj/ki9Y2K7PQhYnjyTAka8030XPeujtzxPlg29buiFuw8GGj1m6WO9E/3xPRWZH70dp009Ye4ovTsjfLsGTjK9DegovQAXMj1jJX09KFRhPWfAsrwU9Ce+Bk8PPU6USb2wiCM9PgTkPQvZc72osp09v8VOvX1gxb1Uuoo9udCtvXGjsL0Rfsk9rduJvQvwLD3H/9E96JhmPdE4sjxt0bU8",
        "wrqiPDDScz2JvZk9uCtLPTL+ELzqOPM7qVDwPUjD7D3Aujo+OH8KPXbm/T32zDe9sKFJviVvxDtmljM9AC8FvT4Xq7yZ6CK+Ypk0PnSxCb4jx+Y9oSqAPeiNaT7bPw++pN1RPeQHWrxNYb09Pd8JPoIx/b2IKC++Pm6kvR591r0amJo954yFvc6hvjzV9ck8RfMvPcsGTD7ERMI9KEoAvizKAD1ywvS9eKVCvUeQ9Lw9AjK9r7gcPXbQvL3QKaO8URzJPckkgT3aZTu9bPX/vIt1ID7I9B6+ia23PXMyVj56E8g8V1LPPYnlp7uHCIy9L3cLPjp3Cz6PPVa+b5wku8zgIDy18lk9SzqTvUY/Q76u7Zk+x6hoPaJvGb1hj5k9GWHevUvswL2pOVE9QEJnvfXPTzyLT0y9BK8Hvs4DYL7nfRE+ko9PPXjQL74IIxU+IHStPdimTT2BdBg87Ex6PgU0v72UVk08wPUIPT8YBLuLqoG9BE2YPTk1HL4X7ZA9eOgGvsrXqT3bF389lh/HPb08Xz1227w9s9yHvaLSRD2M5349Sl5GvIchCTygOtG9+KfLvZ7H7zxEX629lol+PX5B/D1V+bS9iR1jPDrHQT73l1C+TLIYvaJXR72cGM699wqpPhiaazyrmAm+n4TxPZMR3D05rnc+VjyKvGgOGz5Ik609D/AOvce9EL1sS7C8WMPXPZ2Ud72Zhry9WRtlPdIZvj2g1kM9psLpPMDQvb0cDSG9r0vTOPMDuLyr99Y9y+XFvHQwiL2QG4u7+rz6PX04yj3DVZA9SCvQvYrhhTslSuM97PigPdtVPL15aRu9/92sPYd6871k6AM8atv7PY+hwbyrBBo+e3T2vaip1L3X+kO+4zHaPEQ3QTwu+BG+sYGKPqFfPz5iJzq9SDR1PAzYAz5GNsA+Nj2bvU1/MT7eK6e9JGKQvW63CT40gqi82d6XPPaWtL2n37E8tg5WPZheRD44PBg9Q6wwPibDwL1us5s9aogevmG/qj0aHgi+",
        "oB8fPLheHTxb7Vs872AjvgWKVzkyy0W8/XB5PZKO/7yRdAq8T6pbvRlpuz28VL+8QNEavqoFYz2JnJ89XZgevoI4wzy1rjQ+tNICvDGI/j2mWha+wBE7vG5MiL3RQ5e8dZ62PXHxLj0c1O48Y0StvJzy8T2W/PU9WXnFvAhshTwsKjS9o1S7PM/qBbypZea7TTHZPGNtvTwcU3E9w78OvsicKD3FKsW9rnievXktur0TEbc9GBXgPH0jqL3AbHW9Fjnbvb37Rj2ysri9lV4HvnKb4r1ynrS9LJjlvRtapb1JEz8+L69evDKHa7xAIaq9CQUkPtAoyj3uS009kQOPverEirz4JeU9QWjsPXkqVDzWjoK9C5uPvZNMLj2nLSK99ks0PVlnkbwmh9s8L0ckPQVwxb0Vp1I9tSQzPqsYa73UaHg8sY74u5sbij0TbZG9RhpEvTseXj0xnyi9SA3HvbvZkrw9lmo9ANouvat/8j1JvYG9Y74nvXJpGj4aTZo87gK5vn7b3T3cLKo9VslkvobIQr0JEOS9DFYYvDNX3jyPNi49LQ5OPoYzAL5UbO29dcnRPskBaj40IGy9e2UnvpS6OTyr7ps92oZePXrOb7sDepA9XwndvQIt4LwrHES9JNkZPRkK871VW+C9wwVOPNOX5b1WyCq6/2A5vZzdgzxk8qi88mimvSWB4r33vT29juQbPtT9gbwmLaI8kWKOvW6Lkz0Wja+94onFvchpMbwi9kY8tZtdPXA7mTxDfOO91P0xvvudJT7ihqA8EnIWvoY54b0oG1a9znvCvbW3CT7y7HI+WnQEPQUr1byUJyq+EPs2Phgg6L3hNvM7pR6qvBCT9DzO14K9j+URPglRxzwp+4O9jM2GvIqcgT2q7J+9jnPivMi1qz1YvLK9AI+HvOuuQr1pgEA92YyUvXJCNL563au8zIL3PFFZGz3i4yE9kcCvPTYSkj195Ku9ub8MPU4mBj3eQ448UAKdPSAyXL2Kqjw9bqgBPJVAqr2V15Y9",
        "Cyl/Pbvs2z37kou9XlYxPlUSwj1+CPC8iJ3lvSL8QT3ZYuU9qbJYvexbWbwetza9rskQPdHIBz7u/Au9IcBAPXf+zT3Ay3o9dScDPmRh3jxiip4+2obhu7f7lTyza389x8sevk3fC761QI08oQcGvrQD4TzXoK69RV1RvnU/Mz1hraA9r70WPqgtCL4ZUAA+5BBYvXGIcD0vG0G9l4tZPSbCT71HMMQ940UiPsVSg7u83zu7huGhPAX0fLz1blQ6VwRCvpkhoT00csg9dcOPPU2vwLzrvA48QLO9vYg8Pr1SQwi9x/sMPcox1L0Jyfm965AMveZcK74ZE/g9x8FdvJPknDyoSCO7j5WZPjdfqD0csJU+dxIfPW29Cz64QqO9iZDaveDy/b2N6Aw+Madrvtjndj1YZR++0ZiGPWkvrDw5k6i9UAyXvUwgRj7RnrQ9VN0dPVNtvrw7TA++ccMXPU5hXDxAgZm9Dbf3vLoqir6ql4m9NKwAvuxb5zwFoaS9S4zhPYXLlDxnoYs89wMRPj2wNL2c2FI9Ec0/OniRkL2bAJk9CFbRuxr4BzwaZjs9g7rHPMhAnb1U/SK8l86UPNFT+DxZD7i9Q8VEPiKVGr2d2XI9lCn0PFy437xLAW69LjO7PLV0dr0KmYM9kDr3vB039b0zora9Prg/PZY9Zrwg2QI9oV/kPHkpj7vpUYA9kbWyvU6kMj2Uw6u85KIevc5WgT2pObW50EkVvXkNKz0QxBW8EBsMvPk9R7zNukM99lxGPq7hJLuqzg655hFUvRbFqb1+Ulo90kZtPYTPYzyFAH29YPvpvF6UMj5eWQi9kVoQPrYAED6sxSA+qh4AvAwZKT2FnMo8byqVPQzuC75jVpi9YH7MPesTiT1cvwo9IeYFvb1Xcb1Uc10+3AaEvbhwRL6sYtA9eg7DPX0yBz0SShg+H7L/va3eE73tfOe9XxTzvUDRwDxgPw28QOIBvvs+qL2TRXG8fYq4PdkSQT5vQ3c9gMR8PXaNTT10rkA9",
