{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              19,
              19,
              3
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_1"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_1",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_2"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_2",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_2"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_3"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_3",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_3"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ],
              [
                "batch_normalization_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_4"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_4",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_4"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_4"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_5",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_5"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_5",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_5"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ],
              [
                "batch_normalization_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_2"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_5"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_6"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_6",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_6"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_6",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_6"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_7",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_7"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_7",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_7"
        },
        {
          "class_name": "Concatenate",
          "config": {
            "axis": -1,
            "name": "concatenate_3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ],
              [
                "batch_normalization_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "concatenate_3"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_7",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "concatenate_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_7"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "noise_shape": null,
            "rate": 0.4,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 2,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              1
            ],
            "name": "conv2d_8",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_8"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_8",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_8"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.30000001192092896,
            "name": "leaky_re_lu_8",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_8"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "noise_shape": null,
            "rate": 0.3,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_2"
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "flatten_1"
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "softmax",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "name": "dense_1",
            "trainable": true,
            "units": 361,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "flatten_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dense_1"
        }
      ],
      "name": "policy",
      "output_layers": [
        [
          "dense_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.2"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      19,
      19,
      3
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            19,
            19,
            3
          ],
          "values": [
            "9U8bPhiU3j9z06u+u+nXPpRzJT/E8s++VYV9PhpAyr6K9G0/Bz7vPq5gXL8l5lG/R6V5v002oD3vTZG/u3nFPq3NET1wDeM+D7yov/qolL9ml9I/iKblvykv5T47/tA/uyB8P0Wzh74aWnu/Pz5fvyV+vT/Yeq6987eAP/4tir/v0ow8a62sPS1UIr5OqTQ/fTBjP/x2SL97OkY/qwkPwIPUKL9wnY++LRS3vRUXlD9scpO/UWYOPzj8Sj+xj9g+dxnLP02H0z5Hx6c/pG8zvwAkcj93sSk+p7+mv571Fr+d03E/63aAPum1l7+IRK0+g2T8Pt/puD/+xAi/gIAbv+scSrzRN9g/Hg5DPTgr+D+keTw8M+eavuvez72B3DQ/C1L2v5+RAMCfRqc/4WboP9onzjwXPZo/vY5kvjet9z7uSXY8wAx7P3JHnj5qUBTAiqIrPzwMDT8d5ec+ZO8NPtDHgz+soEi/I3SpP8YeG7/itvg+RGO6v034n7/Q9oW/Y8E5vdwryL9o8kI/32AFP255J7/aSD++82aQvzcil77CQUm/7Yu4vtETDj/2/x6/7zLbvlp43D5XoJo/FMO0vuEAOj3oRjg/MTmZvl+Ju76cwci/wByNP7I+lb+Qlng/aqTuPSGOIT92dwU/xdjEP914QsBZ2/8+QMSOPwbsZT/q8V2933IXQPWarb+tu/i+x2gBPjY9WL+b6Vm//8j+PHU2wz1pzAW/KZHaPwee178FQCbAXtOsvwk3cr/+A7e+dYMKQM1Kgz+QOJA/MbxgPtTFKz97UJw/qx2xvS1KWj7PxQe/pyj5P4bcHr0XnZc/hJEkv1xBhz/0O0e/rs+KvF7ILT9Ubiy9ARGmP7NxnD8z5x4/x/sXv6UsCz985N8+QRVSP8Yrbz+hLRO/+xV0vhqCDL8c0LM+WhmXvzmn4L9IazVALEbQP9HLG725buI+NvwQP2DQ0j8USxLAceSPvQw5rT9Ghda/F8nhP20xhr+x6yQ/0f2dPkwy1r8tiY6+",
            "ZgORvjUDkL6+w4I+4kkjvnvkSryfTy2/oYp3vrX3DL9LlVu9N1qSP3GLLL9Mbbc+OkcRv2co1b5zxoq+mvEQv3+6NL98ohk/aw5rP/TBYL9U0l+/UevZvvbYZL+713K+AXMEPtFUzTzng6I92RGZP7kMd751jYc/LS5SPlEKwT/rFe4+l70HwDfaIEA+Io2/t5dCv7AZAMDDBKq/WMIZP/sUbz78isG+A+kTvyEjjD8TVfa/S0MbQMEQsb73QrS/JtAcvymsVT9I6Y2/FdRqv0LEsr+Ro0o/fActP+X7ZD8Y8zO/MeC6v6IJVL/SOro/rTx3vtwW2L7e4jLAwI0/v/edg7+JFbO/Q3ahv67g/b6dSOU+jgidv3s2UTynRJg/kAeDPxO4tD8OIE++rj85P6W8iD3tJUy/lVfNvrEagT/9WNi+fV51PxAclz6s0Xw/NIT6v81lQb9Z8P0+MGlNv4Kr5r+5d7K/eI5PP7ESBb9P3fw+93Y7Paj6Er5d+wM//eRmv0+hgT0ADhy/xaIYP24xnT1UTCK/SjF9vtuhkj9ipxi/yYu2v/OgHsAhzBQ+YSJzPpm5hT9r+gXAj+qoP1vCjD+15Ju+oFctQAPUsbwNyZ0+4tyIvC+lbD4SbUo/b2XCPwYx6T54k0jAiQDMPjBRqT954Vc/ew4eP4zmxD67oBY/BXl6vRYsAT9/+KW/VCaCPsk90L74ICg/TuAqP82WeT6CHdU/MIJgPwvtEL/A5D/Aws4pvwqNhT+PUgo/swDhPz8ZjT4rM5i/wX8yP/HzB0A0eIC/O/bLP5prID+mWRO9hOzrP1d3tb8hLZ6/0euMvkVxRL+ymjW+OeYLQCLcU79seW+/7xSJPaO2CT4f5RRAYwdgv/TAtD/jeOC+pS4Bv6lr3z6Zj2A/z/5RP4N9JcD00AM/xIL8v86NCEAqIi0/QBpXP9B5DL1jdOS/1IrGvu+Dmr0Dko4/IOTTPnf90T8Ihoi/m7s2v2JbwTzIfgdAHX+OvlfLgj7h1pY/",
            "f4DrPrbxkb5lh2u+bg6aPhZ/CMCrWKi/kMGhPvnWLD89aKG/wSnFv01TlD/Z/Zu/tgtTPQM5aj+jZXg/ikHZPg3ktb6cPxy/oCETQM8uH8DUUnM/7TGoP4nkcb9vpHW+al8cv7x4+z8v4NS+KNe6P/xTaDzqiaK/JQwWPwH4OD867Ac9TudQP5nxir7QR/m+JNtnv8ecg774P+I+WzIYv6rfFD9Tn/u8Ou41wAki9z4y0yu/GvfMPnk25D6towS/p76kP5rpDD8ugi+90KfJvwMGxbwR5fK/YDJiPx27pz+LFNo7/zOCuwbo/T6Jfc4/KNl6P8jkND7d8L4+hU3lP2Jddz6shBe/rM2XPZezhr9p562+GKQBP6P4iT3wLC6/qE7DPRYgNr8HmkO/T3/rPmWnLT+1khy9ywzFP5hohT+ucfi8k8novSvAgr94w5M/BwU3Pswphb8sKHS+2ioLQHyyCj8xwl4/PwCsPsX0kT+P7Uc/9Ky8Pko7tr+EYdM/ysN5v3La9r4Runy+wEKQv2rUgT+eMae/rxFGPkTgtr/5l5m/B7/hPsPclD8CT0w/d0SHP5a4bj95WbO/DpArv5abDT8HbpC/WKZXvhwGJD/UPho/JMiSPwbZLD/2yw+/CACkv/2dB7/KAf8+hyHxPRLNMz68iak8LVpKP/M5gL88J/Q/JvUtvy5ZXL8I5JE+/FY9Pgma/D3CxQK/TwcVvu5Z7r/eCxNAPmbKvzeg5T4VNWG+r7mMPXRRRz8ZK10/MoVpv4Ay7b6pEVw/pW6AP7WlyT5XfIu+ee9OvEv9nz9H3dm94aG/v1iSfb230rg/6YNwv3OlZD+pY0C/rOpCPqsUqjoFaE4/h7nGPw+Q9j5vjYq/rpobPW3cOj4nh1S/7aYOv0Mthr7s/Oy/duRhPwPtkL/xk7a/WBBfP+p3Hz60qEg/kx+Pv9Qdjj9c/CC/dBcPPwd5tr/1DGQ/OQ41v/GId797dPE+tREKwLbNxL5i//8+wRQYv3qTiT8oAcs9",
            "+o+bPi29Cj//pia/xTAkP4Go6Tz/rrO/k0MTvzKBgD7U6qm/iaacP3r+yD2wadW9mF6fPsKSwL3Ep/29TZTvP9NSCj8hyDk/sGexv/4COT1W4YC/coq9P82pBj9uzxu/jV6HP25TEL9mpDC+4NS/v/x1Yj6113g/N8OgP2iWAr99XXg/YiMavlPzh79pMOA/WQFbv+ocyL56BYW/4GfsPu2NnD6eC12/jiWAvdVTeb/fB5m/QvX3Psn7FL9pkPq/EOmDPvdgDT7iDpe/KZG7vg9BNUCDD2U+/21yv7eXxD+x3xc9JWcTwPMSj79u1zQ+6eoVP+85ur4W8IG/14FJvwRP4T6bM0a+2X/4PsQ6F8CsUXC84bouP2pb7b6KyDu+0205P1XLzr+9YX0/HtrYP65ylb4Vo6c+1yckP7LI1r+k+Pe/xD9wPya1RD8pnN2+FbAEv4lvzT+IQUa/JxC+vfpG+D5cSLG+KDX+v5iIM0DyBdC80lpHvzHT3z6yuie/7BbovBoOsz+pkDE/SlzXvS7HiD/LqMu9+QC6vcClSL2xqMe+zOuzPwq1eb2aYBa+QxSuPmz4qj+dt8a/QVxjP2Omtz84LRbAq6Duv+pwOz7Hm1C/YdZVvl43gT8qN6y/6HYWwNMjlT/XSbo+ttLBPHynWr1kbnm/1De4P1TpqL7R8kw9Cg7RP6asDL8MMkDAnZxJP14F1z6O6qK+LP/iv0UhQ74xwY28Ce5qv2JbFT9NwBK/WKiqvyUx3b8Xwak+yqPOvt3BYbzqECXAThUrv4ELMMCFS6u9PJ03P38Mqj6D0MO/6dfQv0NYBEBYk9O+C5vpP6tfGsCzPg6+Q1aaP9l0RcA81li/1TSPvvr7q799RG6/uOmYPkPcfz6qKS0/afTLvoEgUT7+giw/ILqhv33wnj4l3bK/p7ESP/pNjz/E2x+/ACcQQJyPlr6pIyRA77UBP1FTk7+bvca/APYkPuP67j7trQy/+GKhPb+AkL9y2Yw/XT7aP9XQnD0AQd8+",
            "14SQP+HRm77bp9C/NOvJPq+ej7/CXXY+L8ACP7iUVD/SMYe80NVwv02GIj+Us8o+tReQP9NvDEBnfWU/WOEiv9yxqL97G5A+JLpPP/yzED/vuxq9hivQPrusbD9ow9e+jIHTvaV+wz6hERA+bvXAvyYYAb8EJLo/99zVvw5adD+I+5O//OQSPOTnmT7Hp3Y/ASbCP/zZpL+l8UM/avvFP/h8pj/Qa3q+yJiYv4TxM0CN8x4/ET6HvFvQDz/aWaa+4RWHP2cS4T9Y+L8/307APyJ2or/a9QhAAZypv5gvGD9qFsW9PRVNPy8nq75BQMQ/I453v6YFMj+UY0M+vlz3vuZQPUAFfwO/rTfwP9v/jj81g/g/hXV8vvyFYz9SMfM+G96Iv2B3YL7WgUQ/L1bFvoODlL/aMA4/Ac4SPwJGhr7Nb209yK+XPsnZcj/LLoG/e1EFv8AtEkA+MfK+8y7rO4qdv7+4ecs+56JXPSiJKD/FuXm+4MEdP6M2IbyRZKA/GTfSPw0OxT9IbdK/kDU9QBEx6T7qpim+SP52v7ogBkB6+EG/fisIP3hs8r/ltam+vc3QPTVq/j93eCa/snMYPtu6/7928j++P51ovy/TPz9UCai/4BBZPsFZtr6gbo0/fHYbvz4L1j4870q/YBoyv9wzG8BjOvc97jhJv6LeoD70HKy+aiQ6v7OALz/8Od4/Vu4Lvz6zVL676+A/5MrHPvK8jr7o7/s+lnzhvzf9ib+Yzp2/DkFnP205hL1JjVI+tZWCP8Q2tj9JzZe/COKePtvHsb+EN0K8vG4FQHVHvb4Ctbi+63cYwLKwYD+W8UG/SxSevphRDT+7gtW/XsgLPx+uvrzCN/Q+zSNOP9ZNCr8kGAu/rV4Mv/rlHD/vfc+/dMp2P+BeNT9L8AzAQhYewIiYpT3A/h6/PhUZPycAaL/CYV68t5eKvwtc2L/ZMna/p+Tsvz6FPDxdvVw/vOXKv4p7mj/uXly/fUyNv/nyrD/tHCM/ANh/v+Ghtj/6jye9",
            "t108PKw5377cA0U/LIGMPj44uD7/ACg/AvxxP2wOFj6ip/i/Ch0LP1nifD/wgca/IuFHwLafXj9SLjS+xEALQNu0876B0Es/3guAP8GnOT+N69Y+aSmFPJp3IEAO/k0+EulbP1iIkz9A6dO/NAuVv90QCb9JvZk/07y1voJBqL9z5hu+NANsP0w59j9Ra/u/CKFmv3PZeb80YaM/LUqTvj3H8r37IcY+9x3ZPpiLyL/IOES+ecexPzCY477Eqw1AholPv6bsJj/Asbw/B/+JP1dvIT8NVRY99ZMIv3lxcz+nHHm/iXoKP0KFdL9b9NY+9KkZP/bMm79X1EC+kLPHv7RbSz+X0r2/5qZ4vwUel73Q+Sq/L4JOP9eNBb6z4ca/O8Ofvl/87T5JdVa/GSqqPsAhtD9Yb7I+88kpv0UNwD8fLKw+7DGMP7GU/j4rXvg+TTXWP187gj5lKDvAlvGqP0uRjr4VqRC/X6nMv3vSlL8Gpxq8fvpNPHd8Cz+Iza6/J7V2PpWvMz+hoEI/vk8Lv4vYpr8Rg4S/HOgwPb+HWD3me3Q+Adf7vo+j1T6fkKA/Y8yjP85Io7+cxqw/88ycv1HYoT5oOBTAf5csPWh5Or6d4X+/nbKhO15fGb8KlZY/IS/Gv6jtlj5gEtY/"
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1,
            1,
            361
          ],
          "values": [
            "dquINGfDCTfzloYygu6bOxwuCzBFDyQ6gMdAOnFnXyQ3BYA6BLHNPEulpi8ldwY0ZFbVK0U+BjpNBCYx+S2RKmJJvi1Njgs7/IvkJhM4RTU0CtE4js9iNbRFujtaPBUvSp7GIFvDHyP/06cp51jTO2jr8CXMdAgrkfUHIdC2PCoCzHYtmmwRLljK+jL/C6k0839cL0exnih5iQ0wKesGPMP9xjd0NQM8Zr6XJFFSpSjCgUYo8tFyIwi7lDWtfBgmo3FHHFZc7RzWOpYoaAP4Hp+7fCfr5r8lHRaLK0k9eCg3aZorvq8fNGdtsD357IA35uIrOf9lyCTvgjcUAizFGKLFlBm+ZY0fMutwIFuVUhWcQqIXPDiHG9GKByBy4cEpnN60JAXRFCFHCdEmiZpFKPmW5TizuA8802n9MIO3JyxNr+8hnXoBFHU5FxSHZgoWtOHXGrYWQyFyISgYGZTaFKiMNxVGVFQa0Q0VGYnlyR7hqGEod5kGLb9XZS59eLU3tdrQOfB5Xy+z+oUg95s9HGpY3xpK2gsPYTkGFeRmFRL//TEfVc8+E+5uahIIVY4UTq9mEGVd0RU3kA0rWDwHHuQl7DEudh42FN+OMeg51TBE5XEpEBjxHMCsyw18lUYRPfZaEI+fUA+Ff44OckJzG6m2kwr8o5UNLOlmD7p98g/o8N4WSp8fHmU6oSQ/xgobQRJXKXlH/zS1sTMmwZiOG7CD/hL3eFARGCMjEe1nMw+U/pIJyABxDygq9hGb+coQRAhJCgYeGw+FodAPRXOUD/4HLhFPHbUXLvrWIAWs0C2y+4ItVq0kLbungihIdgAUK6YIECV6IAu6ByULoc4bEDC4iRN7PNkRMJY/D9GR7g+izRUPjCnTESJAJQ5cx4wVwLnDFAflfRzo1hEq8xsdOgYgKyuOfmYijGXcGpnTFQ4bnJcOCwmFEiItdg1a1F8TeyAlLY50lQ5RzMAOI2MJDU/B6xPGuRgaO96zEmvobR1C9g8d/mYRKiAihCyHqxwp",
            "40v2IiZFWhog8zUSstpBEQnHLQ9ngN4NWWftEuCl5A7QiLMPjSohFOPkUQ9mstkOu3+hGCojCRiMGJ0jd2cBJv3FQB4VtkYxu20KK2IOcy4jf+glnpBXEZPaTRYipL0O3ZlDDyUvtBMKKDIixUyrF1y52g5yEhITsGx8D15DgxSTHc0Un882Hn9+BCZ46sMviP4VO6+JozPYiuor8pTLIkllzRf4x/QPTpGBE3aZehLcajQSGWpsFovvgRYl7bkSO14GFb6nxhNaCPoVxO4/G4cRDS8uVps6D0I7OFa2zjN1NSQrieWEMJ29QByeC/MRxn9AFXuKGA3AwiMO/d/KD+yGxh70yjIVmieiEQfuOw+klf4P9WoeFGMLxBdHDcgheOAINtCP9jfwgPs0E2bVOJb44y3T5tMiU2jEE6XuOhbNTAsPWvCwEUzTsxVmp4sVT4PvFf7WlhdvjhsXXJHcGH2KphzREjIa87MBKEy6WCZZQ84uH9VDP98IizEVToYuZMgjJ5omnyqw5rgcb6fnHhOaXhTMRRgXAl7mHSGYwReQYQoXCYw7HaG5HRmTQa0aMwtQJkMGfSCbydY6wIvTMNXW4jbu6l84nwI5OS9c9TAMrbQpRnaTI8TcQx+OZ/AdMbH+HmwD3Rx7F3ggRQ4rIlWfrxa6pG4eOyiGH/HN8Cwuw1AmrWgvLfOMZzC3uLotMOjPMsj+OzCh7aUzF75yNNF5nSQrtu0ZccPqI23Ivxahr9Uju7BqJ1VouSTGFSIdmxSKIJ1A/yoUSxgtdzipMULIVDH869IyedAaMUahAjy3fhc2+kQ5PSC2Ci9n5Ww47HspJ2dgiDyUqf8tDR8wL8/nYy5LrPw0+DiIL/i+3y2GdOs0/gUbNLDFCS+vNoM0TpG/MA=="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "batch_normalization_1": {
      "beta": [
        "zDFDPauSmT2h2Bw+YKyAPZlMcb19+1g+viLTvZkqM76vNwm+nrbOvW4ijryufxk7T4rBvfKtwr2huHq9QBebPdRw0r1+m/i9YIeTvRC9OL3yU+y9cTzdvWEBsTw9KAq9fXE9ved1LD3+Mr89CvatPPxpAL7Lorq9UA0ZPkTUub0="
      ],
      "gamma": [
        "eHd/P3sDgz+wPIY/sUKBP5Oafz+80Is/hSSEPyRegT9lO3Q/ZIqAP8RagD/XjYE/sxCBP9R9bj+qP4c/GomAP4yohT/Rn4A/mvpsPyAoez8OrII/efVrP7Jpcj/xZHo/FSmIP1SCej+0hXk/bNKGPycBfD/23oE/tXB4P36reT8="
      ],
      "moving_mean": [
        "iikYPdX2Eb7S/gw+SK13PWad6r3lP2m+HmwEPrLDJL6zsE68OZWQvAnjLDzEM5A9yaSjPXiuFL0cSVU9hL15PE13Ib04xQE+6CQgvKABr71RES2+g9pNu0iNp7zQ5Jg9MQPjvBOpRb3JdBI+RN1HPrxOdbxjZ5g8UX6bPY9VWj0="
      ],
      "moving_variance": [
        "dcv6O4auPT0elCQ9La20O59+oTxlzkA94GunPE1EAT3vLbA7lKj8OwqNDjx3iSI8tTsyPEOp8Tt/B2E8ESknPF2i2DtXHLM89xhfPJRTHzxBqgY9iBTqOxaUKzxIBII8Zb0oPE6aAjyit4o8TK5BPWJL9DupO7g7048qPHkxTjw="
      ]
    },
    "batch_normalization_2": {
      "beta": [
        "Q8yAPWrLTLyN+5W9AwAuvss05L1OQOm9ElD+vYNb4j2qyx2+Hg+2vYa5Or7V4xG+fuwmvu+L4TxY3b6+xRkzvqf8jr40CMY8fZ0/vaFURr0xY5a+g/UUvh0X2b29bwo+bWxoPabmjL4JQka+ICX7vYZFCL7yIsS+NRtLvmaxlr4="
      ],
      "gamma": [
        "Co9iP+0FZT8K034/X9qOP+m2cD/Ou3A/xEFlP60TZz9L/YA/Jd19Pz8zhj/NwHw/RPlrP57QgT9wC4I/m+F6Pzwbiz/hh3k/6bp8P9lKhT/6DI4/2RVpPwowfD+v4nU/bbV4P5L5hj9kYn0/TeqOP+B8bj+PMII//CN6Pz64jT8="
      ],
      "moving_mean": [
        "oN91PJhTrr7Q6Ys97/wHv9nfa74r8ZC9Ih6gPqLbtj4b6R2+Ot6LP2KVwr6IUg++gwWHvseO475oyS6+Ipp4vv0uq75JD4E+FqR2PTrvP754WSa/4IOPPouNAD/b+WQ+bCDNPvMQEb4jADY+HdsGvxudTb48XRq+UrdHvuq0/74="
      ],
      "moving_variance": [
        "s/NFP3VB6z6qk3I/LbpVP9g7ND+BtNw+MZkaP0eMQz8hhzA/65VnPyelKj9xEyk/P3LKPjtEnD94siw/l2BSP/o5Kj9s41o/alxFP/f0fD9ljas/QGAJP8Aqaz8xz5o/64SBP9O+LD+xjFc/zqezPw45oj6Noyc/zlMPP0qvrT8="
      ]
    },
    "batch_normalization_3": {
      "beta": [
        "zTgdvkKByb4DQWq+3OdGv8GQF77MdpW975hJvYplF7/Lg62+e1BOPe2Clr43uz2+FnY1viu3376Mdsm+dNjAvXpHHr6SBKa+CEGmvTbh0r51QG+9D68wvejtPD7+2Zq+1/dMPSS9WL02AQG/PygAvkEiWb4JC6Q7GF0OPflIrLw="
      ],
      "gamma": [
        "1LtYP33RcT/GY1o/cGSKP2YSbT8M2l0/rVVkP5NFkj/khmM/Z2VWP6SHaz91gHA/pYJZP5I/gT8OwZE/8vZhP/qWdD+m33Q/4wZsP9WFkD9yJVw/wTBmP4c2hT8bx3I/wRN3PztiYj97cZg/g/hfP4g1Zj/8Nk8/NkJdP8G9ZT8="
      ],
      "moving_mean": [
        "MRSzvEkGFD45pq4+Xwo3PBNUHj+kx3q+s+sQP+zcxb6aB0i+cfIePuGOeL4XZaC94xj2PoRlpD6dMI6+fy4LPr9MJL6h04e+oQ9zPgaiFr79lWG+HQalPgOaJb9BhpY9o6T4PRuEFz9Ul0W+W53uPL+9nbweOwU/I8E1PUuoBT8="
      ],
      "moving_variance": [
        "kIwVPw+Kwj7s+f4+wjMCP2M9QD92T0k/qT+APzpLLT9u2LM+dOeGPzOhYj/aXxA/2/PpPukjoz5fJ2U/pxycP9giKz8ulN0+tqvkPr+FDT/Pd8U+V7goP3N9AECw7KQ+nwLMPpGADD8EWVo/MxWCPyYS+j4umfg+khojP0HCDD8="
      ]
    },
    "batch_normalization_4": {
      "beta": [
        "Hvs/vouBR71xT4299fxAvkCAXT0JTC+9WNgFPZ7A4b0MiHy9nC4ZvjPbDjwhoFI8/OZmvAtOmr6a85m+rrqLvFsXor35D429h0d+vusPJ76jYx89MUx6PXrflr7xJP6+8erAvs4COL6mvOG+nA23vl5hk75az5a7g3e9vpGhrr4="
      ],
      "gamma": [
        "gVZtPz2ngz8pLHE/bnpzPzT0VT/XSVo/rjl1P8lNcz/hG2s/kAxwPxYIcz9CD24/Eot/P3lYhz+oEoQ/3AqCPxffbj9YO4M/fgCFP3k/hD8TBoA/G5V4P0qFaT/gNYM/ZPGIP0sKiD/Cu4A/ubJ8P2LSbz9/R4Y/ht6bPxDZcz8="
      ],
      "moving_mean": [
        "9qvIvO/9cb5FWHA+izFFvONm2D4BR0w+O0KuvUbX5j4X/xo+OM/yPO/HZL1j+EM9C9NFvvmRUT59Qtu9KDqcvfBfbb5OMyQ+6DfCviH4C71wLT89j9y7vIyTmL7oV7O9VNQdPPzPJ77klvk8QUGPvAgjhz7qN4u+kTbhPWa/DL8="
      ],
      "moving_variance": [
        "3bw8PmOtGz+10Ok+twChPtKM3D7e5wg/FAPCPgv6QT8hrb8+IGygPs8J/j5Pyuw+O+/1PhMyvT5SItI+yk+9PrzA0j51HsM+LMMqPyxhDj/xIZ8+4Hv6PuZOYT6dyMA+g2COPv6HzT5eQaQ+y/ZhPiPD/T4rXyM/ZBo5P5+Dgz4="
      ]
    },
    "batch_normalization_5": {
      "beta": [
        "JxKDvm3sGr7TnD49Ua9xvgS1OL08qtW+dkxMvi/YNb+4CXm+1sMrvUmZGL/rpGA9506kvd2lUb7vJ/o9tXcqvV2sgr4BMig90BiXPEfSbr6cK5A7wZOnvvXDTrxynJa9UAfxvvF9hL4xV1O//WlBvkoVIb6Tleq+fDD4vsvSdL4="
      ],
      "gamma": [
        "4nRkP9MPbT9T62M/T8V+P81Lcj+WyYA/iIx9PxLxgD/q5nM/ryt9P8Ypfj8bkHk/XBlkP9Kxfj/X7Gs/0mmCP7BtYD8LwGI/3+OFP4F8aT+jvWQ/XEZ8Pwo1Yz+Ub3Q/rpFsPzAYcD+Wu58/GDV7P1q+Yz+x224/cBOFP1xbXj8="
      ],
      "moving_mean": [
        "BjiLPqxdnT6xI3g8RC4HPi/KA7/2o429GItBvmKv3D5CiLC9+mA1vjXdnD7XSuO9M+4rvmMCar63cPu+Rc2mvpTKGD5kzho9/JD2vqj1PT9u97O+eZdTPTZJQ77hSda9zhAEPLhgJ76LlKI+4NAGviig5zxxwAo7K7EPvsBXS70="
      ],
      "moving_variance": [
        "5M8lP1DFxD4z9Qc/f9VAP3ZSpT42/b8+2BwHP95KWz6r/tc+GhLiPnPsVT7OgKo+L87RPpr/Ej9U/gk/2ixFP3w9wz61JdU+4uUXP9dnnz71gOg+fVqLPuYrzz7rlwE/qCqePk55BT8CReU+Ow8AP3hngD+yAYU+tIr6Pu4tGT8="
      ]
    },
    "batch_normalization_6": {
      "beta": [
        "VQSJvIh5yj2y5oa+Kqbfvt7xsL7Ck76+jz67PRZZg75g6cq+TX5BvuoJNb4ijUW+PuKavOyYZL4yJ2I9mJLhvY1y5L7H9TG+0sciv5oWIL+ykQy/q+qGvt6l3b5yeqq+Q+btO4xbQ75134e+KNbJvjyTHb+CMYw9ltw7PdqQ2L4="
      ],
      "gamma": [
        "Tw1oPzoNgz9N6nM/b/9xP+4qcD8T124/rNxtPxTGfT/+W3c/Zt9bP7pEgj8Y0WI/O1N/P0dYWj8/sWs/gC9+P8s3bz+fXIE/s3ZkP9q5mj/hbGg/Jf9vP41Ndz9AeoY/HZptPxw2bj8XrJY/guN5P5NZkT+oWoI/YGNzP3INgj8="
      ],
      "moving_mean": [
        "qt2vPdXW9T6Lmlm+zNbLO7aFij0dPm89BgM8Pq0MGz6PdA0/2tzyvYKVlz4Z2sG+uM7TPubHqLy3yku7EQGQvdPFTr6MfaE+e99PvWutL71K6EM+1fDcO4h3mz70YkE+QiJUvvbxqz1BFbu90bFpPaLuCD7c/jY9d12SPA8TOz4="
      ],
      "moving_variance": [
        "DO65PnYLQD/jMdA+/SXmPgyc2T6owzA/pD+UPt5H6D6rXd0+o2/DPmn+ED8Y/8M+v0zpPnjuyj4nM8g+6VWkPqJsND/CQxY/ddr+PrnPKD/qCbQ+TkMFP6xMrj4VQBA/yxXsPuuu7z7ovf4+CVffPp3TDj+QmBI/BlUuPyipBz8="
      ]
    },
    "batch_normalization_7": {
      "beta": [
        "wi0pvfl7MD0kWSa+FG6aPCIDmb77i72+eHCDvtJ8ur4uc4U9A+kDPiUgq70sX8K+wW2hvqDxvjwzvFg92Y43vgHQKL35P/g8p820voSOjb5k9xg92OcRvCgVv752C6K+irgXPlhQGz4VCwq9su2lvucjyT1UwrC+C59MPVpdXzo="
      ],
      "gamma": [
        "NMx2P3Rsjj8Oqlk/GTReP9lYdD9ZH48/WsKfP7jEiD+gZGI/mWJwP5hzcz9aR5A/KnGRP5Fcbz+7aXY/lv11P2S8cj+SaYs/z7qFP0g3gT+XSWQ/U5heP23PgD8LZoM/i2iEP2kEhj+Jjmk/G9eTPwEncD++/nk/T2ljPzUYZD8="
      ],
      "moving_mean": [
        "+7BTvn6/XL6fZQy+3NaXvlGvO70bnWW+0FkPvpRNLb7Eb9q92qYSvnhpBr5u0Ni96M7DvaI0a74yj1m+157JvQ5ma77feJS+R/zrvfaTK70t8TW+Yk8rviPtrr1DOGy94uc/vr6xP77PyUq+1+U1vqx9F77NwuS9fUZavqxeQL4="
      ],
      "moving_variance": [
        "4rtdPt7ERj7+DH0+1rc9PsaC7D4hVLM+luXPPj4vmj643Uk+dxtCPlq2YT5tvrI+qYuwPnwXZz7Uf2A+1vaOPpNHdz61GHs+qSysPhjXuT643l0+4AdoPuNhnD7ngK4+qYlsPjEMhT4Pg2c+TJXXPn1zZT6Cca0+WndgPpCQST4="
      ]
    },
    "batch_normalization_8": {
      "beta": [
        "/UkQPiKnvD0="
      ],
      "gamma": [
        "kuixP6gitT8="
      ],
      "moving_mean": [
        "e0QGv1ZPNr8="
      ],
      "moving_variance": [
        "meERQZAd+kA="
      ]
    },
    "conv2d_1": {
      "bias": [
        "RKBxPI4oPz1wTZU7qba/PB+FlLoChIO8wPrlusinOLzjwne7OLIHvIZcsjzTzto81Ai4PAG5V7tYcPa7WZpEvaMuK72vGju8MVrKvGsXn7z1+B683oXDO5I5zTv295U862qOO4BGnTuHutY8N/+8O8KG/7uzNPi7gG24PGCALbw="
      ],
      "weights": [
        "BKF4uwZbwj0noSq7uXUeve0oDbwUxaS8dkpKvFl9JT58fG+9gveOvYgpOTy8rNy7wKq6vZSASD65m0i80EBgvUTVB705s608o9fePWCJibzYAo099AmKPVJ7ujzldy08OdvuPbhhAL13bM89U7AaPZqNCT5nN309RPNPvRKsSz0kALC9HLrVvSoXTz1yBV89ZALZvTOk1D0wh349+lCOve1piryGon89gAVFPTXLYb1Ng709ruLkvQweMrx+qfg8aNPYPATfXT2xAya9KhbUvSmij77Cw2K8K/M7PuiZuL0ECRA8NGlRvbMrj7wcCQw96ruJPSz5qL3uNry9stSkvdOLgb3+t8G9vaKcvcNzkrxEX7Q8g8W1PQSx3bghBVW9JRHDPbCVoL1bZDK9eCnUPcSXL77S63O9++RSPVRQTb2zEMK9Ek29vGntXT1z8js9fJF/PRdfi7xe9cU9ZRGkvZgO7T0GkV2+mKafvfCsozzOlbA7PIbVPeOTh71KPpY8GENjuyGSlz3bHae9+A/tPWMxYzyjyZ28xNoRvr2UJrw1IOe8et31PVEE1z1S7qu97G+nvSPONr4Iwfs73TYJPlQvUjvXHwk9jdsDvsuFJbp/qvC9fUSMvXYRBDt8Owy8U+RcPLKPpD3Ojok9zp6rvFHo0T24X7E8i7g1voeJtT2AZOa8QmQxvAQltD1o9z89xUqSPdVdtbwO5j69sezUvd8AxD36Yrs76OwNvriPY7stRwI9GogFvc+BpT0AWT29obELvg+vKL2INYO8H2oDPkUykbtEES49RpJfPQkMoj18/Xo9Fou/OkfSNb6VV/C9jzj0va7LTr3b5GC95tCmvfDoDr4abxG+CeWPPV0PejxhPlw9D7owPZlZ4ry2sN+8WB1/PQ2toTzzLOu82vfgPQ/AarzsyNQ8L7unPVCkwbxWllo9eeKDvXJ85jzQRnS9xLGrvcNzED6i20M+NbM4Pch8k73xnAg9b7MZOuiqMb6z2KK9pkgvvQg74D28HzE9",
        "Ih+svVIj4z2gvmG7yJIavYp3xD2sZYq9oRoTvh/CIT3tHZ29EwsKPseBkz33NKG84H/tvZGFlD11ouW97gFcu0Rgmr2hgR68FWXjvYZajr2iaAM+SdVjPfRnoz0wkXm9wOnWvbZ6CT1cKNO8zV+8vS1CMT39gQq8wIyUvFNjY7zBObU9d76wPc7GOLxW09i8uBboPJ3NBj7SMcE8T2e1vcLIND1Edzs8xcsZPSucLT68coc8UxgUPWCxDj0spc48STSNPUKsb705Jzy+/9LUvImYE77jiHo+VnmMvboqnz0Xbre85NasvdbkybvvJ7I93QvNuwXuRL2VfT88CTM9PbYQo72hGZ49hZ6wPdORJjulpem8FlaLPc3ZLb6L/iM+GptNvdeVgjyeIvi8+Vuyu8MzS7xddlY9rpauu+/xxb0wugU+7Po5Pc+eODyCH7g9KvnWPfznMz0cv429Qo61vYQ3ATy8fWU9XOXhvEJq9bz/j9c9s7TwvGUkhztP1jc8ZESGvXJfBr5tXEk+pqqBPLQ5mLyaGYg9xc44vJM9mzz9rbE9OvADvZreEL3Wd0o9Q14gva0QyjzLa849XjUbPRc5uLrZiwQ8TL7kO9fr+T3eLbG+rSIbvrNbCDwZy7Y9RrejPNoZoL1GWek9HqvsPVI1KDyF8uM8R7vcPT+5yzuEvAu9cvkcPSfKIbxbz1U8rK4AvrdCLL0vxY89YvpWPIDzxL1/xyi6MuTcPRowbT5x5Ii95xZ3vbqZEr34ARq7jkcUvczeFb78heM9WJ7FPADkDLwmNH46SB0OPbXjq7y5QwS9gIQYPW194bzAoa49b50KPmj+BL1HVx09Ld+hPehigLx50SA+uPEDvbyI2T21ZF696gxevfwr0z0cscc8KwPlvMP47jxfaxQ8gqa7PRUnljuY3KK96oIxPcl/D73T9ZM96XivvaKLAj6gJNK9Zf8WvM8A4bxpit29C8bpvYqKjT0153o8jon3vQpzm7x/bdM9p5qwPSZJ4jrTACw9",
        "UxvIveTyLzxXX4M8i4pBPBGR8jwwww49ehqePQ8cubuheRA+6VjlvM4sML23udw8zcWVPRq4ZT2zlAa+EmSOPU7MuD2UQgC+/3skPaDyNz7JKLm+Tl3GPQOnNzs8FPi8Xk01Pe4ljT3yhVE9Joo0PfoKWz4JvSc9CMLaOseMhL2HcMI9j0+lPIajDj4NJGQ8NlgxvPACLT1gH5+80QQFvOzszT0JW1K8tk9xvZdzjzyddie9IvJKveuOob10hv49O+h8vZktoj2TkHa+B8v4PT8YobzEoCm863vrPBaLSb1ik9I9Mf50vSH8Sj0mZjG9cjpVvSRXtjsihAg+4Eldvd5Y4DxhMD08GA33PR7I4D3lany+LAa0vV1y0jpnubS8nryEPRQ4FD3ak848UtzXvcNKQD3IJTs9u4xTPQr+nD21lDW9tX7cPFwfgby4Oqe9RoQWPYVidL3NSug8t2wXPp0VS73mPa08564rvu5Egb0hXDA9OTmcPfGUE71Tipu901nfPW7wFj7WDDs+cK7KPa0MnryAtWw8AJAeO+kxgD2F+Qw+9AgAPq7BgD05XGS9b+8Pvoriyz0o7wQ+JHQLPsuSIr2ctVw9UruivZEB0zofOCA+zEdEPVLTMjxUfso97hqIu9phPT3J34M9plHRvS+tvry4doY9UtEcvcYyELxELSc+zFypvOxaqr4KJCk8FEadvZxKn71xND+9Rs4NPnYU+L2u5Q49u4zFPWArnrwljFa9mn6+vVWIFj5/OtO7Nm60vWchnD3l4+K8Jp+mOzN3qD1pO5687cLbvDpo7rs2ufG8ujEpvXcS5j2dQrk8TdexPF4QM73gBKC9oHaMvVBSDz6zaDo9fn1fPa88Pb365o+9ofSRPdKmIb54ZLi9XPRBvblWjT3esJm8YrX9vaj7vTshcSQ+pVSVvYeiVb0tkIe7tdbFvcYQAr2HtbY8DNS4vZmtMT7gZ+k9zArmvGfCD72gUVi+T6MuvZP/aj3e/AA7rDEdvlV2Nb3tTfO8",
        "x/0nPZPZDD5CInG92bbnPULz0T1PYaS81SkgvGTkj7t3hyI8Yj8JPpDZDb3dM8S9wR2TvBvtVj1RFio7JF1NvQHc5L3dt8k9Kj2TPYiwXT1SN2W9HGO8vRlPCD6gcAI98g/VPRVg/L0HAQw+JfY4PV0vuzwM866817LhvYq+KD6HHdM8HgffODrJAD6x4089U791vQqs1L0x+6o9u05IPPcVQTy6ESk9BbWJvfN/cL2RZK89ngGmPQ/Xzrx6ryU9lELWPaWM+z1OyQ+9+k/EPQ7E2z0LlqO965cuPULH/j3r6Kw7oqVxvQdE9D2guoQ9gv0tvdc7mj2zGGy9FMkOu1fAzD0JWFQ9m52cvQ2fZD64ZZC8WevAvQvcZD3t+pw9DAevPRlYFzx51dW84NjzPEgACz3Vh8g7l9zRPenBFT1cc2m8YNtDvbZckr7r1W89IEuePKWOW74d/bo9vCQGviRyG76hljY+qRqePVb0oD3M2cE8kxiPvUXWWrwkyWa9qITVveevjDvStog6GdYJvY7ZCj3b9cU9wmlRvSMWgL3Mojk930utvbttEbyK6Gg8upeNPUzDFT4OhQU8kx+fPP2Ft707+2097inUPPUmkLxOEMy9x8jXvZwocT2U2pI8GpWOvZVO6byoK1Q9RAarPY1kMzksbLs98TaevUhDbzxPV3I9RFYEPgjkGLzpXIk9kEcqvJap3jw+KFk+SGnBvKds6j1BNJq9AxFnPWFaU700Fq67+uobPYCfXD0t41a8I6UJuxyclj3P1XQ91YfLPQrYYz5+zQO9QtgOvSC+bb3aVb49zyDPPYVMub3ycjm9QdtrPcuT+zzwJ3C8PE6AO8kBXb5lmGu+S6lbvYGygj1sa+s9e9vhPUFHMjxPC4a8FQkZPtRFLbxH+Ig9Ryg0PahZ7zxnIrY9C2SKPYWiqj2nhSO9CqhLvZUpMr0ZyBW+1abWPFbbLD74sJC9Pvv+vWrJxLyT48q8buixOg8IM71K1aY90cGevQuoOr0Z/rG6",
        "0IOuPag4iz1kNkO+1/qkPXGzLb0B/Vg7t39JPRAPYr1+gIW8V6KIPcU9Dryd65A8EzTZvVtELT6+VHK+NnUDPufnfzyju3u9AGoCvqzHADzk1sy8uIU2PV3dYD7sZ629x+Tfve6QZj1B8qQ70OfIvPB8Fz5NBa68SZPZvBCmqzxUDsK9hmnzu2eK9buUjuw6Jw/0PdaPHruXOjI9t4B3PY1MUz3mRf+9N1nSPa0Blz0SA5a9UJlLvUD16DxW0lo94UZDvR81yj1GvKQ9Pq8lu5PIgD1QiWE7pXbyvb3xl73nlyk9wPDlPZJozjzHvIy8Z0SwPZRFLb1yL3A+WvczPH3Fsjwr8R49KTeivMUeVD50Ua69KgmDPO2HZj0GZRy+omKsPei2tLx1jK49xDPAu2LZ5b0jFr883j05vVuPq73MABA+wroEvEvQML66vAc+YDrTPQ5YWLwgDYs9nyalvX6oTr0YdQA+HX19vdIwsT04ol+9rw0APuCtqr1wFy4+"
      ]
    },
    "conv2d_2": {
      "bias": [
        "mvAPvPRdEzy7d9U76snROx5jtrsbCjQ7bnymO7ftQjmRwDe7ULlIPG71cjvHDXw7LNXKu7xbDTutkhC8v0qNuyj0gTs5Lka8HRSEOiciRDmNTly7FoorPHyJUbqBoxc7h7feOmxCLbp/oaA71xc1PL+errtISnQ5uxO+u4QpBLw="
      ],
      "weights": [
        "oKhTOuuVQrxQoHE9kKK6vQaidb3jR5E9quewvBZipb13KXc9i7WZvXKe2zrUX1K9OHuXPJZXOD1/BFO9f6GhPVgZnr3VPMs8o49NPWoWHj5aJfc9pXELOjtBij2G0Yi9IDXrvV9ZHbwezgK8fzZrvazSSL1c9hu+25mhPXy1mrz/LEC9TkaXPcPohL0bBTS8KwTAvaGMozz71AI826/JvHShWj0fsUU9io28PRCWX72W8Pu9gQwLvYtK572WXfK8Kl6XveUNLL2m/dG7XIWjvXyDkT00+dm9qEiKPW+zaL2FV7E9S3dCveC1i710G9c95UteveMw0DzdsHi9RgZ/vTFqFbsoMYc9EwrUu48plT1sZ6A7YVOoPceAGr2nGme7y1l0vE1D57059Oi7Ghv7PfpAbjzqrIu9eRNduxlWBj5SIFi9uom1PWphJz5w32+9BJZMPd+zcL2Ngm89MgyTPUVTI727ZAs9n0HBPYaiLD2+UC09CE5JvX/7AT4FaP08W4H5PIGavD1e3SG9xRJNvZiUuL1/NJC9UN+CPWLkhT1AD+29X4b8vTfECD0WoZI9kR6WvQ3D+z2lTLs9Ye+CPcIB5zqSbJK7bsBMPRZihTsLztQ9S/n7PPvwwL3/CBM9EA8DPQdHnLxzXII6lWSgPU5UuL34pqW987NHvfj6NDz6IOa9UAAWPRbChL2SYei8XGauvDfPYz3+JBA+cNSePAfeE70YuQ2+CmLWvH6KVTsr9+o8QyBGPc2mQT3T5zY9s1U5PMz8mr3fydg9UUuSu0fAf72UiQG+DWFSvaMGTz3F3ZE9TuVsvZUmuz08szQ924i6vRewVLxCi6E9aI9ivSNJIb3D/Tu9yFdivWoxo7xLp1g9VSchPQAFsbwfzlm82t7TPLxppr2hkHG7OqU3vWknS704i+07IvU8O9Cxwzzz/189M+1bvbWw0L3o2RG83xsovTeDoL0npJs9Nb1ovMw1JDzJPXA8FQC1vJkzaj32V5e90uTDPEf6zj3N+Ak9",
